{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\LocalStore\ecomes\Documents\GitHub\lassopack\lassopack_v144\cs_cvlasso.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}26 Oct 2024, 12:05:04
{txt}r; t=0.02 12:05:04

{com}. about

{txt}StataNow/SE 18.5 for Windows (64-bit x86-64)
Revision 16 Jul 2024
Copyright 1985-2023 StataCorp LLC

Total physical memory:     {res}   8.00 GB
{txt}Available physical memory: {res}   0.87 GB

{txt}Stata license: {res}100-user network, expiring 14 Jul 2026
{txt}Serial number: {res}401809307946
  {txt}Licensed to: {res}Stata User
               Heriot-Watt University
{txt}r; t=0.00 12:05:04

{com}. which cvlasso
{txt}.\cvlasso.ado
{res}*! cvlasso 1.0.13 18dec2023
*! lassopack package 1.4.4
*! authors aa/ms
{txt}r; t=0.00 12:05:04

{com}. which lasso2
{txt}.\lasso2.ado
{res}*! lasso2 1.0.14 26oct2024
*! lassopack package 1.4.4
*! authors aa/ms
{txt}r; t=0.00 12:05:04

{com}. which lasso2_p
{txt}.\lasso2_p.ado
{res}*! lasso2_p 1.0.06 14oct2019
*! lassopack package 1.4.4
*! authors aa/ms
{txt}r; t=0.00 12:05:04

{com}. which lassoutils
{txt}.\lassoutils.ado
{res}*! lassoutils 1.2.07 26Oct2024
*! lassopack package 1.4.4
*! authors aa/cbh/ms
{txt}r; t=0.01 12:05:04

{com}. 
. * data source
. global prostate prostate.data
{txt}r; t=0.00 12:05:04

{com}. // global prostate https://web.stanford.edu/~hastie/ElemStatLearn/datasets/prostate.data
. 
. * program to compare two matrices in terms of avg abs deviation
. cap program drop comparemat
{txt}r; t=0.00 12:05:04

{com}. program define comparemat , rclass
{txt}  1{com}.         syntax anything [, tol(real 10e-3)] 
{txt}  2{com}.         local A         : word 1 of `0'
{txt}  3{com}.         local B         : word 2 of `0'
{txt}  4{com}.         tempname Amat Bmat
{txt}  5{com}.         mat `Amat' = `A'
{txt}  6{com}.         mat `Bmat' = `B'
{txt}  7{com}.         local diff=mreldif(`Amat',`Bmat')
{txt}  8{com}.         di as text "mreldif=`diff'. tolerance = `tol'"
{txt}  9{com}.         mat list `Amat'
{txt} 10{com}.         mat list `Bmat'
{txt} 11{com}.         return scalar mreldif = `diff'
{txt} 12{com}.         assert `diff'<`tol'
{txt} 13{com}. end
{txt}r; t=0.00 12:05:04

{com}. 
. 
. set seed 123456
{txt}r; t=0.00 12:05:04

{com}. 
. ********************************************************************************
. *** compare with glmnet                                                                  ***
. ********************************************************************************
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 12:05:04

{com}. drop if _n==97 // to ensure same size for each fold
{txt}(1 observation deleted)
r; t=0.00 12:05:04

{com}. 
. global model lpsa lcavol lweight age lbph svi lcp gleason pgg45
{txt}r; t=0.00 12:05:04

{com}. 
. * generate fold variable
. gen myfid = 1 if _n<=32
{txt}(64 missing values generated)
r; t=0.00 12:05:04

{com}. replace myfid = 2 if _n>32 & _n<=64
{txt}(32 real changes made)
r; t=0.00 12:05:04

{com}. replace myfid = 3 if _n>64
{txt}(32 real changes made)
r; t=0.00 12:05:04

{com}. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5)
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 2.3865184 {space 3} {res} 1.1559279  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.4635023 {space 3} {res} .42894674  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.485229 {space 3} {res} .36948736  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=0.40 12:05:04

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:05:04

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=TRUE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 2.386518 1.463497 1.484953
> > var(predict(c,newx=X,s="lambda.min"))
>          1
> 1 0.608541
> */
. mat G = ( 2.38651835211576 \ 1.46349718052732 \ 1.48495268875459 )
{txt}r; t=0.00 12:05:04

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0001112104025343. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 2.3865184
{txt}c2 {res} 1.4635023
{txt}c3 {res}  1.485229
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 2.3865184
{txt}r2 {res} 1.4634972
{txt}r3 {res} 1.4849527
{reset}r; t=0.21 12:05:05

{com}. cap drop xb
{txt}r; t=0.00 12:05:05

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=15 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4705447      0.4939937
{txt}{space 10}lweight {c |}{col 21}{res}      0.4738822      0.5463838
{txt}{space 13}lbph {c |}{col 21}{res}      0.0222266      0.0675109
{txt}{space 14}svi {c |}{col 21}{res}      0.4597209      0.5816563
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021287      0.0033429
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.0467006     -0.4001276
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.08 12:05:05

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446048    .7801003   .9116189   4.111986
{txt}r; t=0.00 12:05:05

{com}. assert reldif(0.608541,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:05:05

{com}. 
. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) prestd
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 2.3865184 {space 3} {res} 1.1559279  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.4635023 {space 3} {res} .42894674  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.485229 {space 3} {res} .36948736  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=0.04 12:05:05

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:05:05

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=TRUE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 2.386518 1.463497 1.484953
> > var(predict(c,newx=X,s="lambda.min"))
>          1
> 1 0.608541
> */
. mat G = ( 2.38651835211576 \ 1.46349718052732 \ 1.48495268875459 )
{txt}r; t=0.00 12:05:05

{com}. comparemat L G // compare coeffs
{txt}mreldif=.000111210402534. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 2.3865184
{txt}c2 {res} 1.4635023
{txt}c3 {res}  1.485229
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 2.3865184
{txt}r2 {res} 1.4634972
{txt}r3 {res} 1.4849527
{reset}r; t=0.00 12:05:05

{com}. cap drop xb
{txt}r; t=0.00 12:05:05

{com}. predict double xb, lopt
{txt}Estimate  with lambda=15 (lopt).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4705447      0.4939937
{txt}{space 10}lweight {c |}{col 21}{res}      0.4738822      0.5463838
{txt}{space 13}lbph {c |}{col 21}{res}      0.0222266      0.0675109
{txt}{space 14}svi {c |}{col 21}{res}      0.4597209      0.5816563
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021287      0.0033429
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.0467006     -0.4001276
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.01 12:05:05

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446048    .7801003   .9116189   4.111986
{txt}r; t=0.00 12:05:05

{com}. assert reldif(0.608541,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:05:05

{com}. 
. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) unitload
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 2.1036977 {space 3} {res} .86238904  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.4298598 {space 3} {res} .47710985  ^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res} 1.4275375 {space 3} {res} .35365915  *
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lopt is at the limit of the lambda range.
{txt}r; t=0.02 12:05:05

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:05:05

{com}. /*
> > # cross-validation with intercept & standardisation
> > c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=TRUE,standardize=FALSE)
> > c$cvm # mean-squared prediction error
> [1] 2.103697 1.429934 1.427561
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.7840688
> */ 
. mat G = ( 2.10369705382686 \ 1.42993421234064 \ 1.42756055333919 )
{txt}r; t=0.00 12:05:05

{com}. comparemat L G // compare coeffs
{txt}mreldif=.000030615522484. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 2.1036977
{txt}c2 {res} 1.4298598
{txt}c3 {res} 1.4275375
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 2.1036971
{txt}r2 {res} 1.4299342
{txt}r3 {res} 1.4275606
{reset}r; t=0.00 12:05:05

{com}. cap drop xb
{txt}r; t=0.00 12:05:05

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=1.5 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.5568426      0.5653571
{txt}{space 10}lweight {c |}{col 21}{res}      0.5707438      0.6139211
{txt}{space 14}age {c |}{col 21}{res}     -0.0208973     -0.0224946
{txt}{space 13}lbph {c |}{col 21}{res}      0.0911393      0.0935981
{txt}{space 14}svi {c |}{col 21}{res}      0.6204808      0.7149700
{txt}{space 14}lcp {c |}{col 21}{res}     -0.1126800     -0.1447125
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0068648      0.0071245
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}      0.6415930      0.5426554
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=1.5).
r; t=0.02 12:05:05

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446048    .8854875    .513909   4.598263
{txt}r; t=0.00 12:05:05

{com}. assert reldif(0.7840688,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:05:05

{com}. 
. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) nocons unitload
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 1.9998833 {space 3} {res} .72964224  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res}   1.26607 {space 3} {res} .39073554  ^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.246129 {space 3} {res} .28903645  *
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lopt is at the limit of the lambda range.
{txt}r; t=0.12 12:05:05

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:05:05

{com}. /*
> > c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=FALSE,standardize=FALSE)
> > c$cvm # mean-squared prediction error
> [1] 1.999806 1.266384 1.246805
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.7919695
> */
. mat G = ( 1.99980614859113 \ 1.26638436668758 \ 1.24680539174676 )
{txt}r; t=0.00 12:05:05

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0003010654307453. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 1.9998833
{txt}c2 {res}   1.26607
{txt}c3 {res}  1.246129
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 1.9998061
{txt}r2 {res} 1.2663844
{txt}r3 {res} 1.2468054
{reset}r; t=0.00 12:05:05

{com}. cap drop xb
{txt}r; t=0.00 12:05:05

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=1.5 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.5473610      0.5569029
{txt}{space 10}lweight {c |}{col 21}{res}      0.6258035      0.6453516
{txt}{space 14}age {c |}{col 21}{res}     -0.0188110     -0.0217852
{txt}{space 13}lbph {c |}{col 21}{res}      0.0801178      0.0880196
{txt}{space 14}svi {c |}{col 21}{res}      0.6260775      0.7250462
{txt}{space 14}lcp {c |}{col 21}{res}     -0.1142476     -0.1460891
{txt}{space 10}gleason {c |}{col 21}{res}      0.0505847      0.0620963
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0059407      0.0060062
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=1.5).
r; t=0.03 12:05:05

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.443933    .8905195   .5327895   4.561406
{txt}r; t=0.00 12:05:05

{com}. assert reldif(0.7919695,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:05:05

{com}. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) nocons
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 1.9069161 {space 3} {res} .92525083  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.2339936 {space 3} {res} .35347077  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.309495 {space 3} {res}  .3270498  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=0.12 12:05:05

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:05:05

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=FALSE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 1.906526 1.232220 1.310531
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.6062457
> */
. mat G = ( 1.90652583524832 \ 1.23222044017428 \ 1.31053116174191 )
{txt}r; t=0.00 12:05:05

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0007943387878944. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 1.9069161
{txt}c2 {res} 1.2339936
{txt}c3 {res}  1.309495
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 1.9065258
{txt}r2 {res} 1.2322204
{txt}r3 {res} 1.3105312
{reset}r; t=0.00 12:05:05

{com}. cap drop xb
{txt}r; t=0.00 12:05:05

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=15 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4712765      0.5002634
{txt}{space 10}lweight {c |}{col 21}{res}      0.4608978      0.4351342
{txt}{space 13}lbph {c |}{col 21}{res}      0.0239597      0.0823598
{txt}{space 14}svi {c |}{col 21}{res}      0.4613426      0.5955516
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021037      0.0031282
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.01 12:05:05

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446541    .7785216   .9124108     4.1091
{txt}r; t=0.00 12:05:05

{com}. assert reldif(0.6062457,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:05:05

{com}. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) nocons prestd
{txt}Use user-specified fold variable.

K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 1.9069161 {space 3} {res} .92525083  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.2339936 {space 3} {res} .35347077  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.309495 {space 3} {res}  .3270498  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=0.13 12:05:05

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:05:05

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=FALSE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 1.906526 1.232220 1.310531
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.6062457
> */
. mat G = ( 1.90652583524832 \ 1.23222044017428 \ 1.31053116174191 )
{txt}r; t=0.00 12:05:05

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0007943387878951. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 1.9069161
{txt}c2 {res} 1.2339936
{txt}c3 {res}  1.309495
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 1.9065258
{txt}r2 {res} 1.2322204
{txt}r3 {res} 1.3105312
{reset}r; t=0.00 12:05:05

{com}. cap drop xb
{txt}r; t=0.00 12:05:05

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=15 (lopt).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4712765      0.5002634
{txt}{space 10}lweight {c |}{col 21}{res}      0.4608978      0.4351342
{txt}{space 13}lbph {c |}{col 21}{res}      0.0239597      0.0823598
{txt}{space 14}svi {c |}{col 21}{res}      0.4613426      0.5955516
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021037      0.0031282
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.01 12:05:05

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446541    .7785216   .9124108     4.1091
{txt}r; t=0.00 12:05:05

{com}. assert reldif(0.6062457,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:05:05

{com}. 
. 
. ********************************************************************************
. *** validate                                                                    ***
. ********************************************************************************
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 12:05:05

{com}.  
. global model lpsa lcavol lweight age lbph svi lcp gleason pgg45
{txt}r; t=0.00 12:05:05

{com}. gen sample = _n<70 
{txt}r; t=0.00 12:05:05

{com}.  
. foreach type of newlist lopt lse {c -(} 
{txt}  2{com}.  
. local type lse 
{txt}  3{com}.  
. // check that right beta is used for predict
. // also validates that "if" works 
. cvlasso $model if sample
{txt}  4{com}. local mylopt = e(`type')
{txt}  5{com}. cap drop myxb  
{txt}  6{com}. predict double myxb if !sample, xb `type' postres
{txt}  7{com}. mat A = e(b)
{txt}  8{com}. 
. lasso2 $model if sample, lambda(`mylopt')
{txt}  9{com}. cap drop myxb2
{txt} 10{com}. predict double myxb2 if !sample, xb
{txt} 11{com}. mat B = e(b)
{txt} 12{com}. 
. comparemat A B
{txt} 13{com}. assert myxb2==myxb
{txt} 14{com}. 
. // and now with alpha list
. // use lglmnet option
. cvlasso $model if sample, alpha(0 0.3 0.7 1) lglmnet
{txt} 15{com}. local mylopt = e(`type')
{txt} 16{com}. local myalpha = e(alphamin)
{txt} 17{com}. cap drop myr
{txt} 18{com}. predict double myr if !sample, r `type' postres
{txt} 19{com}. mat A = e(b)
{txt} 20{com}. 
. lasso2 $model if sample, lambda(`mylopt') alpha(`myalpha') lglmnet
{txt} 21{com}. cap drop myr2
{txt} 22{com}. predict double myr2 if !sample, r
{txt} 23{com}. mat B = e(b)
{txt} 24{com}. 
. comparemat A B
{txt} 25{com}. assert myr2==myr
{txt} 26{com}. 
. {c )-}

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .70214335 {space 3} {res} .13668767  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .68166758 {space 3} {res} .13770442  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .65032545 {space 3} {res} .13589084  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .61368184 {space 3} {res} .12902249  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .57648569 {space 3} {res} .11951189  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res}  .5455564 {space 3} {res} .11125054  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .52022373 {space 3} {res} .10413738  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .49994965 {space 3} {res} .09808444  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .48394209 {space 3} {res} .09299888  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res}  .4715922 {space 3} {res} .08866583  ^
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .46159647 {space 3} {res} .08503773  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .45319845 {space 3} {res}  .0819249  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .44655158 {space 3} {res} .07921285  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .43989318 {space 3} {res} .07690231  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .43416143 {space 3} {res} .07503205  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .42831327 {space 3} {res} .07332298  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .42328622 {space 3} {res} .07186312  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .41909404 {space 3} {res} .07059609  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .41541784 {space 3} {res} .06940436  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .41239688 {space 3} {res} .06842274  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .41115051 {space 3} {res} .06762829  *
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .41125524 {space 3} {res} .06734084  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .41189673 {space 3} {res} .06726297  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .41299996 {space 3} {res} .06716497  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .41535333 {space 3} {res} .06772844  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .41747426 {space 3} {res} .06851425  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .41770086 {space 3} {res} .06978754  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .41811876 {space 3} {res} .07107378  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .41867378 {space 3} {res} .07229779  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .41856902 {space 3} {res} .07315811  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .41856329 {space 3} {res} .07409234  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res}   .418418 {space 3} {res} .07512313  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .41815181 {space 3} {res}  .0761924  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .41800644 {space 3} {res} .07722359  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .41780862 {space 3} {res} .07813846  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .41776606 {space 3} {res} .07897215  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .41784915 {space 3} {res} .07973505  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res}  .4178434 {space 3} {res}  .0803494  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .41783315 {space 3} {res} .08086973  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res}  .4177931 {space 3} {res} .08133498  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .41780825 {space 3} {res} .08175923  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res}  .4178703 {space 3} {res} .08214655  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .41796691 {space 3} {res} .08250007  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .41808819 {space 3} {res}  .0828227  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .41822631 {space 3} {res} .08311707  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .41837509 {space 3} {res} .08338564  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .41872946 {space 3} {res} .08363953  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .41907617 {space 3} {res} .08387238  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .41940754 {space 3} {res} .08408564  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .41972231 {space 3} {res} .08428089  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .42001978 {space 3} {res} .08445959  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .42029967 {space 3} {res} .08462309  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .42056204 {space 3} {res} .08477263  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res}  .4208072 {space 3} {res} .08490936  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .42103565 {space 3} {res} .08503435  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .42124801 {space 3} {res} .08514857  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .42144499 {space 3} {res} .08525293  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .42162738 {space 3} {res} .08534826  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .42179596 {space 3} {res} .08543531  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .42195157 {space 3} {res} .08551481  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .42209501 {space 3} {res} .08558737  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .42222708 {space 3} {res} .08565361  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .42234857 {space 3} {res} .08571407  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .42246021 {space 3} {res} .08576923  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .42256272 {space 3} {res} .08581956  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .42265677 {space 3} {res} .08586548  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .42274302 {space 3} {res} .08590737  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .42282205 {space 3} {res} .08594557  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .42289444 {space 3} {res} .08598041  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .42296071 {space 3} {res} .08601219  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .42302135 {space 3} {res} .08604116  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .42307681 {space 3} {res} .08606758  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .42312753 {space 3} {res} .08609167  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .42317389 {space 3} {res} .08611363  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .42321625 {space 3} {res} .08613366  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .42325495 {space 3} {res} .08615191  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res}  .4232903 {space 3} {res} .08616855  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .42332257 {space 3} {res} .08618371  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .42335204 {space 3} {res} .08619754  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .42337894 {space 3} {res} .08621014  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .42340349 {space 3} {res} .08622162  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .42342589 {space 3} {res} .08623209  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .42344633 {space 3} {res} .08624163  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .42346497 {space 3} {res} .08625033  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .42348198 {space 3} {res} .08625825  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res}  .4234975 {space 3} {res} .08626547  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .42351165 {space 3} {res} .08627205  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .42352455 {space 3} {res} .08627805  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .42353631 {space 3} {res} .08628352  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .42354704 {space 3} {res}  .0862885  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .42355682 {space 3} {res} .08629303  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .42356574 {space 3} {res} .08629717  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .42357387 {space 3} {res} .08630094  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .42358128 {space 3} {res} .08630437  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .42358803 {space 3} {res}  .0863075  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .42359419 {space 3} {res} .08631036  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .42359981 {space 3} {res} .08631295  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .42360492 {space 3} {res} .08631532  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .42360958 {space 3} {res} .08631748  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .42361383 {space 3} {res} .08631945  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
Estimate lasso with lambda=28.078 (lse).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2177045      0.3782994
{txt}{space 10}lweight {c |}{col 21}{res}      0.4397825      0.8391637
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}      0.1812277     -1.3919237
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=28.07802540248).
(69 missing values generated)

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2177045      0.3782994
{txt}{space 10}lweight {c |}{col 21}{res}      0.4397825      0.8391637
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}      0.1812277     -1.3919237
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=28.07802540248).
(69 missing values generated)
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,3]
       lcavol    lweight      _cons
y1 {res} .21770447  .43978251  .18122774
{reset}{res}
{txt}__000001[1,3]
       lcavol    lweight      _cons
y1 {res} .21770447  .43978251  .18122774
{reset}
K-fold cross-validation with 10 folds. Elastic net with alpha=0.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .47002812 {space 3} {res} .41012597 {space 3} {res} .06401609  ^
{txt}         2{c |} {space 3} {res} .42827212 {space 3} {res} .40728618 {space 3} {res} .06307755  
{txt}         3{c |} {space 3} {res}  .3902256 {space 3} {res} .40470048 {space 3} {res} .06225597  
{txt}         4{c |} {space 3} {res} .35555903 {space 3} {res} .40236398 {space 3} {res} .06155117  
{txt}         5{c |} {space 3} {res} .32397215 {space 3} {res} .40027036 {space 3} {res} .06096131  
{txt}         6{c |} {space 3} {res} .29519136 {space 3} {res} .39841194 {space 3} {res} .06048296  
{txt}         7{c |} {space 3} {res} .26896737 {space 3} {res} .39677969 {space 3} {res} .06011112  
{txt}         8{c |} {space 3} {res} .24507305 {space 3} {res} .39536326 {space 3} {res} .05983949  
{txt}         9{c |} {space 3} {res} .22330144 {space 3} {res} .39415121 {space 3} {res} .05966063  
{txt}        10{c |} {space 3} {res} .20346395 {space 3} {res} .39313106 {space 3} {res} .05956626  
{txt}        11{c |} {space 3} {res} .18538878 {space 3} {res} .39228957 {space 3} {res} .05954754  
{txt}        12{c |} {space 3} {res} .16891935 {space 3} {res}  .3916129 {space 3} {res} .05959536  
{txt}        13{c |} {space 3} {res} .15391302 {space 3} {res} .39108687 {space 3} {res} .05970059  
{txt}        14{c |} {space 3} {res} .14023981 {space 3} {res} .39069715 {space 3} {res} .05985432  
{txt}        15{c |} {space 3} {res} .12778129 {space 3} {res} .39042948 {space 3} {res} .06004803  
{txt}        16{c |} {space 3} {res} .11642955 {space 3} {res}  .3902699 {space 3} {res} .06027379  
{txt}        17{c |} {space 3} {res} .10608627 {space 3} {res} .39020487 {space 3} {res} .06052428  *
{txt}        18{c |} {space 3} {res} .09666186 {space 3} {res}  .3902215 {space 3} {res} .06079293  
{txt}        19{c |} {space 3} {res} .08807469 {space 3} {res}  .3903076 {space 3} {res}  .0610739  
{txt}        20{c |} {space 3} {res} .08025038 {space 3} {res} .39045184 {space 3} {res} .06136209  
{txt}        21{c |} {space 3} {res} .07312115 {space 3} {res} .39064375 {space 3} {res} .06165314  
{txt}        22{c |} {space 3} {res} .06662527 {space 3} {res} .39087384 {space 3} {res} .06194337  
{txt}        23{c |} {space 3} {res} .06070647 {space 3} {res} .39113356 {space 3} {res} .06222972  
{txt}        24{c |} {space 3} {res} .05531347 {space 3} {res} .39141529 {space 3} {res} .06250972  
{txt}        25{c |} {space 3} {res} .05039957 {space 3} {res} .39171237 {space 3} {res}  .0627814  
{txt}        26{c |} {space 3} {res} .04592222 {space 3} {res} .39201899 {space 3} {res} .06304327  
{txt}        27{c |} {space 3} {res} .04184261 {space 3} {res}  .3923302 {space 3} {res} .06329421  
{txt}        28{c |} {space 3} {res} .03812543 {space 3} {res} .39264181 {space 3} {res} .06353346  
{txt}        29{c |} {space 3} {res} .03473847 {space 3} {res} .39295034 {space 3} {res} .06376053  
{txt}        30{c |} {space 3} {res}  .0316524 {space 3} {res} .39325295 {space 3} {res} .06397518  
{txt}        31{c |} {space 3} {res} .02884049 {space 3} {res} .39354738 {space 3} {res} .06417738  
{txt}        32{c |} {space 3} {res} .02627838 {space 3} {res} .39383186 {space 3} {res} .06436723  
{txt}        33{c |} {space 3} {res} .02394388 {space 3} {res} .39410506 {space 3} {res} .06454499  
{txt}        34{c |} {space 3} {res} .02181677 {space 3} {res} .39436605 {space 3} {res}   .064711  
{txt}        35{c |} {space 3} {res} .01987863 {space 3} {res} .39461421 {space 3} {res} .06486568  
{txt}        36{c |} {space 3} {res} .01811267 {space 3} {res} .39484918 {space 3} {res} .06500951  
{txt}        37{c |} {space 3} {res} .01650359 {space 3} {res} .39507085 {space 3} {res} .06514299  
{txt}        38{c |} {space 3} {res} .01503746 {space 3} {res} .39527928 {space 3} {res} .06526666  
{txt}        39{c |} {space 3} {res} .01370157 {space 3} {res} .39547467 {space 3} {res} .06538108  
{txt}        40{c |} {space 3} {res} .01248436 {space 3} {res} .39565737 {space 3} {res} .06548677  
{txt}        41{c |} {space 3} {res} .01137528 {space 3} {res} .39582777 {space 3} {res}  .0655843  
{txt}        42{c |} {space 3} {res} .01036473 {space 3} {res} .39598637 {space 3} {res} .06567418  
{txt}        43{c |} {space 3} {res} .00944396 {space 3} {res}  .3961337 {space 3} {res} .06575692  
{txt}        44{c |} {space 3} {res} .00860498 {space 3} {res} .39627031 {space 3} {res} .06583304  
{txt}        45{c |} {space 3} {res} .00784054 {space 3} {res} .39639678 {space 3} {res} .06590299  
{txt}        46{c |} {space 3} {res} .00714401 {space 3} {res} .39651369 {space 3} {res} .06596722  
{txt}        47{c |} {space 3} {res} .00650936 {space 3} {res} .39662164 {space 3} {res} .06602617  
{txt}        48{c |} {space 3} {res} .00593108 {space 3} {res} .39672117 {space 3} {res} .06608023  
{txt}        49{c |} {space 3} {res} .00540418 {space 3} {res} .39681286 {space 3} {res} .06612978  
{txt}        50{c |} {space 3} {res} .00492409 {space 3} {res} .39689723 {space 3} {res} .06617517  
{txt}        51{c |} {space 3} {res} .00448665 {space 3} {res} .39697481 {space 3} {res} .06621673  
{txt}        52{c |} {space 3} {res} .00408806 {space 3} {res} .39704608 {space 3} {res} .06625476  
{txt}        53{c |} {space 3} {res} .00372489 {space 3} {res}  .3971115 {space 3} {res} .06628956  
{txt}        54{c |} {space 3} {res} .00339398 {space 3} {res} .39717151 {space 3} {res} .06632139  
{txt}        55{c |} {space 3} {res} .00309247 {space 3} {res} .39722654 {space 3} {res} .06635048  
{txt}        56{c |} {space 3} {res} .00281774 {space 3} {res} .39727696 {space 3} {res} .06637707  
{txt}        57{c |} {space 3} {res} .00256742 {space 3} {res} .39732314 {space 3} {res} .06640137  
{txt}        58{c |} {space 3} {res} .00233934 {space 3} {res} .39736541 {space 3} {res} .06642356  
{txt}        59{c |} {space 3} {res} .00213152 {space 3} {res} .39740409 {space 3} {res} .06644383  
{txt}        60{c |} {space 3} {res} .00194216 {space 3} {res} .39743947 {space 3} {res} .06646234  
{txt}        61{c |} {space 3} {res} .00176963 {space 3} {res} .39747182 {space 3} {res} .06647924  
{txt}        62{c |} {space 3} {res} .00161242 {space 3} {res}  .3975014 {space 3} {res} .06649466  
{txt}        63{c |} {space 3} {res} .00146917 {space 3} {res} .39752842 {space 3} {res} .06650873  
{txt}        64{c |} {space 3} {res} .00133866 {space 3} {res} .39755311 {space 3} {res} .06652158  
{txt}        65{c |} {space 3} {res} .00121973 {space 3} {res} .39757567 {space 3} {res} .06653329  
{txt}        66{c |} {space 3} {res} .00111138 {space 3} {res} .39759626 {space 3} {res} .06654398  
{txt}        67{c |} {space 3} {res} .00101264 {space 3} {res} .39761506 {space 3} {res} .06655373  
{txt}        68{c |} {space 3} {res} .00092268 {space 3} {res} .39763222 {space 3} {res} .06656263  
{txt}        69{c |} {space 3} {res} .00084072 {space 3} {res} .39764789 {space 3} {res} .06657074  
{txt}        70{c |} {space 3} {res} .00076603 {space 3} {res} .39766218 {space 3} {res} .06657813  
{txt}        71{c |} {space 3} {res} .00069798 {space 3} {res} .39767523 {space 3} {res} .06658488  
{txt}        72{c |} {space 3} {res} .00063597 {space 3} {res} .39768713 {space 3} {res} .06659103  
{txt}        73{c |} {space 3} {res} .00057947 {space 3} {res} .39769798 {space 3} {res} .06659663  
{txt}        74{c |} {space 3} {res} .00052799 {space 3} {res} .39770788 {space 3} {res} .06660174  
{txt}        75{c |} {space 3} {res} .00048109 {space 3} {res} .39771691 {space 3} {res}  .0666064  
{txt}        76{c |} {space 3} {res} .00043835 {space 3} {res} .39772515 {space 3} {res} .06661065  
{txt}        77{c |} {space 3} {res} .00039941 {space 3} {res} .39773266 {space 3} {res} .06661452  
{txt}        78{c |} {space 3} {res} .00036393 {space 3} {res}  .3977395 {space 3} {res} .06661805  
{txt}        79{c |} {space 3} {res}  .0003316 {space 3} {res} .39774575 {space 3} {res} .06662127  
{txt}        80{c |} {space 3} {res} .00030214 {space 3} {res} .39775144 {space 3} {res}  .0666242  
{txt}        81{c |} {space 3} {res}  .0002753 {space 3} {res} .39775663 {space 3} {res} .06662687  
{txt}        82{c |} {space 3} {res} .00025084 {space 3} {res} .39776136 {space 3} {res} .06662931  
{txt}        83{c |} {space 3} {res} .00022856 {space 3} {res} .39776567 {space 3} {res} .06663153  
{txt}        84{c |} {space 3} {res} .00020825 {space 3} {res}  .3977696 {space 3} {res} .06663355  
{txt}        85{c |} {space 3} {res} .00018975 {space 3} {res} .39777319 {space 3} {res}  .0666354  
{txt}        86{c |} {space 3} {res} .00017289 {space 3} {res} .39777645 {space 3} {res} .06663708  
{txt}        87{c |} {space 3} {res} .00015753 {space 3} {res} .39777943 {space 3} {res} .06663861  
{txt}        88{c |} {space 3} {res} .00014354 {space 3} {res} .39778214 {space 3} {res}    .06664  
{txt}        89{c |} {space 3} {res} .00013079 {space 3} {res} .39778461 {space 3} {res} .06664128  
{txt}        90{c |} {space 3} {res} .00011917 {space 3} {res} .39778687 {space 3} {res} .06664243  
{txt}        91{c |} {space 3} {res} .00010858 {space 3} {res} .39778892 {space 3} {res} .06664349  
{txt}        92{c |} {space 3} {res} .00009894 {space 3} {res} .39779079 {space 3} {res} .06664445  
{txt}        93{c |} {space 3} {res} .00009015 {space 3} {res}  .3977925 {space 3} {res} .06664533  
{txt}        94{c |} {space 3} {res} .00008214 {space 3} {res} .39779405 {space 3} {res} .06664613  
{txt}        95{c |} {space 3} {res} .00007484 {space 3} {res} .39779547 {space 3} {res} .06664686  
{txt}        96{c |} {space 3} {res} .00006819 {space 3} {res} .39779676 {space 3} {res} .06664752  
{txt}        97{c |} {space 3} {res} .00006213 {space 3} {res} .39779793 {space 3} {res} .06664812  
{txt}        98{c |} {space 3} {res} .00005662 {space 3} {res} .39779901 {space 3} {res} .06664868  
{txt}        99{c |} {space 3} {res} .00005159 {space 3} {res} .39779998 {space 3} {res} .06664918  
{txt}       100{c |} {space 3} {res}   .000047 {space 3} {res} .39780087 {space 3} {res} .06664964  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.


{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=.3.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .47002812 {space 3} {res} .44529989 {space 3} {res} .07882048  ^
{txt}         2{c |} {space 3} {res} .42827212 {space 3} {res} .43541694 {space 3} {res} .07554672  
{txt}         3{c |} {space 3} {res}  .3902256 {space 3} {res} .42687637 {space 3} {res} .07255057  
{txt}         4{c |} {space 3} {res} .35555903 {space 3} {res} .41952353 {space 3} {res} .06981929  
{txt}         5{c |} {space 3} {res} .32397215 {space 3} {res} .41321631 {space 3} {res} .06733883  
{txt}         6{c |} {space 3} {res} .29519136 {space 3} {res} .40782529 {space 3} {res} .06509417  
{txt}         7{c |} {space 3} {res} .26896737 {space 3} {res} .40323347 {space 3} {res} .06306964  
{txt}         8{c |} {space 3} {res} .24507305 {space 3} {res} .40001487 {space 3} {res} .06128728  
{txt}         9{c |} {space 3} {res} .22330144 {space 3} {res} .39808447 {space 3} {res} .05978981  
{txt}        10{c |} {space 3} {res} .20346395 {space 3} {res} .39735749 {space 3} {res} .05857717  
{txt}        11{c |} {space 3} {res} .18538878 {space 3} {res} .39719435 {space 3} {res} .05757831  *
{txt}        12{c |} {space 3} {res} .16891935 {space 3} {res} .39732921 {space 3} {res} .05677394  
{txt}        13{c |} {space 3} {res} .15391302 {space 3} {res} .39811974 {space 3} {res} .05635231  
{txt}        14{c |} {space 3} {res} .14023981 {space 3} {res} .39919567 {space 3} {res} .05630205  
{txt}        15{c |} {space 3} {res} .12778129 {space 3} {res} .40019299 {space 3} {res} .05646601  
{txt}        16{c |} {space 3} {res} .11642955 {space 3} {res} .40073679 {space 3} {res} .05669463  
{txt}        17{c |} {space 3} {res} .10608627 {space 3} {res} .40091483 {space 3} {res} .05685402  
{txt}        18{c |} {space 3} {res} .09666186 {space 3} {res} .40114622 {space 3} {res} .05717764  
{txt}        19{c |} {space 3} {res} .08807469 {space 3} {res} .40098742 {space 3} {res} .05776215  
{txt}        20{c |} {space 3} {res} .08025038 {space 3} {res} .40099934 {space 3} {res} .05836479  
{txt}        21{c |} {space 3} {res} .07312115 {space 3} {res} .40114941 {space 3} {res} .05897052  
{txt}        22{c |} {space 3} {res} .06662527 {space 3} {res} .40114799 {space 3} {res} .05948742  
{txt}        23{c |} {space 3} {res} .06070647 {space 3} {res} .40109615 {space 3} {res} .05994603  
{txt}        24{c |} {space 3} {res} .05531347 {space 3} {res} .40028904 {space 3} {res}  .0601798  
{txt}        25{c |} {space 3} {res} .05039957 {space 3} {res}  .3996653 {space 3} {res} .06044304  
{txt}        26{c |} {space 3} {res} .04592222 {space 3} {res} .39919495 {space 3} {res} .06072542  
{txt}        27{c |} {space 3} {res} .04184261 {space 3} {res} .39885197 {space 3} {res} .06101861  
{txt}        28{c |} {space 3} {res} .03812543 {space 3} {res} .39861389 {space 3} {res} .06131593  
{txt}        29{c |} {space 3} {res} .03473847 {space 3} {res} .39846146 {space 3} {res} .06161219  
{txt}        30{c |} {space 3} {res}  .0316524 {space 3} {res} .39836032 {space 3} {res} .06190805  
{txt}        31{c |} {space 3} {res} .02884049 {space 3} {res} .39808305 {space 3} {res} .06224123  
{txt}        32{c |} {space 3} {res} .02627838 {space 3} {res} .39784061 {space 3} {res} .06255301  
{txt}        33{c |} {space 3} {res} .02394388 {space 3} {res} .39765313 {space 3} {res} .06285056  
{txt}        34{c |} {space 3} {res} .02181677 {space 3} {res} .39751086 {space 3} {res}  .0631329  
{txt}        35{c |} {space 3} {res} .01987863 {space 3} {res} .39740558 {space 3} {res} .06339951  
{txt}        36{c |} {space 3} {res} .01811267 {space 3} {res} .39733036 {space 3} {res} .06365023  
{txt}        37{c |} {space 3} {res} .01650359 {space 3} {res}  .3972794 {space 3} {res} .06388516  
{txt}        38{c |} {space 3} {res} .01503746 {space 3} {res} .39724785 {space 3} {res} .06410461  
{txt}        39{c |} {space 3} {res} .01370157 {space 3} {res}  .3972317 {space 3} {res} .06430905  
{txt}        40{c |} {space 3} {res} .01248436 {space 3} {res} .39722762 {space 3} {res} .06449906  
{txt}        41{c |} {space 3} {res} .01137528 {space 3} {res} .39723286 {space 3} {res} .06467529  
{txt}        42{c |} {space 3} {res} .01036473 {space 3} {res} .39724519 {space 3} {res} .06483845  
{txt}        43{c |} {space 3} {res} .00944396 {space 3} {res} .39726277 {space 3} {res} .06498925  
{txt}        44{c |} {space 3} {res} .00860498 {space 3} {res} .39728411 {space 3} {res} .06512844  
{txt}        45{c |} {space 3} {res} .00784054 {space 3} {res} .39730804 {space 3} {res} .06525674  
{txt}        46{c |} {space 3} {res} .00714401 {space 3} {res}  .3973336 {space 3} {res} .06537487  
{txt}        47{c |} {space 3} {res} .00650936 {space 3} {res} .39736002 {space 3} {res} .06548353  
{txt}        48{c |} {space 3} {res} .00593108 {space 3} {res} .39738673 {space 3} {res} .06558339  
{txt}        49{c |} {space 3} {res} .00540418 {space 3} {res} .39741327 {space 3} {res} .06567507  
{txt}        50{c |} {space 3} {res} .00492409 {space 3} {res} .39743928 {space 3} {res}  .0657592  
{txt}        51{c |} {space 3} {res} .00448665 {space 3} {res} .39746453 {space 3} {res} .06583634  
{txt}        52{c |} {space 3} {res} .00408806 {space 3} {res} .39748881 {space 3} {res} .06590703  
{txt}        53{c |} {space 3} {res} .00372489 {space 3} {res} .39751201 {space 3} {res} .06597178  
{txt}        54{c |} {space 3} {res} .00339398 {space 3} {res} .39753404 {space 3} {res} .06603105  
{txt}        55{c |} {space 3} {res} .00309247 {space 3} {res} .39755485 {space 3} {res} .06608529  
{txt}        56{c |} {space 3} {res} .00281774 {space 3} {res} .39757444 {space 3} {res}  .0661349  
{txt}        57{c |} {space 3} {res} .00256742 {space 3} {res} .39759281 {space 3} {res} .06618027  
{txt}        58{c |} {space 3} {res} .00233934 {space 3} {res} .39760997 {space 3} {res} .06622173  
{txt}        59{c |} {space 3} {res} .00213152 {space 3} {res} .39762597 {space 3} {res} .06625963  
{txt}        60{c |} {space 3} {res} .00194216 {space 3} {res} .39764084 {space 3} {res} .06629424  
{txt}        61{c |} {space 3} {res} .00176963 {space 3} {res} .39765464 {space 3} {res} .06632586  
{txt}        62{c |} {space 3} {res} .00161242 {space 3} {res} .39766743 {space 3} {res} .06635473  
{txt}        63{c |} {space 3} {res} .00146917 {space 3} {res} .39767925 {space 3} {res} .06638109  
{txt}        64{c |} {space 3} {res} .00133866 {space 3} {res} .39769016 {space 3} {res} .06640516  
{txt}        65{c |} {space 3} {res} .00121973 {space 3} {res} .39770022 {space 3} {res} .06642712  
{txt}        66{c |} {space 3} {res} .00111138 {space 3} {res} .39770949 {space 3} {res} .06644715  
{txt}        67{c |} {space 3} {res} .00101264 {space 3} {res} .39771801 {space 3} {res} .06646544  
{txt}        68{c |} {space 3} {res} .00092268 {space 3} {res} .39772585 {space 3} {res} .06648212  
{txt}        69{c |} {space 3} {res} .00084072 {space 3} {res} .39773305 {space 3} {res} .06649733  
{txt}        70{c |} {space 3} {res} .00076603 {space 3} {res} .39773965 {space 3} {res} .06651121  
{txt}        71{c |} {space 3} {res} .00069798 {space 3} {res} .39774571 {space 3} {res} .06652387  
{txt}        72{c |} {space 3} {res} .00063597 {space 3} {res} .39775126 {space 3} {res} .06653541  
{txt}        73{c |} {space 3} {res} .00057947 {space 3} {res} .39775635 {space 3} {res} .06654593  
{txt}        74{c |} {space 3} {res} .00052799 {space 3} {res}   .397761 {space 3} {res} .06655553  
{txt}        75{c |} {space 3} {res} .00048109 {space 3} {res} .39776527 {space 3} {res} .06656428  
{txt}        76{c |} {space 3} {res} .00043835 {space 3} {res} .39776916 {space 3} {res} .06657226  
{txt}        77{c |} {space 3} {res} .00039941 {space 3} {res} .39777273 {space 3} {res} .06657953  
{txt}        78{c |} {space 3} {res} .00036393 {space 3} {res} .39777599 {space 3} {res} .06658616  
{txt}        79{c |} {space 3} {res}  .0003316 {space 3} {res} .39777897 {space 3} {res}  .0665922  
{txt}        80{c |} {space 3} {res} .00030214 {space 3} {res} .39778169 {space 3} {res} .06659771  
{txt}        81{c |} {space 3} {res}  .0002753 {space 3} {res} .39778417 {space 3} {res} .06660273  
{txt}        82{c |} {space 3} {res} .00025084 {space 3} {res} .39778644 {space 3} {res} .06660731  
{txt}        83{c |} {space 3} {res} .00022856 {space 3} {res} .39778852 {space 3} {res} .06661148  
{txt}        84{c |} {space 3} {res} .00020825 {space 3} {res} .39779041 {space 3} {res} .06661528  
{txt}        85{c |} {space 3} {res} .00018975 {space 3} {res} .39779214 {space 3} {res} .06661874  
{txt}        86{c |} {space 3} {res} .00017289 {space 3} {res} .39779371 {space 3} {res}  .0666219  
{txt}        87{c |} {space 3} {res} .00015753 {space 3} {res} .39779515 {space 3} {res} .06662478  
{txt}        88{c |} {space 3} {res} .00014354 {space 3} {res} .39779646 {space 3} {res}  .0666274  
{txt}        89{c |} {space 3} {res} .00013079 {space 3} {res} .39779766 {space 3} {res} .06662979  
{txt}        90{c |} {space 3} {res} .00011917 {space 3} {res} .39779875 {space 3} {res} .06663197  
{txt}        91{c |} {space 3} {res} .00010858 {space 3} {res} .39779974 {space 3} {res} .06663395  
{txt}        92{c |} {space 3} {res} .00009894 {space 3} {res} .39780065 {space 3} {res} .06663576  
{txt}        93{c |} {space 3} {res} .00009015 {space 3} {res} .39780148 {space 3} {res} .06663741  
{txt}        94{c |} {space 3} {res} .00008214 {space 3} {res} .39780223 {space 3} {res} .06663891  
{txt}        95{c |} {space 3} {res} .00007484 {space 3} {res} .39780292 {space 3} {res} .06664028  
{txt}        96{c |} {space 3} {res} .00006819 {space 3} {res} .39780355 {space 3} {res} .06664153  
{txt}        97{c |} {space 3} {res} .00006213 {space 3} {res} .39780412 {space 3} {res} .06664267  
{txt}        98{c |} {space 3} {res} .00005662 {space 3} {res} .39780464 {space 3} {res}  .0666437  
{txt}        99{c |} {space 3} {res} .00005159 {space 3} {res} .39780512 {space 3} {res} .06664465  
{txt}       100{c |} {space 3} {res}   .000047 {space 3} {res} .39780555 {space 3} {res} .06664551  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.


{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=.7.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .47002812 {space 3} {res} .56478477 {space 3} {res} .11268272  
{txt}         2{c |} {space 3} {res} .42827212 {space 3} {res} .53834409 {space 3} {res} .10494957  
{txt}         3{c |} {space 3} {res}  .3902256 {space 3} {res} .51647335 {space 3} {res} .09837217  
{txt}         4{c |} {space 3} {res} .35555903 {space 3} {res} .49844777 {space 3} {res} .09247087  
{txt}         5{c |} {space 3} {res} .32397215 {space 3} {res} .48344329 {space 3} {res} .08707347  
{txt}         6{c |} {space 3} {res} .29519136 {space 3} {res} .46920859 {space 3} {res} .08244563  
{txt}         7{c |} {space 3} {res} .26896737 {space 3} {res} .45606914 {space 3} {res}   .078432  
{txt}         8{c |} {space 3} {res} .24507305 {space 3} {res} .44348282 {space 3} {res} .07473117  ^
{txt}         9{c |} {space 3} {res} .22330144 {space 3} {res} .43289941 {space 3} {res} .07144851  
{txt}        10{c |} {space 3} {res} .20346395 {space 3} {res} .42377807 {space 3} {res} .06852391  
{txt}        11{c |} {space 3} {res} .18538878 {space 3} {res}   .416121 {space 3} {res}  .0659115  
{txt}        12{c |} {space 3} {res} .16891935 {space 3} {res} .40982415 {space 3} {res} .06357773  
{txt}        13{c |} {space 3} {res} .15391302 {space 3} {res} .40459551 {space 3} {res} .06151615  
{txt}        14{c |} {space 3} {res} .14023981 {space 3} {res} .40024536 {space 3} {res} .05969764  
{txt}        15{c |} {space 3} {res} .12778129 {space 3} {res} .39663093 {space 3} {res} .05809528  
{txt}        16{c |} {space 3} {res} .11642955 {space 3} {res} .39475363 {space 3} {res} .05678376  
{txt}        17{c |} {space 3} {res} .10608627 {space 3} {res} .39420819 {space 3} {res} .05582604  *
{txt}        18{c |} {space 3} {res} .09666186 {space 3} {res} .39475825 {space 3} {res} .05516119  
{txt}        19{c |} {space 3} {res} .08807469 {space 3} {res} .39566183 {space 3} {res} .05469839  
{txt}        20{c |} {space 3} {res} .08025038 {space 3} {res} .39662863 {space 3} {res} .05440645  
{txt}        21{c |} {space 3} {res} .07312115 {space 3} {res} .39855638 {space 3} {res} .05466686  
{txt}        22{c |} {space 3} {res} .06662527 {space 3} {res} .40034315 {space 3} {res} .05515023  
{txt}        23{c |} {space 3} {res} .06070647 {space 3} {res} .40171035 {space 3} {res} .05578078  
{txt}        24{c |} {space 3} {res} .05531347 {space 3} {res}  .4027468 {space 3} {res}  .0563652  
{txt}        25{c |} {space 3} {res} .05039957 {space 3} {res} .40351716 {space 3} {res}  .0568747  
{txt}        26{c |} {space 3} {res} .04592222 {space 3} {res} .40373416 {space 3} {res} .05759446  
{txt}        27{c |} {space 3} {res} .04184261 {space 3} {res} .40383878 {space 3} {res} .05838472  
{txt}        28{c |} {space 3} {res} .03812543 {space 3} {res} .40410598 {space 3} {res} .05913399  
{txt}        29{c |} {space 3} {res} .03473847 {space 3} {res} .40426995 {space 3} {res} .05972735  
{txt}        30{c |} {space 3} {res}  .0316524 {space 3} {res} .40421342 {space 3} {res} .06016101  
{txt}        31{c |} {space 3} {res} .02884049 {space 3} {res} .40343107 {space 3} {res} .06040336  
{txt}        32{c |} {space 3} {res} .02627838 {space 3} {res}  .4026502 {space 3} {res}  .0607131  
{txt}        33{c |} {space 3} {res} .02394388 {space 3} {res} .40203757 {space 3} {res}  .0610298  
{txt}        34{c |} {space 3} {res} .02181677 {space 3} {res} .40155988 {space 3} {res} .06134707  
{txt}        35{c |} {space 3} {res} .01987863 {space 3} {res} .40115794 {space 3} {res} .06166821  
{txt}        36{c |} {space 3} {res} .01811267 {space 3} {res}  .4008511 {space 3} {res} .06197901  
{txt}        37{c |} {space 3} {res} .01650359 {space 3} {res} .40062127 {space 3} {res} .06227702  
{txt}        38{c |} {space 3} {res} .01503746 {space 3} {res} .40028311 {space 3} {res}  .0626034  
{txt}        39{c |} {space 3} {res} .01370157 {space 3} {res} .39994508 {space 3} {res} .06292698  
{txt}        40{c |} {space 3} {res} .01248436 {space 3} {res} .39966671 {space 3} {res} .06322981  
{txt}        41{c |} {space 3} {res} .01137528 {space 3} {res} .39943782 {space 3} {res} .06351225  
{txt}        42{c |} {space 3} {res} .01036473 {space 3} {res} .39924995 {space 3} {res} .06377493  
{txt}        43{c |} {space 3} {res} .00944396 {space 3} {res} .39908768 {space 3} {res} .06401694  
{txt}        44{c |} {space 3} {res} .00860498 {space 3} {res} .39890069 {space 3} {res} .06423062  
{txt}        45{c |} {space 3} {res} .00784054 {space 3} {res} .39874262 {space 3} {res} .06442897  
{txt}        46{c |} {space 3} {res} .00714401 {space 3} {res} .39860883 {space 3} {res} .06461269  
{txt}        47{c |} {space 3} {res} .00650936 {space 3} {res} .39849548 {space 3} {res} .06478256  
{txt}        48{c |} {space 3} {res} .00593108 {space 3} {res} .39839932 {space 3} {res} .06493935  
{txt}        49{c |} {space 3} {res} .00540418 {space 3} {res} .39831763 {space 3} {res} .06508388  
{txt}        50{c |} {space 3} {res} .00492409 {space 3} {res} .39824813 {space 3} {res} .06521693  
{txt}        51{c |} {space 3} {res} .00448665 {space 3} {res} .39818892 {space 3} {res} .06533929  
{txt}        52{c |} {space 3} {res} .00408806 {space 3} {res} .39813838 {space 3} {res}  .0654517  
{txt}        53{c |} {space 3} {res} .00372489 {space 3} {res} .39809518 {space 3} {res}  .0655549  
{txt}        54{c |} {space 3} {res} .00339398 {space 3} {res} .39805819 {space 3} {res} .06564956  
{txt}        55{c |} {space 3} {res} .00309247 {space 3} {res} .39802645 {space 3} {res} .06573633  
{txt}        56{c |} {space 3} {res} .00281774 {space 3} {res} .39799916 {space 3} {res} .06581582  
{txt}        57{c |} {space 3} {res} .00256742 {space 3} {res} .39797566 {space 3} {res}  .0658886  
{txt}        58{c |} {space 3} {res} .00233934 {space 3} {res} .39795539 {space 3} {res} .06595521  
{txt}        59{c |} {space 3} {res} .00213152 {space 3} {res} .39793785 {space 3} {res} .06601615  
{txt}        60{c |} {space 3} {res} .00194216 {space 3} {res} .39792265 {space 3} {res} .06607188  
{txt}        61{c |} {space 3} {res} .00176963 {space 3} {res} .39790945 {space 3} {res} .06612282  
{txt}        62{c |} {space 3} {res} .00161242 {space 3} {res} .39789797 {space 3} {res} .06616937  
{txt}        63{c |} {space 3} {res} .00146917 {space 3} {res} .39788795 {space 3} {res}  .0662119  
{txt}        64{c |} {space 3} {res} .00133866 {space 3} {res}  .3978792 {space 3} {res} .06625075  
{txt}        65{c |} {space 3} {res} .00121973 {space 3} {res} .39787154 {space 3} {res} .06628622  
{txt}        66{c |} {space 3} {res} .00111138 {space 3} {res} .39786481 {space 3} {res} .06631861  
{txt}        67{c |} {space 3} {res} .00101264 {space 3} {res} .39785889 {space 3} {res} .06634817  
{txt}        68{c |} {space 3} {res} .00092268 {space 3} {res} .39785368 {space 3} {res} .06637516  
{txt}        69{c |} {space 3} {res} .00084072 {space 3} {res} .39784908 {space 3} {res} .06639978  
{txt}        70{c |} {space 3} {res} .00076603 {space 3} {res} .39784501 {space 3} {res} .06642224  
{txt}        71{c |} {space 3} {res} .00069798 {space 3} {res}  .3978414 {space 3} {res} .06644274  
{txt}        72{c |} {space 3} {res} .00063597 {space 3} {res}  .3978382 {space 3} {res} .06646143  
{txt}        73{c |} {space 3} {res} .00057947 {space 3} {res} .39783535 {space 3} {res} .06647848  
{txt}        74{c |} {space 3} {res} .00052799 {space 3} {res} .39783281 {space 3} {res} .06649404  
{txt}        75{c |} {space 3} {res} .00048109 {space 3} {res} .39783055 {space 3} {res} .06650822  
{txt}        76{c |} {space 3} {res} .00043835 {space 3} {res} .39782853 {space 3} {res} .06652115  
{txt}        77{c |} {space 3} {res} .00039941 {space 3} {res} .39782672 {space 3} {res} .06653294  
{txt}        78{c |} {space 3} {res} .00036393 {space 3} {res}  .3978251 {space 3} {res} .06654369  
{txt}        79{c |} {space 3} {res}  .0003316 {space 3} {res} .39782365 {space 3} {res} .06655349  
{txt}        80{c |} {space 3} {res} .00030214 {space 3} {res} .39782234 {space 3} {res} .06656243  
{txt}        81{c |} {space 3} {res}  .0002753 {space 3} {res} .39782117 {space 3} {res} .06657057  
{txt}        82{c |} {space 3} {res} .00025084 {space 3} {res} .39782011 {space 3} {res}   .066578  
{txt}        83{c |} {space 3} {res} .00022856 {space 3} {res} .39781916 {space 3} {res} .06658476  
{txt}        84{c |} {space 3} {res} .00020825 {space 3} {res}  .3978183 {space 3} {res} .06659093  
{txt}        85{c |} {space 3} {res} .00018975 {space 3} {res} .39781753 {space 3} {res} .06659656  
{txt}        86{c |} {space 3} {res} .00017289 {space 3} {res} .39781683 {space 3} {res} .06660168  
{txt}        87{c |} {space 3} {res} .00015753 {space 3} {res}  .3978162 {space 3} {res} .06660635  
{txt}        88{c |} {space 3} {res} .00014354 {space 3} {res} .39781563 {space 3} {res} .06661061  
{txt}        89{c |} {space 3} {res} .00013079 {space 3} {res} .39781511 {space 3} {res} .06661449  
{txt}        90{c |} {space 3} {res} .00011917 {space 3} {res} .39781464 {space 3} {res} .06661802  
{txt}        91{c |} {space 3} {res} .00010858 {space 3} {res} .39781422 {space 3} {res} .06662125  
{txt}        92{c |} {space 3} {res} .00009894 {space 3} {res} .39781383 {space 3} {res} .06662418  
{txt}        93{c |} {space 3} {res} .00009015 {space 3} {res} .39781349 {space 3} {res} .06662686  
{txt}        94{c |} {space 3} {res} .00008214 {space 3} {res} .39781317 {space 3} {res}  .0666293  
{txt}        95{c |} {space 3} {res} .00007484 {space 3} {res} .39781288 {space 3} {res} .06663152  
{txt}        96{c |} {space 3} {res} .00006819 {space 3} {res} .39781262 {space 3} {res} .06663354  
{txt}        97{c |} {space 3} {res} .00006213 {space 3} {res} .39781239 {space 3} {res} .06663539  
{txt}        98{c |} {space 3} {res} .00005662 {space 3} {res} .39781217 {space 3} {res} .06663707  
{txt}        99{c |} {space 3} {res} .00005159 {space 3} {res} .39781198 {space 3} {res}  .0666386  
{txt}       100{c |} {space 3} {res}   .000047 {space 3} {res}  .3978118 {space 3} {res}    .06664  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}


K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .47002812 {space 3} {res} .68765443 {space 3} {res}  .1373409  
{txt}         2{c |} {space 3} {res} .42827212 {space 3} {res} .65513813 {space 3} {res} .13755403  
{txt}         3{c |} {space 3} {res}  .3902256 {space 3} {res} .61330573 {space 3} {res} .12760865  
{txt}         4{c |} {space 3} {res} .35555903 {space 3} {res} .57588694 {space 3} {res} .11700443  
{txt}         5{c |} {space 3} {res} .32397215 {space 3} {res} .54476261 {space 3} {res} .10768145  
{txt}         6{c |} {space 3} {res} .29519136 {space 3} {res} .51886926 {space 3} {res} .09948626  
{txt}         7{c |} {space 3} {res} .26896737 {space 3} {res} .49790373 {space 3} {res} .09268422  
{txt}         8{c |} {space 3} {res} .24507305 {space 3} {res} .48106487 {space 3} {res} .08704268  
{txt}         9{c |} {space 3} {res} .22330144 {space 3} {res} .46757902 {space 3} {res} .08192997  
{txt}        10{c |} {space 3} {res} .20346395 {space 3} {res}  .4562232 {space 3} {res} .07754346  
{txt}        11{c |} {space 3} {res} .18538878 {space 3} {res} .44550619 {space 3} {res} .07376981  ^
{txt}        12{c |} {space 3} {res} .16891935 {space 3} {res} .43595363 {space 3} {res} .07036464  
{txt}        13{c |} {space 3} {res} .15391302 {space 3} {res} .42657658 {space 3} {res} .06740889  
{txt}        14{c |} {space 3} {res} .14023981 {space 3} {res} .41860881 {space 3} {res} .06487241  
{txt}        15{c |} {space 3} {res} .12778129 {space 3} {res} .41202072 {space 3} {res} .06265271  
{txt}        16{c |} {space 3} {res} .11642955 {space 3} {res} .40628874 {space 3} {res} .06067793  
{txt}        17{c |} {space 3} {res} .10608627 {space 3} {res} .40150317 {space 3} {res} .05894068  
{txt}        18{c |} {space 3} {res} .09666186 {space 3} {res} .39759331 {space 3} {res}  .0573977  
{txt}        19{c |} {space 3} {res} .08807469 {space 3} {res} .39500474 {space 3} {res} .05608341  
{txt}        20{c |} {space 3} {res} .08025038 {space 3} {res}  .3939009 {space 3} {res} .05507944  *
{txt}        21{c |} {space 3} {res} .07312115 {space 3} {res} .39424725 {space 3} {res} .05446178  
{txt}        22{c |} {space 3} {res} .06662527 {space 3} {res} .39521599 {space 3} {res} .05405737  
{txt}        23{c |} {space 3} {res} .06070647 {space 3} {res} .39634974 {space 3} {res} .05384646  
{txt}        24{c |} {space 3} {res} .05531347 {space 3} {res} .39813019 {space 3} {res} .05396025  
{txt}        25{c |} {space 3} {res} .05039957 {space 3} {res} .40007771 {space 3} {res} .05454916  
{txt}        26{c |} {space 3} {res} .04592222 {space 3} {res} .40183114 {space 3} {res} .05526845  
{txt}        27{c |} {space 3} {res} .04184261 {space 3} {res} .40326722 {space 3} {res} .05607408  
{txt}        28{c |} {space 3} {res} .03812543 {space 3} {res} .40401502 {space 3} {res} .05664212  
{txt}        29{c |} {space 3} {res} .03473847 {space 3} {res} .40467183 {space 3} {res} .05734232  
{txt}        30{c |} {space 3} {res}  .0316524 {space 3} {res} .40477347 {space 3} {res} .05819792  
{txt}        31{c |} {space 3} {res} .02884049 {space 3} {res} .40500933 {space 3} {res} .05900882  
{txt}        32{c |} {space 3} {res} .02627838 {space 3} {res} .40521778 {space 3} {res} .05969353  
{txt}        33{c |} {space 3} {res} .02394388 {space 3} {res} .40534316 {space 3} {res} .06023307  
{txt}        34{c |} {space 3} {res} .02181677 {space 3} {res}  .4046186 {space 3} {res}  .0604313  
{txt}        35{c |} {space 3} {res} .01987863 {space 3} {res} .40384936 {space 3} {res} .06073578  
{txt}        36{c |} {space 3} {res} .01811267 {space 3} {res} .40312431 {space 3} {res} .06106187  
{txt}        37{c |} {space 3} {res} .01650359 {space 3} {res} .40254831 {space 3} {res} .06138569  
{txt}        38{c |} {space 3} {res} .01503746 {space 3} {res} .40209645 {space 3} {res} .06170245  
{txt}        39{c |} {space 3} {res} .01370157 {space 3} {res} .40173272 {space 3} {res}  .0620117  
{txt}        40{c |} {space 3} {res} .01248436 {space 3} {res} .40142526 {space 3} {res} .06231409  
{txt}        41{c |} {space 3} {res} .01137528 {space 3} {res} .40110867 {space 3} {res} .06262028  
{txt}        42{c |} {space 3} {res} .01036473 {space 3} {res} .40069569 {space 3} {res} .06294802  
{txt}        43{c |} {space 3} {res} .00944396 {space 3} {res} .40034997 {space 3} {res} .06325382  
{txt}        44{c |} {space 3} {res} .00860498 {space 3} {res} .40006034 {space 3} {res} .06353825  
{txt}        45{c |} {space 3} {res} .00784054 {space 3} {res}  .3998175 {space 3} {res} .06380212  
{txt}        46{c |} {space 3} {res} .00714401 {space 3} {res} .39961373 {space 3} {res} .06404637  
{txt}        47{c |} {space 3} {res} .00650936 {space 3} {res} .39944258 {space 3} {res} .06427203  
{txt}        48{c |} {space 3} {res} .00593108 {space 3} {res} .39925579 {space 3} {res} .06447205  
{txt}        49{c |} {space 3} {res} .00540418 {space 3} {res} .39907614 {space 3} {res} .06465322  
{txt}        50{c |} {space 3} {res} .00492409 {space 3} {res} .39892114 {space 3} {res} .06482056  
{txt}        51{c |} {space 3} {res} .00448665 {space 3} {res} .39878714 {space 3} {res}  .0649749  
{txt}        52{c |} {space 3} {res} .00408806 {space 3} {res} .39867103 {space 3} {res} .06511705  
{txt}        53{c |} {space 3} {res} .00372489 {space 3} {res} .39857021 {space 3} {res} .06524781  
{txt}        54{c |} {space 3} {res} .00339398 {space 3} {res} .39848247 {space 3} {res} .06536799  
{txt}        55{c |} {space 3} {res} .00309247 {space 3} {res} .39840596 {space 3} {res} .06547832  
{txt}        56{c |} {space 3} {res} .00281774 {space 3} {res}  .3983391 {space 3} {res} .06557955  
{txt}        57{c |} {space 3} {res} .00256742 {space 3} {res} .39828054 {space 3} {res} .06567235  
{txt}        58{c |} {space 3} {res} .00233934 {space 3} {res} .39822914 {space 3} {res} .06575737  
{txt}        59{c |} {space 3} {res} .00213152 {space 3} {res} .39818394 {space 3} {res} .06583523  
{txt}        60{c |} {space 3} {res} .00194216 {space 3} {res} .39814411 {space 3} {res} .06590648  
{txt}        61{c |} {space 3} {res} .00176963 {space 3} {res} .39810893 {space 3} {res} .06597167  
{txt}        62{c |} {space 3} {res} .00161242 {space 3} {res} .39807782 {space 3} {res} .06603128  
{txt}        63{c |} {space 3} {res} .00146917 {space 3} {res} .39805024 {space 3} {res} .06608578  
{txt}        64{c |} {space 3} {res} .00133866 {space 3} {res} .39802576 {space 3} {res} .06613558  
{txt}        65{c |} {space 3} {res} .00121973 {space 3} {res} .39800398 {space 3} {res} .06618108  
{txt}        66{c |} {space 3} {res} .00111138 {space 3} {res} .39798459 {space 3} {res} .06622264  
{txt}        67{c |} {space 3} {res} .00101264 {space 3} {res} .39796728 {space 3} {res} .06626059  
{txt}        68{c |} {space 3} {res} .00092268 {space 3} {res} .39795181 {space 3} {res} .06629523  
{txt}        69{c |} {space 3} {res} .00084072 {space 3} {res} .39793798 {space 3} {res} .06632686  
{txt}        70{c |} {space 3} {res} .00076603 {space 3} {res} .39792558 {space 3} {res} .06635572  
{txt}        71{c |} {space 3} {res} .00069798 {space 3} {res} .39791446 {space 3} {res} .06638206  
{txt}        72{c |} {space 3} {res} .00063597 {space 3} {res} .39790447 {space 3} {res} .06640609  
{txt}        73{c |} {space 3} {res} .00057947 {space 3} {res} .39789549 {space 3} {res} .06642801  
{txt}        74{c |} {space 3} {res} .00052799 {space 3} {res} .39788741 {space 3} {res} .06644801  
{txt}        75{c |} {space 3} {res} .00048109 {space 3} {res} .39788012 {space 3} {res} .06646625  
{txt}        76{c |} {space 3} {res} .00043835 {space 3} {res} .39787356 {space 3} {res} .06648288  
{txt}        77{c |} {space 3} {res} .00039941 {space 3} {res} .39786763 {space 3} {res} .06649805  
{txt}        78{c |} {space 3} {res} .00036393 {space 3} {res} .39786228 {space 3} {res} .06651188  
{txt}        79{c |} {space 3} {res}  .0003316 {space 3} {res} .39785744 {space 3} {res}  .0665245  
{txt}        80{c |} {space 3} {res} .00030214 {space 3} {res} .39785307 {space 3} {res}   .066536  
{txt}        81{c |} {space 3} {res}  .0002753 {space 3} {res} .39784911 {space 3} {res} .06654648  
{txt}        82{c |} {space 3} {res} .00025084 {space 3} {res} .39784553 {space 3} {res} .06655604  
{txt}        83{c |} {space 3} {res} .00022856 {space 3} {res} .39784228 {space 3} {res} .06656475  
{txt}        84{c |} {space 3} {res} .00020825 {space 3} {res} .39783934 {space 3} {res} .06657269  
{txt}        85{c |} {space 3} {res} .00018975 {space 3} {res} .39783667 {space 3} {res} .06657993  
{txt}        86{c |} {space 3} {res} .00017289 {space 3} {res} .39783425 {space 3} {res} .06658653  
{txt}        87{c |} {space 3} {res} .00015753 {space 3} {res} .39783205 {space 3} {res} .06659254  
{txt}        88{c |} {space 3} {res} .00014354 {space 3} {res} .39783006 {space 3} {res} .06659802  
{txt}        89{c |} {space 3} {res} .00013079 {space 3} {res} .39782825 {space 3} {res} .06660302  
{txt}        90{c |} {space 3} {res} .00011917 {space 3} {res}  .3978266 {space 3} {res} .06660757  
{txt}        91{c |} {space 3} {res} .00010858 {space 3} {res} .39782511 {space 3} {res} .06661172  
{txt}        92{c |} {space 3} {res} .00009894 {space 3} {res} .39782375 {space 3} {res}  .0666155  
{txt}        93{c |} {space 3} {res} .00009015 {space 3} {res} .39782251 {space 3} {res} .06661895  
{txt}        94{c |} {space 3} {res} .00008214 {space 3} {res} .39782139 {space 3} {res} .06662209  
{txt}        95{c |} {space 3} {res} .00007484 {space 3} {res} .39782037 {space 3} {res} .06662495  
{txt}        96{c |} {space 3} {res} .00006819 {space 3} {res} .39781944 {space 3} {res} .06662756  
{txt}        97{c |} {space 3} {res} .00006213 {space 3} {res}  .3978186 {space 3} {res} .06662993  
{txt}        98{c |} {space 3} {res} .00005662 {space 3} {res} .39781783 {space 3} {res}  .0666321  
{txt}        99{c |} {space 3} {res} .00005159 {space 3} {res} .39781713 {space 3} {res} .06663407  
{txt}       100{c |} {space 3} {res}   .000047 {space 3} {res} .39781649 {space 3} {res} .06663587  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}

Cross-validation over alpha (0 .3 .7 1).
{col 10}alpha {c |} lopt*{col 30} Minimum MSPE
{col 4}{hline 12}{c +}{hline 28}
{res}{col 10}0.000{txt}{col 16}{c |}{res}{col 17} .10608627{col 30} .39020487{txt}{col 42}#
{res}{col 10}0.300{txt}{col 16}{c |}{res}{col 17} .18538878{col 30} .39719435
{col 10}0.700{txt}{col 16}{c |}{res}{col 17} .10608627{col 30} .39420819
{col 10}1.000{txt}{col 16}{c |}{res}{col 17} .08025038{col 30}  .3939009
{txt}* lambda value that minimizes MSPE for a given alpha
# alpha value that minimizes MSPE
Estimate  with lambda=.47 (lse) and alpha=0.
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2170410      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.4973051      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0039816     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0775598      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.0935545     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0076792     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1359352      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020570      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.7078928     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=.4700281188547001).
(69 missing values generated)
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2170410      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.4973051      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0039816     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0775598      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.0935545     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0076792     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1359352      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020570      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.7078928     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=.4700281188547001).
(69 missing values generated)
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .21704097    .4973051  -.00398162   .07755978  -.09355452   .00767922

{txt}       gleason       pgg45       _cons
y1 {res}   .1359352   .00205695  -.70789276
{reset}{res}
{txt}__000001[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .21704097    .4973051  -.00398162   .07755978  -.09355452   .00767922

{txt}       gleason       pgg45       _cons
y1 {res}   .1359352   .00205695  -.70789276
{reset}
K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res}    .73815 {space 3} {res} .13934819  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .72696279 {space 3} {res} .13684858  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res}  .6911905 {space 3} {res} .13033704  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .65516965 {space 3} {res} .12292271  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .61856766 {space 3} {res} .11453878  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res}    .58831 {space 3} {res}  .1077572  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .56330798 {space 3} {res} .10240623  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .54289378 {space 3} {res} .09839534  ^
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .52636626 {space 3} {res}  .0955039  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .51313142 {space 3} {res} .09344308  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .50234616 {space 3} {res} .09222386  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .49347152 {space 3} {res}  .0916299  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .48604068 {space 3} {res}  .0914002  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .47998464 {space 3} {res} .09145944  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .47423991 {space 3} {res}  .0914453  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .46906988 {space 3} {res} .09158127  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .46489735 {space 3} {res} .09190217  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res}  .4614885 {space 3} {res} .09233757  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .45850261 {space 3} {res} .09279684  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res}  .4561127 {space 3} {res} .09333192  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .45430203 {space 3} {res} .09393271  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .45408009 {space 3} {res} .09444503  *
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .45520803 {space 3} {res}  .0947816  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .45659624 {space 3} {res} .09510214  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .45813535 {space 3} {res} .09541936  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .45929872 {space 3} {res} .09575475  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .45997826 {space 3} {res}  .0960196  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .46072422 {space 3} {res} .09626595  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .46123203 {space 3} {res} .09614638  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .46142682 {space 3} {res} .09580863  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res}  .4610857 {space 3} {res} .09543152  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .46083084 {space 3} {res} .09510119  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .46054012 {space 3} {res} .09465183  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .45998373 {space 3} {res} .09434707  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .45951242 {space 3} {res} .09412049  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .45892324 {space 3} {res} .09398604  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .45831124 {space 3} {res} .09388383  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .45780864 {space 3} {res} .09380486  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .45735658 {space 3} {res} .09376111  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .45700626 {space 3} {res} .09372764  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .45673819 {space 3} {res}  .0937025  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .45646934 {space 3} {res} .09362726  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .45609866 {space 3} {res} .09342596  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .45579166 {space 3} {res} .09324682  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .45553748 {space 3} {res} .09308717  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .45532708 {space 3} {res} .09294468  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .45515297 {space 3} {res} .09281735  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .45500894 {space 3} {res} .09270341  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .45488984 {space 3} {res} .09260133  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .45479139 {space 3} {res} .09250976  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .45471005 {space 3} {res} .09242754  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .45464287 {space 3} {res} .09235363  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .45458743 {space 3} {res} .09228712  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res}  .4545417 {space 3} {res} .09222722  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res}   .454504 {space 3} {res} .09217322  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .45447295 {space 3} {res} .09212451  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res}  .4544474 {space 3} {res} .09208052  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .45442639 {space 3} {res} .09204078  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .45440914 {space 3} {res} .09200485  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .45439498 {space 3} {res} .09197234  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .45438338 {space 3} {res} .09194291  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res}  .4543739 {space 3} {res} .09191626  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .45436615 {space 3} {res} .09189211  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .45435983 {space 3} {res} .09187021  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res}  .4543547 {space 3} {res} .09185035  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .45435053 {space 3} {res} .09183234  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .45434716 {space 3} {res} .09181598  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .45434444 {space 3} {res} .09180114  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .45434226 {space 3} {res} .09178765  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .45434041 {space 3} {res} .09177539  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .45433094 {space 3} {res} .09176357  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .45432292 {space 3} {res} .09175286  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .45431575 {space 3} {res} .09174312  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .45430934 {space 3} {res} .09173428  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .45430359 {space 3} {res} .09172623  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .45429844 {space 3} {res} .09171891  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .45429381 {space 3} {res} .09171226  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .45428965 {space 3} {res}  .0917062  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .45428591 {space 3} {res} .09170069  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .45428253 {space 3} {res} .09169568  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .45427949 {space 3} {res} .09169112  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .45427675 {space 3} {res} .09168697  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .45427427 {space 3} {res} .09168319  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .45427203 {space 3} {res} .09167975  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .45427001 {space 3} {res} .09167661  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .45426817 {space 3} {res} .09167376  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .45426651 {space 3} {res} .09167116  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .45426501 {space 3} {res}  .0916688  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .45426365 {space 3} {res} .09166665  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .45426241 {space 3} {res} .09166468  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .45426129 {space 3} {res}  .0916629  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .45426028 {space 3} {res} .09166127  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .45425935 {space 3} {res} .09165979  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .45425851 {space 3} {res} .09165844  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .45425775 {space 3} {res} .09165721  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .45425706 {space 3} {res} .09165609  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .45425643 {space 3} {res} .09165507  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .45425586 {space 3} {res} .09165414  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .45425534 {space 3} {res}  .0916533  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .45425487 {space 3} {res} .09165253  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
Estimate lasso with lambda=33.82 (lse).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.1848622      0.3782994
{txt}{space 10}lweight {c |}{col 21}{res}      0.3581076      0.8391637
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}      0.5029428     -1.3919237
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=33.82008100076).
(69 missing values generated)

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.1848622      0.3782994
{txt}{space 10}lweight {c |}{col 21}{res}      0.3581076      0.8391637
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}      0.5029428     -1.3919237
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=33.82008100076).
(69 missing values generated)
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,3]
       lcavol    lweight      _cons
y1 {res} .18486224  .35810765  .50294277
{reset}{res}
{txt}__000001[1,3]
       lcavol    lweight      _cons
y1 {res} .18486224  .35810765  .50294277
{reset}
K-fold cross-validation with 10 folds. Elastic net with alpha=0.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .47002812 {space 3} {res} .44726584 {space 3} {res} .07065653  ^
{txt}         2{c |} {space 3} {res} .42827212 {space 3} {res} .44571884 {space 3} {res} .07036734  
{txt}         3{c |} {space 3} {res}  .3902256 {space 3} {res} .44442816 {space 3} {res} .07021443  
{txt}         4{c |} {space 3} {res} .35555903 {space 3} {res} .44338599 {space 3} {res} .07018872  
{txt}         5{c |} {space 3} {res} .32397215 {space 3} {res} .44258269 {space 3} {res} .07028015  
{txt}         6{c |} {space 3} {res} .29519136 {space 3} {res} .44200686 {space 3} {res} .07047791  
{txt}         7{c |} {space 3} {res} .26896737 {space 3} {res} .44164545 {space 3} {res} .07077066  
{txt}         8{c |} {space 3} {res} .24507305 {space 3} {res} .44148392 {space 3} {res} .07114681  *
{txt}         9{c |} {space 3} {res} .22330144 {space 3} {res}  .4415065 {space 3} {res} .07159477  
{txt}        10{c |} {space 3} {res} .20346395 {space 3} {res} .44169647 {space 3} {res} .07210312  
{txt}        11{c |} {space 3} {res} .18538878 {space 3} {res} .44203645 {space 3} {res} .07266082  
{txt}        12{c |} {space 3} {res} .16891935 {space 3} {res} .44250872 {space 3} {res} .07325742  
{txt}        13{c |} {space 3} {res} .15391302 {space 3} {res} .44309556 {space 3} {res} .07388311  
{txt}        14{c |} {space 3} {res} .14023981 {space 3} {res} .44377954 {space 3} {res} .07452885  
{txt}        15{c |} {space 3} {res} .12778129 {space 3} {res} .44454376 {space 3} {res} .07518646  
{txt}        16{c |} {space 3} {res} .11642955 {space 3} {res} .44537212 {space 3} {res} .07584861  
{txt}        17{c |} {space 3} {res} .10608627 {space 3} {res} .44624952 {space 3} {res} .07650884  
{txt}        18{c |} {space 3} {res} .09666186 {space 3} {res} .44716196 {space 3} {res} .07716156  
{txt}        19{c |} {space 3} {res} .08807469 {space 3} {res}  .4480967 {space 3} {res} .07780203  
{txt}        20{c |} {space 3} {res} .08025038 {space 3} {res} .44904233 {space 3} {res} .07842629  
{txt}        21{c |} {space 3} {res} .07312115 {space 3} {res} .44998873 {space 3} {res} .07903111  
{txt}        22{c |} {space 3} {res} .06662527 {space 3} {res} .45092712 {space 3} {res} .07961396  
{txt}        23{c |} {space 3} {res} .06070647 {space 3} {res} .45185003 {space 3} {res}  .0801729  
{txt}        24{c |} {space 3} {res} .05531347 {space 3} {res} .45275119 {space 3} {res} .08070656  
{txt}        25{c |} {space 3} {res} .05039957 {space 3} {res} .45362549 {space 3} {res} .08121404  
{txt}        26{c |} {space 3} {res} .04592222 {space 3} {res} .45446888 {space 3} {res} .08169486  
{txt}        27{c |} {space 3} {res} .04184261 {space 3} {res} .45527827 {space 3} {res} .08214892  
{txt}        28{c |} {space 3} {res} .03812543 {space 3} {res} .45605143 {space 3} {res} .08257639  
{txt}        29{c |} {space 3} {res} .03473847 {space 3} {res} .45678687 {space 3} {res} .08297771  
{txt}        30{c |} {space 3} {res}  .0316524 {space 3} {res} .45748378 {space 3} {res} .08335353  
{txt}        31{c |} {space 3} {res} .02884049 {space 3} {res}  .4581419 {space 3} {res} .08370464  
{txt}        32{c |} {space 3} {res} .02627838 {space 3} {res} .45876142 {space 3} {res} .08403197  
{txt}        33{c |} {space 3} {res} .02394388 {space 3} {res} .45934295 {space 3} {res} .08433652  
{txt}        34{c |} {space 3} {res} .02181677 {space 3} {res} .45988739 {space 3} {res} .08461939  
{txt}        35{c |} {space 3} {res} .01987863 {space 3} {res} .46039589 {space 3} {res} .08488168  
{txt}        36{c |} {space 3} {res} .01811267 {space 3} {res} .46086981 {space 3} {res} .08512452  
{txt}        37{c |} {space 3} {res} .01650359 {space 3} {res} .46131061 {space 3} {res} .08534904  
{txt}        38{c |} {space 3} {res} .01503746 {space 3} {res} .46171988 {space 3} {res} .08555637  
{txt}        39{c |} {space 3} {res} .01370157 {space 3} {res} .46209924 {space 3} {res}  .0857476  
{txt}        40{c |} {space 3} {res} .01248436 {space 3} {res} .46245034 {space 3} {res} .08592379  
{txt}        41{c |} {space 3} {res} .01137528 {space 3} {res} .46277486 {space 3} {res} .08608598  
{txt}        42{c |} {space 3} {res} .01036473 {space 3} {res} .46307442 {space 3} {res} .08623513  
{txt}        43{c |} {space 3} {res} .00944396 {space 3} {res} .46335063 {space 3} {res} .08637219  
{txt}        44{c |} {space 3} {res} .00860498 {space 3} {res} .46360504 {space 3} {res} .08649805  
{txt}        45{c |} {space 3} {res} .00784054 {space 3} {res} .46383915 {space 3} {res} .08661354  
{txt}        46{c |} {space 3} {res} .00714401 {space 3} {res}  .4640544 {space 3} {res} .08671945  
{txt}        47{c |} {space 3} {res} .00650936 {space 3} {res} .46425214 {space 3} {res} .08681652  
{txt}        48{c |} {space 3} {res} .00593108 {space 3} {res} .46443367 {space 3} {res} .08690544  
{txt}        49{c |} {space 3} {res} .00540418 {space 3} {res}  .4646002 {space 3} {res} .08698686  
{txt}        50{c |} {space 3} {res} .00492409 {space 3} {res} .46475289 {space 3} {res} .08706138  
{txt}        51{c |} {space 3} {res} .00448665 {space 3} {res} .46489281 {space 3} {res} .08712956  
{txt}        52{c |} {space 3} {res} .00408806 {space 3} {res} .46502096 {space 3} {res} .08719191  
{txt}        53{c |} {space 3} {res} .00372489 {space 3} {res} .46513828 {space 3} {res} .08724892  
{txt}        54{c |} {space 3} {res} .00339398 {space 3} {res} .46524564 {space 3} {res} .08730102  
{txt}        55{c |} {space 3} {res} .00309247 {space 3} {res} .46534384 {space 3} {res} .08734863  
{txt}        56{c |} {space 3} {res} .00281774 {space 3} {res} .46543364 {space 3} {res} .08739212  
{txt}        57{c |} {space 3} {res} .00256742 {space 3} {res} .46551573 {space 3} {res} .08743184  
{txt}        58{c |} {space 3} {res} .00233934 {space 3} {res} .46559075 {space 3} {res} .08746811  
{txt}        59{c |} {space 3} {res} .00213152 {space 3} {res} .46565929 {space 3} {res} .08750122  
{txt}        60{c |} {space 3} {res} .00194216 {space 3} {res} .46572189 {space 3} {res} .08753144  
{txt}        61{c |} {space 3} {res} .00176963 {space 3} {res} .46577906 {space 3} {res} .08755902  
{txt}        62{c |} {space 3} {res} .00161242 {space 3} {res} .46583126 {space 3} {res} .08758419  
{txt}        63{c |} {space 3} {res} .00146917 {space 3} {res} .46587891 {space 3} {res} .08760715  
{txt}        64{c |} {space 3} {res} .00133866 {space 3} {res} .46592241 {space 3} {res}  .0876281  
{txt}        65{c |} {space 3} {res} .00121973 {space 3} {res}  .4659621 {space 3} {res} .08764721  
{txt}        66{c |} {space 3} {res} .00111138 {space 3} {res} .46599831 {space 3} {res} .08766464  
{txt}        67{c |} {space 3} {res} .00101264 {space 3} {res} .46603135 {space 3} {res} .08768054  
{txt}        68{c |} {space 3} {res} .00092268 {space 3} {res} .46606149 {space 3} {res} .08769503  
{txt}        69{c |} {space 3} {res} .00084072 {space 3} {res} .46608899 {space 3} {res} .08770825  
{txt}        70{c |} {space 3} {res} .00076603 {space 3} {res} .46611406 {space 3} {res}  .0877203  
{txt}        71{c |} {space 3} {res} .00069798 {space 3} {res} .46613693 {space 3} {res} .08773129  
{txt}        72{c |} {space 3} {res} .00063597 {space 3} {res} .46615778 {space 3} {res} .08774131  
{txt}        73{c |} {space 3} {res} .00057947 {space 3} {res} .46617679 {space 3} {res} .08775045  
{txt}        74{c |} {space 3} {res} .00052799 {space 3} {res} .46619413 {space 3} {res} .08775877  
{txt}        75{c |} {space 3} {res} .00048109 {space 3} {res} .46620994 {space 3} {res} .08776636  
{txt}        76{c |} {space 3} {res} .00043835 {space 3} {res} .46622435 {space 3} {res} .08777328  
{txt}        77{c |} {space 3} {res} .00039941 {space 3} {res} .46623748 {space 3} {res} .08777959  
{txt}        78{c |} {space 3} {res} .00036393 {space 3} {res} .46624946 {space 3} {res} .08778533  
{txt}        79{c |} {space 3} {res}  .0003316 {space 3} {res} .46626038 {space 3} {res} .08779057  
{txt}        80{c |} {space 3} {res} .00030214 {space 3} {res} .46627033 {space 3} {res} .08779535  
{txt}        81{c |} {space 3} {res}  .0002753 {space 3} {res} .46627939 {space 3} {res}  .0877997  
{txt}        82{c |} {space 3} {res} .00025084 {space 3} {res} .46628766 {space 3} {res} .08780366  
{txt}        83{c |} {space 3} {res} .00022856 {space 3} {res} .46629519 {space 3} {res} .08780728  
{txt}        84{c |} {space 3} {res} .00020825 {space 3} {res} .46630206 {space 3} {res} .08781057  
{txt}        85{c |} {space 3} {res} .00018975 {space 3} {res} .46630832 {space 3} {res} .08781357  
{txt}        86{c |} {space 3} {res} .00017289 {space 3} {res} .46631402 {space 3} {res} .08781631  
{txt}        87{c |} {space 3} {res} .00015753 {space 3} {res} .46631922 {space 3} {res}  .0878188  
{txt}        88{c |} {space 3} {res} .00014354 {space 3} {res} .46632396 {space 3} {res} .08782107  
{txt}        89{c |} {space 3} {res} .00013079 {space 3} {res} .46632827 {space 3} {res} .08782314  
{txt}        90{c |} {space 3} {res} .00011917 {space 3} {res} .46633221 {space 3} {res} .08782503  
{txt}        91{c |} {space 3} {res} .00010858 {space 3} {res} .46633579 {space 3} {res} .08782675  
{txt}        92{c |} {space 3} {res} .00009894 {space 3} {res} .46633906 {space 3} {res} .08782832  
{txt}        93{c |} {space 3} {res} .00009015 {space 3} {res} .46634204 {space 3} {res} .08782974  
{txt}        94{c |} {space 3} {res} .00008214 {space 3} {res} .46634475 {space 3} {res} .08783104  
{txt}        95{c |} {space 3} {res} .00007484 {space 3} {res} .46634722 {space 3} {res} .08783223  
{txt}        96{c |} {space 3} {res} .00006819 {space 3} {res} .46634947 {space 3} {res} .08783331  
{txt}        97{c |} {space 3} {res} .00006213 {space 3} {res} .46635153 {space 3} {res} .08783429  
{txt}        98{c |} {space 3} {res} .00005662 {space 3} {res}  .4663534 {space 3} {res} .08783519  
{txt}        99{c |} {space 3} {res} .00005159 {space 3} {res}  .4663551 {space 3} {res} .08783601  
{txt}       100{c |} {space 3} {res}   .000047 {space 3} {res} .46635665 {space 3} {res} .08783675  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.


{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=.3.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .47002812 {space 3} {res}  .4807686 {space 3} {res} .08462549  ^
{txt}         2{c |} {space 3} {res} .42827212 {space 3} {res} .47256051 {space 3} {res} .08070791  
{txt}         3{c |} {space 3} {res}  .3902256 {space 3} {res} .46563366 {space 3} {res} .07728267  
{txt}         4{c |} {space 3} {res} .35555903 {space 3} {res} .45983105 {space 3} {res}  .0743409  
{txt}         5{c |} {space 3} {res} .32397215 {space 3} {res} .45500889 {space 3} {res} .07186538  
{txt}         6{c |} {space 3} {res} .29519136 {space 3} {res} .45103664 {space 3} {res} .06983106  
{txt}         7{c |} {space 3} {res} .26896737 {space 3} {res} .44779678 {space 3} {res} .06820608  
{txt}         8{c |} {space 3} {res} .24507305 {space 3} {res} .44568547 {space 3} {res} .06710056  
{txt}         9{c |} {space 3} {res} .22330144 {space 3} {res} .44446595 {space 3} {res} .06642088  
{txt}        10{c |} {space 3} {res} .20346395 {space 3} {res} .44367255 {space 3} {res} .06600318  
{txt}        11{c |} {space 3} {res} .18538878 {space 3} {res} .44354984 {space 3} {res} .06580573  *
{txt}        12{c |} {space 3} {res} .16891935 {space 3} {res} .44409278 {space 3} {res} .06585495  
{txt}        13{c |} {space 3} {res} .15391302 {space 3} {res} .44466433 {space 3} {res} .06626105  
{txt}        14{c |} {space 3} {res} .14023981 {space 3} {res} .44536206 {space 3} {res}  .0668258  
{txt}        15{c |} {space 3} {res} .12778129 {space 3} {res} .44628011 {space 3} {res} .06748795  
{txt}        16{c |} {space 3} {res} .11642955 {space 3} {res} .44675365 {space 3} {res} .06818043  
{txt}        17{c |} {space 3} {res} .10608627 {space 3} {res} .44710255 {space 3} {res} .06876427  
{txt}        18{c |} {space 3} {res} .09666186 {space 3} {res} .44828134 {space 3} {res} .06965561  
{txt}        19{c |} {space 3} {res} .08807469 {space 3} {res} .44959762 {space 3} {res} .07062134  
{txt}        20{c |} {space 3} {res} .08025038 {space 3} {res} .45068917 {space 3} {res}   .071747  
{txt}        21{c |} {space 3} {res} .07312115 {space 3} {res} .45114911 {space 3} {res} .07260245  
{txt}        22{c |} {space 3} {res} .06662527 {space 3} {res} .45154277 {space 3} {res} .07344089  
{txt}        23{c |} {space 3} {res} .06070647 {space 3} {res} .45201081 {space 3} {res} .07430661  
{txt}        24{c |} {space 3} {res} .05531347 {space 3} {res} .45244205 {space 3} {res} .07521906  
{txt}        25{c |} {space 3} {res} .05039957 {space 3} {res} .45297301 {space 3} {res} .07610437  
{txt}        26{c |} {space 3} {res} .04592222 {space 3} {res} .45357727 {space 3} {res} .07695654  
{txt}        27{c |} {space 3} {res} .04184261 {space 3} {res} .45423254 {space 3} {res} .07777138  
{txt}        28{c |} {space 3} {res} .03812543 {space 3} {res} .45492028 {space 3} {res} .07854614  
{txt}        29{c |} {space 3} {res} .03473847 {space 3} {res} .45562517 {space 3} {res} .07927923  
{txt}        30{c |} {space 3} {res}  .0316524 {space 3} {res} .45633475 {space 3} {res}    .07997  
{txt}        31{c |} {space 3} {res} .02884049 {space 3} {res} .45703904 {space 3} {res} .08061856  
{txt}        32{c |} {space 3} {res} .02627838 {space 3} {res} .45773015 {space 3} {res} .08122555  
{txt}        33{c |} {space 3} {res} .02394388 {space 3} {res}   .458402 {space 3} {res} .08179206  
{txt}        34{c |} {space 3} {res} .02181677 {space 3} {res} .45905006 {space 3} {res} .08231951  
{txt}        35{c |} {space 3} {res} .01987863 {space 3} {res} .45967102 {space 3} {res} .08280952  
{txt}        36{c |} {space 3} {res} .01811267 {space 3} {res} .46024884 {space 3} {res} .08325919  
{txt}        37{c |} {space 3} {res} .01650359 {space 3} {res} .46068402 {space 3} {res} .08363694  
{txt}        38{c |} {space 3} {res} .01503746 {space 3} {res} .46109797 {space 3} {res} .08398602  
{txt}        39{c |} {space 3} {res} .01370157 {space 3} {res} .46148987 {space 3} {res} .08430819  
{txt}        40{c |} {space 3} {res} .01248436 {space 3} {res} .46185936 {space 3} {res} .08460516  
{txt}        41{c |} {space 3} {res} .01137528 {space 3} {res} .46220647 {space 3} {res}  .0848786  
{txt}        42{c |} {space 3} {res} .01036473 {space 3} {res} .46253153 {space 3} {res} .08513014  
{txt}        43{c |} {space 3} {res} .00944396 {space 3} {res} .46283508 {space 3} {res} .08536133  
{txt}        44{c |} {space 3} {res} .00860498 {space 3} {res} .46311785 {space 3} {res} .08557364  
{txt}        45{c |} {space 3} {res} .00784054 {space 3} {res} .46338069 {space 3} {res} .08576847  
{txt}        46{c |} {space 3} {res} .00714401 {space 3} {res} .46362452 {space 3} {res} .08594716  
{txt}        47{c |} {space 3} {res} .00650936 {space 3} {res} .46385033 {space 3} {res} .08611093  
{txt}        48{c |} {space 3} {res} .00593108 {space 3} {res} .46405911 {space 3} {res} .08626095  
{txt}        49{c |} {space 3} {res} .00540418 {space 3} {res} .46425189 {space 3} {res} .08639831  
{txt}        50{c |} {space 3} {res} .00492409 {space 3} {res} .46442967 {space 3} {res} .08652403  
{txt}        51{c |} {space 3} {res} .00448665 {space 3} {res} .46459342 {space 3} {res} .08663904  
{txt}        52{c |} {space 3} {res} .00408806 {space 3} {res} .46474411 {space 3} {res} .08674422  
{txt}        53{c |} {space 3} {res} .00372489 {space 3} {res} .46488264 {space 3} {res} .08684037  
{txt}        54{c |} {space 3} {res} .00339398 {space 3} {res}  .4650099 {space 3} {res} .08692825  
{txt}        55{c |} {space 3} {res} .00309247 {space 3} {res}  .4651267 {space 3} {res} .08700855  
{txt}        56{c |} {space 3} {res} .00281774 {space 3} {res} .46523385 {space 3} {res}  .0870819  
{txt}        57{c |} {space 3} {res} .00256742 {space 3} {res} .46533207 {space 3} {res} .08714888  
{txt}        58{c |} {space 3} {res} .00233934 {space 3} {res} .46542205 {space 3} {res} .08721004  
{txt}        59{c |} {space 3} {res} .00213152 {space 3} {res} .46550446 {space 3} {res} .08726587  
{txt}        60{c |} {space 3} {res} .00194216 {space 3} {res} .46557989 {space 3} {res} .08731683  
{txt}        61{c |} {space 3} {res} .00176963 {space 3} {res}  .4656489 {space 3} {res} .08736334  
{txt}        62{c |} {space 3} {res} .00161242 {space 3} {res} .46571203 {space 3} {res} .08740578  
{txt}        63{c |} {space 3} {res} .00146917 {space 3} {res} .46576974 {space 3} {res}  .0874445  
{txt}        64{c |} {space 3} {res} .00133866 {space 3} {res} .46582248 {space 3} {res} .08747981  
{txt}        65{c |} {space 3} {res} .00121973 {space 3} {res} .46587068 {space 3} {res} .08751203  
{txt}        66{c |} {space 3} {res} .00111138 {space 3} {res} .46591471 {space 3} {res} .08754142  
{txt}        67{c |} {space 3} {res} .00101264 {space 3} {res} .46595492 {space 3} {res} .08756821  
{txt}        68{c |} {space 3} {res} .00092268 {space 3} {res} .46599164 {space 3} {res} .08759265  
{txt}        69{c |} {space 3} {res} .00084072 {space 3} {res} .46602517 {space 3} {res} .08761493  
{txt}        70{c |} {space 3} {res} .00076603 {space 3} {res} .46605576 {space 3} {res} .08763525  
{txt}        71{c |} {space 3} {res} .00069798 {space 3} {res} .46608369 {space 3} {res} .08765377  
{txt}        72{c |} {space 3} {res} .00063597 {space 3} {res} .46610917 {space 3} {res} .08767066  
{txt}        73{c |} {space 3} {res} .00057947 {space 3} {res} .46613242 {space 3} {res} .08768605  
{txt}        74{c |} {space 3} {res} .00052799 {space 3} {res} .46615363 {space 3} {res} .08770009  
{txt}        75{c |} {space 3} {res} .00048109 {space 3} {res} .46617298 {space 3} {res} .08771288  
{txt}        76{c |} {space 3} {res} .00043835 {space 3} {res} .46619062 {space 3} {res} .08772454  
{txt}        77{c |} {space 3} {res} .00039941 {space 3} {res} .46620671 {space 3} {res} .08773517  
{txt}        78{c |} {space 3} {res} .00036393 {space 3} {res} .46622139 {space 3} {res} .08774486  
{txt}        79{c |} {space 3} {res}  .0003316 {space 3} {res} .46623477 {space 3} {res} .08775369  
{txt}        80{c |} {space 3} {res} .00030214 {space 3} {res} .46624697 {space 3} {res} .08776173  
{txt}        81{c |} {space 3} {res}  .0002753 {space 3} {res}  .4662581 {space 3} {res} .08776907  
{txt}        82{c |} {space 3} {res} .00025084 {space 3} {res} .46626824 {space 3} {res} .08777575  
{txt}        83{c |} {space 3} {res} .00022856 {space 3} {res} .46627749 {space 3} {res} .08778184  
{txt}        84{c |} {space 3} {res} .00020825 {space 3} {res} .46628592 {space 3} {res}  .0877874  
{txt}        85{c |} {space 3} {res} .00018975 {space 3} {res}  .4662936 {space 3} {res} .08779245  
{txt}        86{c |} {space 3} {res} .00017289 {space 3} {res}  .4663006 {space 3} {res} .08779707  
{txt}        87{c |} {space 3} {res} .00015753 {space 3} {res} .46630699 {space 3} {res} .08780127  
{txt}        88{c |} {space 3} {res} .00014354 {space 3} {res} .46631281 {space 3} {res}  .0878051  
{txt}        89{c |} {space 3} {res} .00013079 {space 3} {res} .46631811 {space 3} {res} .08780858  
{txt}        90{c |} {space 3} {res} .00011917 {space 3} {res} .46632294 {space 3} {res} .08781176  
{txt}        91{c |} {space 3} {res} .00010858 {space 3} {res} .46632735 {space 3} {res} .08781466  
{txt}        92{c |} {space 3} {res} .00009894 {space 3} {res} .46633136 {space 3} {res}  .0878173  
{txt}        93{c |} {space 3} {res} .00009015 {space 3} {res} .46633502 {space 3} {res} .08781971  
{txt}        94{c |} {space 3} {res} .00008214 {space 3} {res} .46633836 {space 3} {res}  .0878219  
{txt}        95{c |} {space 3} {res} .00007484 {space 3} {res} .46634139 {space 3} {res}  .0878239  
{txt}        96{c |} {space 3} {res} .00006819 {space 3} {res} .46634416 {space 3} {res} .08782572  
{txt}        97{c |} {space 3} {res} .00006213 {space 3} {res} .46634669 {space 3} {res} .08782737  
{txt}        98{c |} {space 3} {res} .00005662 {space 3} {res} .46634899 {space 3} {res} .08782889  
{txt}        99{c |} {space 3} {res} .00005159 {space 3} {res} .46635108 {space 3} {res} .08783026  
{txt}       100{c |} {space 3} {res}   .000047 {space 3} {res} .46635299 {space 3} {res} .08783152  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.


{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=.7.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .47002812 {space 3} {res} .58619016 {space 3} {res} .12810454  
{txt}         2{c |} {space 3} {res} .42827212 {space 3} {res} .56107624 {space 3} {res} .11832598  
{txt}         3{c |} {space 3} {res}  .3902256 {space 3} {res} .54039885 {space 3} {res} .10991634  
{txt}         4{c |} {space 3} {res} .35555903 {space 3} {res} .52456909 {space 3} {res} .10265959  
{txt}         5{c |} {space 3} {res} .32397215 {space 3} {res} .51165111 {space 3} {res}  .0961521  ^
{txt}         6{c |} {space 3} {res} .29519136 {space 3} {res} .50061598 {space 3} {res} .09049654  
{txt}         7{c |} {space 3} {res} .26896737 {space 3} {res} .49111134 {space 3} {res} .08554142  
{txt}         8{c |} {space 3} {res} .24507305 {space 3} {res} .48239203 {space 3} {res}  .0814258  
{txt}         9{c |} {space 3} {res} .22330144 {space 3} {res} .47510973 {space 3} {res}  .0779965  
{txt}        10{c |} {space 3} {res} .20346395 {space 3} {res} .46904459 {space 3} {res} .07499795  
{txt}        11{c |} {space 3} {res} .18538878 {space 3} {res} .46405149 {space 3} {res} .07247272  
{txt}        12{c |} {space 3} {res} .16891935 {space 3} {res} .46009631 {space 3} {res} .07050059  
{txt}        13{c |} {space 3} {res} .15391302 {space 3} {res} .45699556 {space 3} {res} .06901584  
{txt}        14{c |} {space 3} {res} .14023981 {space 3} {res} .45397225 {space 3} {res} .06777763  
{txt}        15{c |} {space 3} {res} .12778129 {space 3} {res} .45120778 {space 3} {res} .06680757  
{txt}        16{c |} {space 3} {res} .11642955 {space 3} {res} .44953485 {space 3} {res} .06628193  
{txt}        17{c |} {space 3} {res} .10608627 {space 3} {res} .44871007 {space 3} {res} .06610389  
{txt}        18{c |} {space 3} {res} .09666186 {space 3} {res} .44833137 {space 3} {res} .06613475  *
{txt}        19{c |} {space 3} {res} .08807469 {space 3} {res} .44869745 {space 3} {res}  .0663539  
{txt}        20{c |} {space 3} {res} .08025038 {space 3} {res} .44970847 {space 3} {res} .06688917  
{txt}        21{c |} {space 3} {res} .07312115 {space 3} {res} .45065363 {space 3} {res} .06765046  
{txt}        22{c |} {space 3} {res} .06662527 {space 3} {res} .45153455 {space 3} {res} .06848568  
{txt}        23{c |} {space 3} {res} .06070647 {space 3} {res} .45271177 {space 3} {res} .06942702  
{txt}        24{c |} {space 3} {res} .05531347 {space 3} {res} .45257275 {space 3} {res} .07000925  
{txt}        25{c |} {space 3} {res} .05039957 {space 3} {res} .45243613 {space 3} {res}  .0705241  
{txt}        26{c |} {space 3} {res} .04592222 {space 3} {res} .45338008 {space 3} {res} .07147215  
{txt}        27{c |} {space 3} {res} .04184261 {space 3} {res} .45455376 {space 3} {res} .07269662  
{txt}        28{c |} {space 3} {res} .03812543 {space 3} {res} .45540524 {space 3} {res} .07378965  
{txt}        29{c |} {space 3} {res} .03473847 {space 3} {res}  .4559352 {space 3} {res} .07465225  
{txt}        30{c |} {space 3} {res}  .0316524 {space 3} {res} .45658653 {space 3} {res} .07549777  
{txt}        31{c |} {space 3} {res} .02884049 {space 3} {res} .45704894 {space 3} {res} .07638579  
{txt}        32{c |} {space 3} {res} .02627838 {space 3} {res} .45744487 {space 3} {res} .07725548  
{txt}        33{c |} {space 3} {res} .02394388 {space 3} {res} .45779308 {space 3} {res} .07809994  
{txt}        34{c |} {space 3} {res} .02181677 {space 3} {res} .45818688 {space 3} {res} .07890063  
{txt}        35{c |} {space 3} {res} .01987863 {space 3} {res} .45862789 {space 3} {res} .07965063  
{txt}        36{c |} {space 3} {res} .01811267 {space 3} {res} .45909868 {space 3} {res}  .0803506  
{txt}        37{c |} {space 3} {res} .01650359 {space 3} {res} .45958543 {space 3} {res} .08100187  
{txt}        38{c |} {space 3} {res} .01503746 {space 3} {res} .46007733 {space 3} {res} .08160628  
{txt}        39{c |} {space 3} {res} .01370157 {space 3} {res} .46056602 {space 3} {res} .08216596  
{txt}        40{c |} {space 3} {res} .01248436 {space 3} {res} .46104515 {space 3} {res} .08268324  
{txt}        41{c |} {space 3} {res} .01137528 {space 3} {res} .46151001 {space 3} {res} .08316058  
{txt}        42{c |} {space 3} {res} .01036473 {space 3} {res}  .4619572 {space 3} {res} .08360042  
{txt}        43{c |} {space 3} {res} .00944396 {space 3} {res} .46238438 {space 3} {res} .08400522  
{txt}        44{c |} {space 3} {res} .00860498 {space 3} {res} .46271952 {space 3} {res} .08435291  
{txt}        45{c |} {space 3} {res} .00784054 {space 3} {res} .46297764 {space 3} {res} .08465122  
{txt}        46{c |} {space 3} {res} .00714401 {space 3} {res} .46322396 {space 3} {res} .08492508  
{txt}        47{c |} {space 3} {res} .00650936 {space 3} {res} .46345767 {space 3} {res} .08517631  
{txt}        48{c |} {space 3} {res} .00593108 {space 3} {res} .46367834 {space 3} {res} .08540661  
{txt}        49{c |} {space 3} {res} .00540418 {space 3} {res} .46388585 {space 3} {res} .08561762  
{txt}        50{c |} {space 3} {res} .00492409 {space 3} {res} .46408028 {space 3} {res} .08581084  
{txt}        51{c |} {space 3} {res} .00448665 {space 3} {res} .46426189 {space 3} {res} .08598768  
{txt}        52{c |} {space 3} {res} .00408806 {space 3} {res} .46443109 {space 3} {res} .08614946  
{txt}        53{c |} {space 3} {res} .00372489 {space 3} {res} .46458834 {space 3} {res} .08629742  
{txt}        54{c |} {space 3} {res} .00339398 {space 3} {res} .46473419 {space 3} {res} .08643268  
{txt}        55{c |} {space 3} {res} .00309247 {space 3} {res} .46486922 {space 3} {res} .08655629  
{txt}        56{c |} {space 3} {res} .00281774 {space 3} {res} .46499403 {space 3} {res} .08666923  
{txt}        57{c |} {space 3} {res} .00256742 {space 3} {res} .46510923 {space 3} {res} .08677239  
{txt}        58{c |} {space 3} {res} .00233934 {space 3} {res} .46521543 {space 3} {res}  .0868666  
{txt}        59{c |} {space 3} {res} .00213152 {space 3} {res} .46531321 {space 3} {res} .08695262  
{txt}        60{c |} {space 3} {res} .00194216 {space 3} {res} .46540316 {space 3} {res} .08703113  
{txt}        61{c |} {space 3} {res} .00176963 {space 3} {res} .46548581 {space 3} {res}  .0871028  
{txt}        62{c |} {space 3} {res} .00161242 {space 3} {res} .46556172 {space 3} {res} .08716819  
{txt}        63{c |} {space 3} {res} .00146917 {space 3} {res} .46563136 {space 3} {res} .08722786  
{txt}        64{c |} {space 3} {res} .00133866 {space 3} {res} .46569523 {space 3} {res}  .0872823  
{txt}        65{c |} {space 3} {res} .00121973 {space 3} {res} .46575375 {space 3} {res} .08733196  
{txt}        66{c |} {space 3} {res} .00111138 {space 3} {res} .46580736 {space 3} {res} .08737725  
{txt}        67{c |} {space 3} {res} .00101264 {space 3} {res} .46585644 {space 3} {res} .08741856  
{txt}        68{c |} {space 3} {res} .00092268 {space 3} {res} .46590135 {space 3} {res} .08745623  
{txt}        69{c |} {space 3} {res} .00084072 {space 3} {res} .46594243 {space 3} {res} .08749058  
{txt}        70{c |} {space 3} {res} .00076603 {space 3} {res} .46597999 {space 3} {res}  .0875219  
{txt}        71{c |} {space 3} {res} .00069798 {space 3} {res} .46601433 {space 3} {res} .08755046  
{txt}        72{c |} {space 3} {res} .00063597 {space 3} {res}  .4660457 {space 3} {res}  .0875765  
{txt}        73{c |} {space 3} {res} .00057947 {space 3} {res} .46607437 {space 3} {res} .08760024  
{txt}        74{c |} {space 3} {res} .00052799 {space 3} {res} .46610055 {space 3} {res} .08762187  
{txt}        75{c |} {space 3} {res} .00048109 {space 3} {res} .46612446 {space 3} {res}  .0876416  
{txt}        76{c |} {space 3} {res} .00043835 {space 3} {res} .46614629 {space 3} {res} .08765958  
{txt}        77{c |} {space 3} {res} .00039941 {space 3} {res} .46616622 {space 3} {res} .08767597  
{txt}        78{c |} {space 3} {res} .00036393 {space 3} {res}  .4661844 {space 3} {res}  .0876909  
{txt}        79{c |} {space 3} {res}  .0003316 {space 3} {res}   .466201 {space 3} {res} .08770452  
{txt}        80{c |} {space 3} {res} .00030214 {space 3} {res} .46621614 {space 3} {res} .08771693  
{txt}        81{c |} {space 3} {res}  .0002753 {space 3} {res} .46622996 {space 3} {res} .08772824  
{txt}        82{c |} {space 3} {res} .00025084 {space 3} {res} .46624256 {space 3} {res} .08773854  
{txt}        83{c |} {space 3} {res} .00022856 {space 3} {res} .46625405 {space 3} {res} .08774794  
{txt}        84{c |} {space 3} {res} .00020825 {space 3} {res} .46626453 {space 3} {res}  .0877565  
{txt}        85{c |} {space 3} {res} .00018975 {space 3} {res} .46627409 {space 3} {res}  .0877643  
{txt}        86{c |} {space 3} {res} .00017289 {space 3} {res} .46628281 {space 3} {res} .08777141  
{txt}        87{c |} {space 3} {res} .00015753 {space 3} {res} .46629076 {space 3} {res} .08777789  
{txt}        88{c |} {space 3} {res} .00014354 {space 3} {res}   .466298 {space 3} {res} .08778379  
{txt}        89{c |} {space 3} {res} .00013079 {space 3} {res} .46630461 {space 3} {res} .08778917  
{txt}        90{c |} {space 3} {res} .00011917 {space 3} {res} .46631063 {space 3} {res} .08779408  
{txt}        91{c |} {space 3} {res} .00010858 {space 3} {res} .46631613 {space 3} {res} .08779854  
{txt}        92{c |} {space 3} {res} .00009894 {space 3} {res} .46632113 {space 3} {res} .08780261  
{txt}        93{c |} {space 3} {res} .00009015 {space 3} {res} .46632569 {space 3} {res} .08780632  
{txt}        94{c |} {space 3} {res} .00008214 {space 3} {res} .46632985 {space 3} {res}  .0878097  
{txt}        95{c |} {space 3} {res} .00007484 {space 3} {res} .46633364 {space 3} {res} .08781278  
{txt}        96{c |} {space 3} {res} .00006819 {space 3} {res}  .4663371 {space 3} {res} .08781559  
{txt}        97{c |} {space 3} {res} .00006213 {space 3} {res} .46634025 {space 3} {res} .08781815  
{txt}        98{c |} {space 3} {res} .00005662 {space 3} {res} .46634312 {space 3} {res} .08782048  
{txt}        99{c |} {space 3} {res} .00005159 {space 3} {res} .46634573 {space 3} {res}  .0878226  
{txt}       100{c |} {space 3} {res}   .000047 {space 3} {res} .46634811 {space 3} {res} .08782454  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}


K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .47002812 {space 3} {res} .69815481 {space 3} {res} .15163127  
{txt}         2{c |} {space 3} {res} .42827212 {space 3} {res} .66932957 {space 3} {res} .15135765  
{txt}         3{c |} {space 3} {res}  .3902256 {space 3} {res}  .6375022 {space 3} {res} .14767754  
{txt}         4{c |} {space 3} {res} .35555903 {space 3} {res} .60003182 {space 3} {res} .13432424  
{txt}         5{c |} {space 3} {res} .32397215 {space 3} {res} .56894123 {space 3} {res} .12262063  
{txt}         6{c |} {space 3} {res} .29519136 {space 3} {res} .54436246 {space 3} {res} .11216636  
{txt}         7{c |} {space 3} {res} .26896737 {space 3} {res}  .5244468 {space 3} {res} .10333925  
{txt}         8{c |} {space 3} {res} .24507305 {space 3} {res} .50941128 {space 3} {res} .09638042  ^
{txt}         9{c |} {space 3} {res} .22330144 {space 3} {res} .49830776 {space 3} {res} .09020357  
{txt}        10{c |} {space 3} {res} .20346395 {space 3} {res} .48935447 {space 3} {res} .08495596  
{txt}        11{c |} {space 3} {res} .18538878 {space 3} {res} .48204675 {space 3} {res} .08053992  
{txt}        12{c |} {space 3} {res} .16891935 {space 3} {res} .47586911 {space 3} {res} .07683111  
{txt}        13{c |} {space 3} {res} .15391302 {space 3} {res} .47030912 {space 3} {res} .07399968  
{txt}        14{c |} {space 3} {res} .14023981 {space 3} {res} .46538509 {space 3} {res} .07179493  
{txt}        15{c |} {space 3} {res} .12778129 {space 3} {res} .46149035 {space 3} {res} .07007257  
{txt}        16{c |} {space 3} {res} .11642955 {space 3} {res} .45819543 {space 3} {res} .06862152  
{txt}        17{c |} {space 3} {res} .10608627 {space 3} {res} .45565501 {space 3} {res} .06760599  
{txt}        18{c |} {space 3} {res} .09666186 {space 3} {res} .45372367 {space 3} {res} .06695403  
{txt}        19{c |} {space 3} {res} .08807469 {space 3} {res} .45232684 {space 3} {res}  .0666063  
{txt}        20{c |} {space 3} {res} .08025038 {space 3} {res} .45154331 {space 3} {res}  .0664764  
{txt}        21{c |} {space 3} {res} .07312115 {space 3} {res} .45103659 {space 3} {res} .06652145  
{txt}        22{c |} {space 3} {res} .06662527 {space 3} {res}  .4509109 {space 3} {res} .06667515  *
{txt}        23{c |} {space 3} {res} .06070647 {space 3} {res} .45178675 {space 3} {res} .06707184  
{txt}        24{c |} {space 3} {res} .05531347 {space 3} {res} .45258315 {space 3} {res}  .0678345  
{txt}        25{c |} {space 3} {res} .05039957 {space 3} {res} .45348951 {space 3} {res} .06867401  
{txt}        26{c |} {space 3} {res} .04592222 {space 3} {res} .45460175 {space 3} {res} .06962724  
{txt}        27{c |} {space 3} {res} .04184261 {space 3} {res} .45508972 {space 3} {res} .07045032  
{txt}        28{c |} {space 3} {res} .03812543 {space 3} {res} .45458988 {space 3} {res} .07093927  
{txt}        29{c |} {space 3} {res} .03473847 {space 3} {res} .45447797 {space 3} {res} .07149219  
{txt}        30{c |} {space 3} {res}  .0316524 {space 3} {res} .45566263 {space 3} {res} .07270131  
{txt}        31{c |} {space 3} {res} .02884049 {space 3} {res} .45675066 {space 3} {res} .07396821  
{txt}        32{c |} {space 3} {res} .02627838 {space 3} {res}  .4571526 {space 3} {res} .07483705  
{txt}        33{c |} {space 3} {res} .02394388 {space 3} {res} .45770467 {space 3} {res} .07568529  
{txt}        34{c |} {space 3} {res} .02181677 {space 3} {res} .45820848 {space 3} {res} .07656181  
{txt}        35{c |} {space 3} {res} .01987863 {space 3} {res} .45865808 {space 3} {res}  .0774122  
{txt}        36{c |} {space 3} {res} .01811267 {space 3} {res} .45907697 {space 3} {res} .07825024  
{txt}        37{c |} {space 3} {res} .01650359 {space 3} {res}  .4594059 {space 3} {res} .07903985  
{txt}        38{c |} {space 3} {res} .01503746 {space 3} {res} .45973484 {space 3} {res} .07979336  
{txt}        39{c |} {space 3} {res} .01370157 {space 3} {res} .46010643 {space 3} {res} .08049433  
{txt}        40{c |} {space 3} {res} .01248436 {space 3} {res} .46050468 {space 3} {res} .08114456  
{txt}        41{c |} {space 3} {res} .01137528 {space 3} {res} .46091709 {space 3} {res} .08174629  
{txt}        42{c |} {space 3} {res} .01036473 {space 3} {res}   .461334 {space 3} {res} .08230202  
{txt}        43{c |} {space 3} {res} .00944396 {space 3} {res} .46174801 {space 3} {res} .08281441  
{txt}        44{c |} {space 3} {res} .00860498 {space 3} {res}  .4621536 {space 3} {res} .08328616  
{txt}        45{c |} {space 3} {res} .00784054 {space 3} {res} .46254669 {space 3} {res} .08371996  
{txt}        46{c |} {space 3} {res} .00714401 {space 3} {res}  .4629244 {space 3} {res} .08411845  
{txt}        47{c |} {space 3} {res} .00650936 {space 3} {res} .46327511 {space 3} {res} .08448079  
{txt}        48{c |} {space 3} {res} .00593108 {space 3} {res} .46348523 {space 3} {res} .08477022  
{txt}        49{c |} {space 3} {res} .00540418 {space 3} {res} .46368773 {space 3} {res} .08503559  
{txt}        50{c |} {space 3} {res} .00492409 {space 3} {res} .46388141 {space 3} {res} .08527874  
{txt}        51{c |} {space 3} {res} .00448665 {space 3} {res}  .4640655 {space 3} {res} .08550141  
{txt}        52{c |} {space 3} {res} .00408806 {space 3} {res} .46423955 {space 3} {res} .08570521  
{txt}        53{c |} {space 3} {res} .00372489 {space 3} {res} .46440338 {space 3} {res} .08589167  
{txt}        54{c |} {space 3} {res} .00339398 {space 3} {res} .46455702 {space 3} {res} .08606219  
{txt}        55{c |} {space 3} {res} .00309247 {space 3} {res} .46470063 {space 3} {res} .08621806  
{txt}        56{c |} {space 3} {res} .00281774 {space 3} {res} .46483448 {space 3} {res} .08636052  
{txt}        57{c |} {space 3} {res} .00256742 {space 3} {res} .46495893 {space 3} {res} .08649067  
{txt}        58{c |} {space 3} {res} .00233934 {space 3} {res} .46507439 {space 3} {res} .08660955  
{txt}        59{c |} {space 3} {res} .00213152 {space 3} {res} .46518132 {space 3} {res}  .0867181  
{txt}        60{c |} {space 3} {res} .00194216 {space 3} {res} .46528017 {space 3} {res} .08681721  
{txt}        61{c |} {space 3} {res} .00176963 {space 3} {res} .46537143 {space 3} {res} .08690767  
{txt}        62{c |} {space 3} {res} .00161242 {space 3} {res} .46545556 {space 3} {res} .08699024  
{txt}        63{c |} {space 3} {res} .00146917 {space 3} {res} .46553304 {space 3} {res} .08706558  
{txt}        64{c |} {space 3} {res} .00133866 {space 3} {res} .46560431 {space 3} {res} .08713432  
{txt}        65{c |} {space 3} {res} .00121973 {space 3} {res} .46566981 {space 3} {res} .08719703  
{txt}        66{c |} {space 3} {res} .00111138 {space 3} {res} .46572996 {space 3} {res} .08725423  
{txt}        67{c |} {space 3} {res} .00101264 {space 3} {res} .46578515 {space 3} {res} .08730641  
{txt}        68{c |} {space 3} {res} .00092268 {space 3} {res} .46583576 {space 3} {res} .08735399  
{txt}        69{c |} {space 3} {res} .00084072 {space 3} {res} .46588215 {space 3} {res} .08739738  
{txt}        70{c |} {space 3} {res} .00076603 {space 3} {res} .46592463 {space 3} {res} .08743695  
{txt}        71{c |} {space 3} {res} .00069798 {space 3} {res} .46596352 {space 3} {res} .08747302  
{txt}        72{c |} {space 3} {res} .00063597 {space 3} {res} .46599912 {space 3} {res} .08750591  
{txt}        73{c |} {space 3} {res} .00057947 {space 3} {res} .46603167 {space 3} {res}  .0875359  
{txt}        74{c |} {space 3} {res} .00052799 {space 3} {res} .46606144 {space 3} {res} .08756324  
{txt}        75{c |} {space 3} {res} .00048109 {space 3} {res} .46608866 {space 3} {res} .08758816  
{txt}        76{c |} {space 3} {res} .00043835 {space 3} {res} .46611353 {space 3} {res} .08761087  
{txt}        77{c |} {space 3} {res} .00039941 {space 3} {res} .46613625 {space 3} {res} .08763158  
{txt}        78{c |} {space 3} {res} .00036393 {space 3} {res}   .466157 {space 3} {res} .08765045  
{txt}        79{c |} {space 3} {res}  .0003316 {space 3} {res} .46617595 {space 3} {res} .08766765  
{txt}        80{c |} {space 3} {res} .00030214 {space 3} {res} .46619325 {space 3} {res} .08768333  
{txt}        81{c |} {space 3} {res}  .0002753 {space 3} {res} .46620904 {space 3} {res} .08769762  
{txt}        82{c |} {space 3} {res} .00025084 {space 3} {res} .46622345 {space 3} {res} .08771064  
{txt}        83{c |} {space 3} {res} .00022856 {space 3} {res}  .4662366 {space 3} {res} .08772251  
{txt}        84{c |} {space 3} {res} .00020825 {space 3} {res}  .4662486 {space 3} {res} .08773333  
{txt}        85{c |} {space 3} {res} .00018975 {space 3} {res} .46625955 {space 3} {res} .08774319  
{txt}        86{c |} {space 3} {res} .00017289 {space 3} {res} .46626954 {space 3} {res} .08775217  
{txt}        87{c |} {space 3} {res} .00015753 {space 3} {res} .46627865 {space 3} {res} .08776036  
{txt}        88{c |} {space 3} {res} .00014354 {space 3} {res} .46628696 {space 3} {res} .08776782  
{txt}        89{c |} {space 3} {res} .00013079 {space 3} {res} .46629453 {space 3} {res} .08777462  
{txt}        90{c |} {space 3} {res} .00011917 {space 3} {res} .46630144 {space 3} {res} .08778081  
{txt}        91{c |} {space 3} {res} .00010858 {space 3} {res} .46630774 {space 3} {res} .08778646  
{txt}        92{c |} {space 3} {res} .00009894 {space 3} {res} .46631348 {space 3} {res}  .0877916  
{txt}        93{c |} {space 3} {res} .00009015 {space 3} {res} .46631872 {space 3} {res} .08779629  
{txt}        94{c |} {space 3} {res} .00008214 {space 3} {res} .46632349 {space 3} {res} .08780056  
{txt}        95{c |} {space 3} {res} .00007484 {space 3} {res} .46632784 {space 3} {res} .08780445  
{txt}        96{c |} {space 3} {res} .00006819 {space 3} {res} .46633181 {space 3} {res}   .087808  
{txt}        97{c |} {space 3} {res} .00006213 {space 3} {res} .46633542 {space 3} {res} .08781123  
{txt}        98{c |} {space 3} {res} .00005662 {space 3} {res} .46633872 {space 3} {res} .08781418  
{txt}        99{c |} {space 3} {res} .00005159 {space 3} {res} .46634172 {space 3} {res} .08781686  
{txt}       100{c |} {space 3} {res}   .000047 {space 3} {res} .46634446 {space 3} {res}  .0878193  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}

Cross-validation over alpha (0 .3 .7 1).
{col 10}alpha {c |} lopt*{col 30} Minimum MSPE
{col 4}{hline 12}{c +}{hline 28}
{res}{col 10}0.000{txt}{col 16}{c |}{res}{col 17} .24507305{col 30} .44148392{txt}{col 42}#
{res}{col 10}0.300{txt}{col 16}{c |}{res}{col 17} .18538878{col 30} .44354984
{col 10}0.700{txt}{col 16}{c |}{res}{col 17} .09666186{col 30} .44833137
{col 10}1.000{txt}{col 16}{c |}{res}{col 17} .06662527{col 30}  .4509109
{txt}* lambda value that minimizes MSPE for a given alpha
# alpha value that minimizes MSPE
Estimate  with lambda=.47 (lse) and alpha=0.
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2170410      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.4973051      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0039816     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0775598      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.0935545     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0076792     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1359352      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020570      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.7078928     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=.4700281188547001).
(69 missing values generated)
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2170410      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.4973051      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0039816     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0775598      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.0935545     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0076792     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1359352      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020570      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.7078928     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=.4700281188547001).
(69 missing values generated)
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .21704097    .4973051  -.00398162   .07755978  -.09355452   .00767922

{txt}       gleason       pgg45       _cons
y1 {res}   .1359352   .00205695  -.70789276
{reset}{res}
{txt}__000001[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .21704097    .4973051  -.00398162   .07755978  -.09355452   .00767922

{txt}       gleason       pgg45       _cons
y1 {res}   .1359352   .00205695  -.70789276
{reset}r; t=15.14 12:05:20

{com}. *
. 
. ********************************************************************************
. *** sklearn                                                                                             ****
. ********************************************************************************
. 
. cap python query
{txt}r; t=0.01 12:05:20

{com}. // run this section only if Stata is Python-aware
. if _rc==0 {c -(}
.         
.         * load example data
.         insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 12:05:20
{com}.          
.         global model lpsa lcavol lweight age lbph svi lcp gleason pgg45
{txt}r; t=0.00 12:05:20
{com}. 
.         cvlasso $model, seed(123) lglmnet

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .84342744 {space 3} {res} 1.1985723 {space 3} {res} .12122983  
{txt}         2{c |} {space 3} {res} .76849967 {space 3} {res} 1.1009983 {space 3} {res} .11262081  
{txt}         3{c |} {space 3} {res} .70022828 {space 3} {res} 1.0203357 {space 3} {res} .10553207  
{txt}         4{c |} {space 3} {res} .63802193 {space 3} {res}  .9536824 {space 3} {res} .09966234  
{txt}         5{c |} {space 3} {res} .58134182 {space 3} {res} .89863205 {space 3} {res} .09478723  
{txt}         6{c |} {space 3} {res} .52969701 {space 3} {res} .85319575 {space 3} {res} .09073637  
{txt}         7{c |} {space 3} {res} .48264019 {space 3} {res} .81578472 {space 3} {res}  .0873491  
{txt}         8{c |} {space 3} {res} .43976377 {space 3} {res} .78154651 {space 3} {res} .08491925  
{txt}         9{c |} {space 3} {res} .40069637 {space 3} {res}  .7478268 {space 3} {res} .08380347  
{txt}        10{c |} {space 3} {res}  .3650996 {space 3} {res} .71342517 {space 3} {res} .08081716  
{txt}        11{c |} {space 3} {res} .33266516 {space 3} {res} .68235451 {space 3} {res} .07742971  
{txt}        12{c |} {space 3} {res} .30311211 {space 3} {res} .65370266 {space 3} {res} .07333234  
{txt}        13{c |} {space 3} {res} .27618446 {space 3} {res} .63000117 {space 3} {res} .06984016  
{txt}        14{c |} {space 3} {res}   .251649 {space 3} {res} .61040194 {space 3} {res} .06689166  
{txt}        15{c |} {space 3} {res} .22929319 {space 3} {res} .59420154 {space 3} {res} .06442817  
{txt}        16{c |} {space 3} {res} .20892342 {space 3} {res} .58090496 {space 3} {res} .06239885  ^
{txt}        17{c |} {space 3} {res} .19036324 {space 3} {res} .57016747 {space 3} {res} .06076552  
{txt}        18{c |} {space 3} {res} .17345189 {space 3} {res}   .561509 {space 3} {res} .05943333  
{txt}        19{c |} {space 3} {res}  .1580429 {space 3} {res} .55440203 {space 3} {res} .05843354  
{txt}        20{c |} {space 3} {res} .14400281 {space 3} {res} .54900851 {space 3} {res} .05780941  
{txt}        21{c |} {space 3} {res} .13120999 {space 3} {res} .54491135 {space 3} {res} .05742444  
{txt}        22{c |} {space 3} {res} .11955366 {space 3} {res} .54184215 {space 3} {res} .05721238  
{txt}        23{c |} {space 3} {res} .10893284 {space 3} {res} .53941952 {space 3} {res} .05712655  
{txt}        24{c |} {space 3} {res} .09925555 {space 3} {res} .53682782 {space 3} {res} .05736559  
{txt}        25{c |} {space 3} {res} .09043796 {space 3} {res}  .5343898 {space 3} {res} .05781237  
{txt}        26{c |} {space 3} {res}  .0824037 {space 3} {res} .53385524 {space 3} {res} .05833199  *
{txt}        27{c |} {space 3} {res} .07508318 {space 3} {res} .53417253 {space 3} {res} .05899937  
{txt}        28{c |} {space 3} {res}   .068413 {space 3} {res} .53448587 {space 3} {res} .05974718  
{txt}        29{c |} {space 3} {res} .06233538 {space 3} {res} .53463875 {space 3} {res} .06047825  
{txt}        30{c |} {space 3} {res} .05679767 {space 3} {res} .53480944 {space 3} {res} .06118856  
{txt}        31{c |} {space 3} {res} .05175193 {space 3} {res} .53476007 {space 3} {res} .06203773  
{txt}        32{c |} {space 3} {res} .04715443 {space 3} {res} .53492216 {space 3} {res} .06282275  
{txt}        33{c |} {space 3} {res} .04296536 {space 3} {res} .53522945 {space 3} {res} .06354815  
{txt}        34{c |} {space 3} {res} .03914843 {space 3} {res} .53569438 {space 3} {res} .06422422  
{txt}        35{c |} {space 3} {res} .03567059 {space 3} {res} .53736358 {space 3} {res} .06544877  
{txt}        36{c |} {space 3} {res} .03250172 {space 3} {res} .53904818 {space 3} {res} .06658825  
{txt}        37{c |} {space 3} {res} .02961435 {space 3} {res} .54071902 {space 3} {res} .06764623  
{txt}        38{c |} {space 3} {res}  .0269835 {space 3} {res} .54246226 {space 3} {res}  .0685909  
{txt}        39{c |} {space 3} {res} .02458636 {space 3} {res} .54416511 {space 3} {res} .06945369  
{txt}        40{c |} {space 3} {res} .02240217 {space 3} {res} .54558257 {space 3} {res} .07029247  
{txt}        41{c |} {space 3} {res} .02041203 {space 3} {res} .54684348 {space 3} {res} .07105511  
{txt}        42{c |} {space 3} {res} .01859868 {space 3} {res} .54696324 {space 3} {res} .07138346  
{txt}        43{c |} {space 3} {res} .01694642 {space 3} {res} .54699591 {space 3} {res} .07164329  
{txt}        44{c |} {space 3} {res} .01544095 {space 3} {res} .54676535 {space 3} {res} .07190318  
{txt}        45{c |} {space 3} {res} .01406922 {space 3} {res} .54656854 {space 3} {res} .07214593  
{txt}        46{c |} {space 3} {res} .01281935 {space 3} {res} .54617183 {space 3} {res} .07220737  
{txt}        47{c |} {space 3} {res} .01168051 {space 3} {res} .54577796 {space 3} {res} .07220798  
{txt}        48{c |} {space 3} {res} .01064285 {space 3} {res} .54561333 {space 3} {res} .07228299  
{txt}        49{c |} {space 3} {res} .00969737 {space 3} {res} .54558012 {space 3} {res} .07240173  
{txt}        50{c |} {space 3} {res} .00883588 {space 3} {res} .54557658 {space 3} {res} .07250897  
{txt}        51{c |} {space 3} {res} .00805092 {space 3} {res} .54560485 {space 3} {res} .07260503  
{txt}        52{c |} {space 3} {res}  .0073357 {space 3} {res} .54565677 {space 3} {res}  .0726912  
{txt}        53{c |} {space 3} {res} .00668402 {space 3} {res} .54572578 {space 3} {res} .07276861  
{txt}        54{c |} {space 3} {res} .00609023 {space 3} {res} .54580668 {space 3} {res} .07283824  
{txt}        55{c |} {space 3} {res} .00554919 {space 3} {res} .54589536 {space 3} {res} .07290094  
{txt}        56{c |} {space 3} {res} .00505621 {space 3} {res} .54598858 {space 3} {res} .07295747  
{txt}        57{c |} {space 3} {res} .00460703 {space 3} {res} .54608384 {space 3} {res} .07300848  
{txt}        58{c |} {space 3} {res} .00419776 {space 3} {res} .54624391 {space 3} {res} .07308788  
{txt}        59{c |} {space 3} {res} .00382484 {space 3} {res} .54640367 {space 3} {res} .07316335  
{txt}        60{c |} {space 3} {res} .00348505 {space 3} {res} .54655521 {space 3} {res} .07323184  
{txt}        61{c |} {space 3} {res} .00317545 {space 3} {res} .54669826 {space 3} {res} .07329401  
{txt}        62{c |} {space 3} {res} .00289335 {space 3} {res} .54683272 {space 3} {res} .07335048  
{txt}        63{c |} {space 3} {res} .00263631 {space 3} {res} .54695866 {space 3} {res} .07340178  
{txt}        64{c |} {space 3} {res} .00240211 {space 3} {res} .54707625 {space 3} {res}  .0734484  
{txt}        65{c |} {space 3} {res} .00218871 {space 3} {res} .54718576 {space 3} {res} .07349077  
{txt}        66{c |} {space 3} {res} .00199428 {space 3} {res} .54728749 {space 3} {res} .07352929  
{txt}        67{c |} {space 3} {res} .00181711 {space 3} {res} .54738181 {space 3} {res} .07356432  
{txt}        68{c |} {space 3} {res} .00165568 {space 3} {res} .54746911 {space 3} {res} .07359617  
{txt}        69{c |} {space 3} {res}  .0015086 {space 3} {res} .54754977 {space 3} {res} .07362515  
{txt}        70{c |} {space 3} {res} .00137458 {space 3} {res} .54762419 {space 3} {res} .07365152  
{txt}        71{c |} {space 3} {res} .00125246 {space 3} {res} .54769278 {space 3} {res} .07367551  
{txt}        72{c |} {space 3} {res}  .0011412 {space 3} {res} .54775591 {space 3} {res} .07369734  
{txt}        73{c |} {space 3} {res} .00103982 {space 3} {res} .54781397 {space 3} {res} .07371721  
{txt}        74{c |} {space 3} {res} .00094744 {space 3} {res} .54786731 {space 3} {res} .07373529  
{txt}        75{c |} {space 3} {res} .00086327 {space 3} {res} .54791628 {space 3} {res} .07375176  
{txt}        76{c |} {space 3} {res} .00078658 {space 3} {res} .54796121 {space 3} {res} .07376674  
{txt}        77{c |} {space 3} {res} .00071671 {space 3} {res} .54800239 {space 3} {res} .07378039  
{txt}        78{c |} {space 3} {res} .00065304 {space 3} {res} .54804013 {space 3} {res} .07379281  
{txt}        79{c |} {space 3} {res} .00059502 {space 3} {res} .54807469 {space 3} {res} .07380413  
{txt}        80{c |} {space 3} {res} .00054216 {space 3} {res} .54810632 {space 3} {res} .07381443  
{txt}        81{c |} {space 3} {res}   .000494 {space 3} {res} .54813527 {space 3} {res} .07382381  
{txt}        82{c |} {space 3} {res} .00045011 {space 3} {res} .54816174 {space 3} {res} .07383236  
{txt}        83{c |} {space 3} {res} .00041013 {space 3} {res} .54818594 {space 3} {res} .07384014  
{txt}        84{c |} {space 3} {res} .00037369 {space 3} {res} .54820807 {space 3} {res} .07384723  
{txt}        85{c |} {space 3} {res} .00034049 {space 3} {res} .54822828 {space 3} {res} .07385368  
{txt}        86{c |} {space 3} {res} .00031024 {space 3} {res} .54824674 {space 3} {res} .07385956  
{txt}        87{c |} {space 3} {res} .00028268 {space 3} {res} .54826361 {space 3} {res} .07386492  
{txt}        88{c |} {space 3} {res} .00025757 {space 3} {res} .54827901 {space 3} {res}  .0738698  
{txt}        89{c |} {space 3} {res} .00023469 {space 3} {res} .54829307 {space 3} {res} .07387425  
{txt}        90{c |} {space 3} {res} .00021384 {space 3} {res}  .5483059 {space 3} {res} .07387829  
{txt}        91{c |} {space 3} {res} .00019484 {space 3} {res} .54831761 {space 3} {res} .07388198  
{txt}        92{c |} {space 3} {res} .00017753 {space 3} {res} .54832829 {space 3} {res} .07388534  
{txt}        93{c |} {space 3} {res} .00016176 {space 3} {res} .54833804 {space 3} {res}  .0738884  
{txt}        94{c |} {space 3} {res} .00014739 {space 3} {res} .54834694 {space 3} {res} .07389119  
{txt}        95{c |} {space 3} {res}  .0001343 {space 3} {res} .54835505 {space 3} {res} .07389373  
{txt}        96{c |} {space 3} {res} .00012237 {space 3} {res} .54836245 {space 3} {res} .07389605  
{txt}        97{c |} {space 3} {res}  .0001115 {space 3} {res}  .5483692 {space 3} {res} .07389816  
{txt}        98{c |} {space 3} {res} .00010159 {space 3} {res} .54837535 {space 3} {res} .07390008  
{txt}        99{c |} {space 3} {res} .00009257 {space 3} {res} .54838096 {space 3} {res} .07390183  
{txt}       100{c |} {space 3} {res} .00008434 {space 3} {res} .54838608 {space 3} {res} .07390342  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=1.60 12:05:22
{com}.         savedresults save nosklearn e()
{txt}r; t=0.03 12:05:22
{com}.         cvlasso $model, seed(123) lglmnet sklearn

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .84342744 {space 3} {res} 1.1985723 {space 3} {res} .12122983  
{txt}         2{c |} {space 3} {res} .76849967 {space 3} {res} 1.1009983 {space 3} {res} .11262081  
{txt}         3{c |} {space 3} {res} .70022828 {space 3} {res} 1.0203357 {space 3} {res} .10553207  
{txt}         4{c |} {space 3} {res} .63802193 {space 3} {res}  .9536824 {space 3} {res} .09966234  
{txt}         5{c |} {space 3} {res} .58134182 {space 3} {res} .89863205 {space 3} {res} .09478723  
{txt}         6{c |} {space 3} {res} .52969701 {space 3} {res} .85319575 {space 3} {res} .09073637  
{txt}         7{c |} {space 3} {res} .48264019 {space 3} {res} .81578472 {space 3} {res}  .0873491  
{txt}         8{c |} {space 3} {res} .43976377 {space 3} {res} .78154651 {space 3} {res} .08491925  
{txt}         9{c |} {space 3} {res} .40069637 {space 3} {res}  .7478268 {space 3} {res} .08380347  
{txt}        10{c |} {space 3} {res}  .3650996 {space 3} {res} .71342517 {space 3} {res} .08081716  
{txt}        11{c |} {space 3} {res} .33266516 {space 3} {res} .68235451 {space 3} {res} .07742971  
{txt}        12{c |} {space 3} {res} .30311211 {space 3} {res} .65370266 {space 3} {res} .07333234  
{txt}        13{c |} {space 3} {res} .27618446 {space 3} {res} .63000117 {space 3} {res} .06984016  
{txt}        14{c |} {space 3} {res}   .251649 {space 3} {res} .61040194 {space 3} {res} .06689166  
{txt}        15{c |} {space 3} {res} .22929319 {space 3} {res} .59420154 {space 3} {res} .06442817  
{txt}        16{c |} {space 3} {res} .20892342 {space 3} {res} .58090496 {space 3} {res} .06239885  ^
{txt}        17{c |} {space 3} {res} .19036324 {space 3} {res} .57016747 {space 3} {res} .06076552  
{txt}        18{c |} {space 3} {res} .17345189 {space 3} {res}   .561509 {space 3} {res} .05943333  
{txt}        19{c |} {space 3} {res}  .1580429 {space 3} {res} .55440203 {space 3} {res} .05843354  
{txt}        20{c |} {space 3} {res} .14400281 {space 3} {res} .54900851 {space 3} {res} .05780941  
{txt}        21{c |} {space 3} {res} .13120999 {space 3} {res} .54491135 {space 3} {res} .05742444  
{txt}        22{c |} {space 3} {res} .11955366 {space 3} {res} .54184215 {space 3} {res} .05721238  
{txt}        23{c |} {space 3} {res} .10893284 {space 3} {res} .53941952 {space 3} {res} .05712655  
{txt}        24{c |} {space 3} {res} .09925555 {space 3} {res} .53682782 {space 3} {res} .05736559  
{txt}        25{c |} {space 3} {res} .09043796 {space 3} {res}  .5343898 {space 3} {res} .05781237  
{txt}        26{c |} {space 3} {res}  .0824037 {space 3} {res} .53385524 {space 3} {res} .05833199  *
{txt}        27{c |} {space 3} {res} .07508318 {space 3} {res} .53417253 {space 3} {res} .05899937  
{txt}        28{c |} {space 3} {res}   .068413 {space 3} {res} .53448587 {space 3} {res} .05974718  
{txt}        29{c |} {space 3} {res} .06233538 {space 3} {res} .53463875 {space 3} {res} .06047825  
{txt}        30{c |} {space 3} {res} .05679767 {space 3} {res} .53480944 {space 3} {res} .06118856  
{txt}        31{c |} {space 3} {res} .05175193 {space 3} {res} .53476007 {space 3} {res} .06203773  
{txt}        32{c |} {space 3} {res} .04715443 {space 3} {res} .53492216 {space 3} {res} .06282275  
{txt}        33{c |} {space 3} {res} .04296536 {space 3} {res} .53522945 {space 3} {res} .06354815  
{txt}        34{c |} {space 3} {res} .03914843 {space 3} {res} .53569438 {space 3} {res} .06422422  
{txt}        35{c |} {space 3} {res} .03567059 {space 3} {res} .53736358 {space 3} {res} .06544877  
{txt}        36{c |} {space 3} {res} .03250172 {space 3} {res} .53904818 {space 3} {res} .06658825  
{txt}        37{c |} {space 3} {res} .02961435 {space 3} {res} .54071902 {space 3} {res} .06764623  
{txt}        38{c |} {space 3} {res}  .0269835 {space 3} {res} .54246226 {space 3} {res}  .0685909  
{txt}        39{c |} {space 3} {res} .02458636 {space 3} {res} .54416511 {space 3} {res} .06945369  
{txt}        40{c |} {space 3} {res} .02240217 {space 3} {res} .54558257 {space 3} {res} .07029247  
{txt}        41{c |} {space 3} {res} .02041203 {space 3} {res} .54684348 {space 3} {res} .07105511  
{txt}        42{c |} {space 3} {res} .01859868 {space 3} {res} .54696324 {space 3} {res} .07138346  
{txt}        43{c |} {space 3} {res} .01694642 {space 3} {res} .54699591 {space 3} {res} .07164329  
{txt}        44{c |} {space 3} {res} .01544095 {space 3} {res} .54676535 {space 3} {res} .07190318  
{txt}        45{c |} {space 3} {res} .01406922 {space 3} {res} .54656854 {space 3} {res} .07214593  
{txt}        46{c |} {space 3} {res} .01281935 {space 3} {res} .54617183 {space 3} {res} .07220737  
{txt}        47{c |} {space 3} {res} .01168051 {space 3} {res} .54577796 {space 3} {res} .07220798  
{txt}        48{c |} {space 3} {res} .01064285 {space 3} {res} .54561333 {space 3} {res} .07228299  
{txt}        49{c |} {space 3} {res} .00969737 {space 3} {res} .54558012 {space 3} {res} .07240173  
{txt}        50{c |} {space 3} {res} .00883588 {space 3} {res} .54557658 {space 3} {res} .07250897  
{txt}        51{c |} {space 3} {res} .00805092 {space 3} {res} .54560485 {space 3} {res} .07260503  
{txt}        52{c |} {space 3} {res}  .0073357 {space 3} {res} .54565677 {space 3} {res}  .0726912  
{txt}        53{c |} {space 3} {res} .00668402 {space 3} {res} .54572578 {space 3} {res} .07276861  
{txt}        54{c |} {space 3} {res} .00609023 {space 3} {res} .54580668 {space 3} {res} .07283824  
{txt}        55{c |} {space 3} {res} .00554919 {space 3} {res} .54589536 {space 3} {res} .07290094  
{txt}        56{c |} {space 3} {res} .00505621 {space 3} {res} .54598858 {space 3} {res} .07295747  
{txt}        57{c |} {space 3} {res} .00460703 {space 3} {res} .54608384 {space 3} {res} .07300848  
{txt}        58{c |} {space 3} {res} .00419776 {space 3} {res} .54624391 {space 3} {res} .07308788  
{txt}        59{c |} {space 3} {res} .00382484 {space 3} {res} .54640367 {space 3} {res} .07316335  
{txt}        60{c |} {space 3} {res} .00348505 {space 3} {res} .54655521 {space 3} {res} .07323184  
{txt}        61{c |} {space 3} {res} .00317545 {space 3} {res} .54669826 {space 3} {res} .07329401  
{txt}        62{c |} {space 3} {res} .00289335 {space 3} {res} .54683272 {space 3} {res} .07335048  
{txt}        63{c |} {space 3} {res} .00263631 {space 3} {res} .54695866 {space 3} {res} .07340178  
{txt}        64{c |} {space 3} {res} .00240211 {space 3} {res} .54707625 {space 3} {res}  .0734484  
{txt}        65{c |} {space 3} {res} .00218871 {space 3} {res} .54718576 {space 3} {res} .07349077  
{txt}        66{c |} {space 3} {res} .00199428 {space 3} {res} .54728749 {space 3} {res} .07352929  
{txt}        67{c |} {space 3} {res} .00181711 {space 3} {res} .54738181 {space 3} {res} .07356432  
{txt}        68{c |} {space 3} {res} .00165568 {space 3} {res} .54746911 {space 3} {res} .07359617  
{txt}        69{c |} {space 3} {res}  .0015086 {space 3} {res} .54754977 {space 3} {res} .07362515  
{txt}        70{c |} {space 3} {res} .00137458 {space 3} {res} .54762419 {space 3} {res} .07365152  
{txt}        71{c |} {space 3} {res} .00125246 {space 3} {res} .54769278 {space 3} {res} .07367551  
{txt}        72{c |} {space 3} {res}  .0011412 {space 3} {res} .54775591 {space 3} {res} .07369734  
{txt}        73{c |} {space 3} {res} .00103982 {space 3} {res} .54781397 {space 3} {res} .07371721  
{txt}        74{c |} {space 3} {res} .00094744 {space 3} {res} .54786731 {space 3} {res} .07373529  
{txt}        75{c |} {space 3} {res} .00086327 {space 3} {res} .54791628 {space 3} {res} .07375176  
{txt}        76{c |} {space 3} {res} .00078658 {space 3} {res} .54796121 {space 3} {res} .07376674  
{txt}        77{c |} {space 3} {res} .00071671 {space 3} {res} .54800239 {space 3} {res} .07378039  
{txt}        78{c |} {space 3} {res} .00065304 {space 3} {res} .54804013 {space 3} {res} .07379281  
{txt}        79{c |} {space 3} {res} .00059502 {space 3} {res} .54807469 {space 3} {res} .07380413  
{txt}        80{c |} {space 3} {res} .00054216 {space 3} {res} .54810632 {space 3} {res} .07381443  
{txt}        81{c |} {space 3} {res}   .000494 {space 3} {res} .54813527 {space 3} {res} .07382381  
{txt}        82{c |} {space 3} {res} .00045011 {space 3} {res} .54816174 {space 3} {res} .07383236  
{txt}        83{c |} {space 3} {res} .00041013 {space 3} {res} .54818594 {space 3} {res} .07384014  
{txt}        84{c |} {space 3} {res} .00037369 {space 3} {res} .54820807 {space 3} {res} .07384723  
{txt}        85{c |} {space 3} {res} .00034049 {space 3} {res} .54822828 {space 3} {res} .07385368  
{txt}        86{c |} {space 3} {res} .00031024 {space 3} {res} .54824674 {space 3} {res} .07385956  
{txt}        87{c |} {space 3} {res} .00028268 {space 3} {res} .54826361 {space 3} {res} .07386492  
{txt}        88{c |} {space 3} {res} .00025757 {space 3} {res} .54827901 {space 3} {res}  .0738698  
{txt}        89{c |} {space 3} {res} .00023469 {space 3} {res} .54829307 {space 3} {res} .07387425  
{txt}        90{c |} {space 3} {res} .00021384 {space 3} {res}  .5483059 {space 3} {res} .07387829  
{txt}        91{c |} {space 3} {res} .00019484 {space 3} {res} .54831761 {space 3} {res} .07388198  
{txt}        92{c |} {space 3} {res} .00017753 {space 3} {res} .54832829 {space 3} {res} .07388534  
{txt}        93{c |} {space 3} {res} .00016176 {space 3} {res} .54833804 {space 3} {res}  .0738884  
{txt}        94{c |} {space 3} {res} .00014739 {space 3} {res} .54834694 {space 3} {res} .07389119  
{txt}        95{c |} {space 3} {res}  .0001343 {space 3} {res} .54835505 {space 3} {res} .07389373  
{txt}        96{c |} {space 3} {res} .00012237 {space 3} {res} .54836245 {space 3} {res} .07389605  
{txt}        97{c |} {space 3} {res}  .0001115 {space 3} {res}  .5483692 {space 3} {res} .07389816  
{txt}        98{c |} {space 3} {res} .00010159 {space 3} {res} .54837535 {space 3} {res} .07390008  
{txt}        99{c |} {space 3} {res} .00009257 {space 3} {res} .54838096 {space 3} {res} .07390183  
{txt}       100{c |} {space 3} {res} .00008434 {space 3} {res} .54838608 {space 3} {res} .07390342  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=1.78 12:05:24
{com}.         savedresults comp nosklearn e(),                                                                        ///
>                 exclude(macros: lasso2opt)                                                                              ///
>                 tol(1e-7) verbose
{txt}comparing macro  e(cvmethod)
comparing macro  e(varXmodel)
comparing macro  e(varX)
comparing macro  e(depvar)
comparing macro  e(predict)
comparing macro  e(cmd)
comparing scalar e(N)
comparing scalar e(nfolds)
comparing scalar e(lmax)
comparing scalar e(lmin)
comparing scalar e(lcount)
comparing scalar e(sqrt)
comparing scalar e(adaptive)
comparing scalar e(ols)
comparing scalar e(notpen_ct)
comparing scalar e(partial_ct)
comparing scalar e(prestd)
comparing scalar e(nalpha)
comparing scalar e(p)
comparing scalar e(alpha)
comparing scalar e(lopt)
comparing scalar e(lse)
comparing scalar e(mspemin)
comparing matrix e(cvlower)
comparing matrix e(cvupper)
comparing matrix e(cvsd)
comparing matrix e(mmspe)
comparing matrix e(mspe)
comparing matrix e(lambdamat)
r; t=0.00 12:05:24
{com}.         // now with lopt
.         cvlasso $model, seed(123) lglmnet lopt

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .84342744 {space 3} {res} 1.1985723 {space 3} {res} .12122983  
{txt}         2{c |} {space 3} {res} .76849967 {space 3} {res} 1.1009983 {space 3} {res} .11262081  
{txt}         3{c |} {space 3} {res} .70022828 {space 3} {res} 1.0203357 {space 3} {res} .10553207  
{txt}         4{c |} {space 3} {res} .63802193 {space 3} {res}  .9536824 {space 3} {res} .09966234  
{txt}         5{c |} {space 3} {res} .58134182 {space 3} {res} .89863205 {space 3} {res} .09478723  
{txt}         6{c |} {space 3} {res} .52969701 {space 3} {res} .85319575 {space 3} {res} .09073637  
{txt}         7{c |} {space 3} {res} .48264019 {space 3} {res} .81578472 {space 3} {res}  .0873491  
{txt}         8{c |} {space 3} {res} .43976377 {space 3} {res} .78154651 {space 3} {res} .08491925  
{txt}         9{c |} {space 3} {res} .40069637 {space 3} {res}  .7478268 {space 3} {res} .08380347  
{txt}        10{c |} {space 3} {res}  .3650996 {space 3} {res} .71342517 {space 3} {res} .08081716  
{txt}        11{c |} {space 3} {res} .33266516 {space 3} {res} .68235451 {space 3} {res} .07742971  
{txt}        12{c |} {space 3} {res} .30311211 {space 3} {res} .65370266 {space 3} {res} .07333234  
{txt}        13{c |} {space 3} {res} .27618446 {space 3} {res} .63000117 {space 3} {res} .06984016  
{txt}        14{c |} {space 3} {res}   .251649 {space 3} {res} .61040194 {space 3} {res} .06689166  
{txt}        15{c |} {space 3} {res} .22929319 {space 3} {res} .59420154 {space 3} {res} .06442817  
{txt}        16{c |} {space 3} {res} .20892342 {space 3} {res} .58090496 {space 3} {res} .06239885  ^
{txt}        17{c |} {space 3} {res} .19036324 {space 3} {res} .57016747 {space 3} {res} .06076552  
{txt}        18{c |} {space 3} {res} .17345189 {space 3} {res}   .561509 {space 3} {res} .05943333  
{txt}        19{c |} {space 3} {res}  .1580429 {space 3} {res} .55440203 {space 3} {res} .05843354  
{txt}        20{c |} {space 3} {res} .14400281 {space 3} {res} .54900851 {space 3} {res} .05780941  
{txt}        21{c |} {space 3} {res} .13120999 {space 3} {res} .54491135 {space 3} {res} .05742444  
{txt}        22{c |} {space 3} {res} .11955366 {space 3} {res} .54184215 {space 3} {res} .05721238  
{txt}        23{c |} {space 3} {res} .10893284 {space 3} {res} .53941952 {space 3} {res} .05712655  
{txt}        24{c |} {space 3} {res} .09925555 {space 3} {res} .53682782 {space 3} {res} .05736559  
{txt}        25{c |} {space 3} {res} .09043796 {space 3} {res}  .5343898 {space 3} {res} .05781237  
{txt}        26{c |} {space 3} {res}  .0824037 {space 3} {res} .53385524 {space 3} {res} .05833199  *
{txt}        27{c |} {space 3} {res} .07508318 {space 3} {res} .53417253 {space 3} {res} .05899937  
{txt}        28{c |} {space 3} {res}   .068413 {space 3} {res} .53448587 {space 3} {res} .05974718  
{txt}        29{c |} {space 3} {res} .06233538 {space 3} {res} .53463875 {space 3} {res} .06047825  
{txt}        30{c |} {space 3} {res} .05679767 {space 3} {res} .53480944 {space 3} {res} .06118856  
{txt}        31{c |} {space 3} {res} .05175193 {space 3} {res} .53476007 {space 3} {res} .06203773  
{txt}        32{c |} {space 3} {res} .04715443 {space 3} {res} .53492216 {space 3} {res} .06282275  
{txt}        33{c |} {space 3} {res} .04296536 {space 3} {res} .53522945 {space 3} {res} .06354815  
{txt}        34{c |} {space 3} {res} .03914843 {space 3} {res} .53569438 {space 3} {res} .06422422  
{txt}        35{c |} {space 3} {res} .03567059 {space 3} {res} .53736358 {space 3} {res} .06544877  
{txt}        36{c |} {space 3} {res} .03250172 {space 3} {res} .53904818 {space 3} {res} .06658825  
{txt}        37{c |} {space 3} {res} .02961435 {space 3} {res} .54071902 {space 3} {res} .06764623  
{txt}        38{c |} {space 3} {res}  .0269835 {space 3} {res} .54246226 {space 3} {res}  .0685909  
{txt}        39{c |} {space 3} {res} .02458636 {space 3} {res} .54416511 {space 3} {res} .06945369  
{txt}        40{c |} {space 3} {res} .02240217 {space 3} {res} .54558257 {space 3} {res} .07029247  
{txt}        41{c |} {space 3} {res} .02041203 {space 3} {res} .54684348 {space 3} {res} .07105511  
{txt}        42{c |} {space 3} {res} .01859868 {space 3} {res} .54696324 {space 3} {res} .07138346  
{txt}        43{c |} {space 3} {res} .01694642 {space 3} {res} .54699591 {space 3} {res} .07164329  
{txt}        44{c |} {space 3} {res} .01544095 {space 3} {res} .54676535 {space 3} {res} .07190318  
{txt}        45{c |} {space 3} {res} .01406922 {space 3} {res} .54656854 {space 3} {res} .07214593  
{txt}        46{c |} {space 3} {res} .01281935 {space 3} {res} .54617183 {space 3} {res} .07220737  
{txt}        47{c |} {space 3} {res} .01168051 {space 3} {res} .54577796 {space 3} {res} .07220798  
{txt}        48{c |} {space 3} {res} .01064285 {space 3} {res} .54561333 {space 3} {res} .07228299  
{txt}        49{c |} {space 3} {res} .00969737 {space 3} {res} .54558012 {space 3} {res} .07240173  
{txt}        50{c |} {space 3} {res} .00883588 {space 3} {res} .54557658 {space 3} {res} .07250897  
{txt}        51{c |} {space 3} {res} .00805092 {space 3} {res} .54560485 {space 3} {res} .07260503  
{txt}        52{c |} {space 3} {res}  .0073357 {space 3} {res} .54565677 {space 3} {res}  .0726912  
{txt}        53{c |} {space 3} {res} .00668402 {space 3} {res} .54572578 {space 3} {res} .07276861  
{txt}        54{c |} {space 3} {res} .00609023 {space 3} {res} .54580668 {space 3} {res} .07283824  
{txt}        55{c |} {space 3} {res} .00554919 {space 3} {res} .54589536 {space 3} {res} .07290094  
{txt}        56{c |} {space 3} {res} .00505621 {space 3} {res} .54598858 {space 3} {res} .07295747  
{txt}        57{c |} {space 3} {res} .00460703 {space 3} {res} .54608384 {space 3} {res} .07300848  
{txt}        58{c |} {space 3} {res} .00419776 {space 3} {res} .54624391 {space 3} {res} .07308788  
{txt}        59{c |} {space 3} {res} .00382484 {space 3} {res} .54640367 {space 3} {res} .07316335  
{txt}        60{c |} {space 3} {res} .00348505 {space 3} {res} .54655521 {space 3} {res} .07323184  
{txt}        61{c |} {space 3} {res} .00317545 {space 3} {res} .54669826 {space 3} {res} .07329401  
{txt}        62{c |} {space 3} {res} .00289335 {space 3} {res} .54683272 {space 3} {res} .07335048  
{txt}        63{c |} {space 3} {res} .00263631 {space 3} {res} .54695866 {space 3} {res} .07340178  
{txt}        64{c |} {space 3} {res} .00240211 {space 3} {res} .54707625 {space 3} {res}  .0734484  
{txt}        65{c |} {space 3} {res} .00218871 {space 3} {res} .54718576 {space 3} {res} .07349077  
{txt}        66{c |} {space 3} {res} .00199428 {space 3} {res} .54728749 {space 3} {res} .07352929  
{txt}        67{c |} {space 3} {res} .00181711 {space 3} {res} .54738181 {space 3} {res} .07356432  
{txt}        68{c |} {space 3} {res} .00165568 {space 3} {res} .54746911 {space 3} {res} .07359617  
{txt}        69{c |} {space 3} {res}  .0015086 {space 3} {res} .54754977 {space 3} {res} .07362515  
{txt}        70{c |} {space 3} {res} .00137458 {space 3} {res} .54762419 {space 3} {res} .07365152  
{txt}        71{c |} {space 3} {res} .00125246 {space 3} {res} .54769278 {space 3} {res} .07367551  
{txt}        72{c |} {space 3} {res}  .0011412 {space 3} {res} .54775591 {space 3} {res} .07369734  
{txt}        73{c |} {space 3} {res} .00103982 {space 3} {res} .54781397 {space 3} {res} .07371721  
{txt}        74{c |} {space 3} {res} .00094744 {space 3} {res} .54786731 {space 3} {res} .07373529  
{txt}        75{c |} {space 3} {res} .00086327 {space 3} {res} .54791628 {space 3} {res} .07375176  
{txt}        76{c |} {space 3} {res} .00078658 {space 3} {res} .54796121 {space 3} {res} .07376674  
{txt}        77{c |} {space 3} {res} .00071671 {space 3} {res} .54800239 {space 3} {res} .07378039  
{txt}        78{c |} {space 3} {res} .00065304 {space 3} {res} .54804013 {space 3} {res} .07379281  
{txt}        79{c |} {space 3} {res} .00059502 {space 3} {res} .54807469 {space 3} {res} .07380413  
{txt}        80{c |} {space 3} {res} .00054216 {space 3} {res} .54810632 {space 3} {res} .07381443  
{txt}        81{c |} {space 3} {res}   .000494 {space 3} {res} .54813527 {space 3} {res} .07382381  
{txt}        82{c |} {space 3} {res} .00045011 {space 3} {res} .54816174 {space 3} {res} .07383236  
{txt}        83{c |} {space 3} {res} .00041013 {space 3} {res} .54818594 {space 3} {res} .07384014  
{txt}        84{c |} {space 3} {res} .00037369 {space 3} {res} .54820807 {space 3} {res} .07384723  
{txt}        85{c |} {space 3} {res} .00034049 {space 3} {res} .54822828 {space 3} {res} .07385368  
{txt}        86{c |} {space 3} {res} .00031024 {space 3} {res} .54824674 {space 3} {res} .07385956  
{txt}        87{c |} {space 3} {res} .00028268 {space 3} {res} .54826361 {space 3} {res} .07386492  
{txt}        88{c |} {space 3} {res} .00025757 {space 3} {res} .54827901 {space 3} {res}  .0738698  
{txt}        89{c |} {space 3} {res} .00023469 {space 3} {res} .54829307 {space 3} {res} .07387425  
{txt}        90{c |} {space 3} {res} .00021384 {space 3} {res}  .5483059 {space 3} {res} .07387829  
{txt}        91{c |} {space 3} {res} .00019484 {space 3} {res} .54831761 {space 3} {res} .07388198  
{txt}        92{c |} {space 3} {res} .00017753 {space 3} {res} .54832829 {space 3} {res} .07388534  
{txt}        93{c |} {space 3} {res} .00016176 {space 3} {res} .54833804 {space 3} {res}  .0738884  
{txt}        94{c |} {space 3} {res} .00014739 {space 3} {res} .54834694 {space 3} {res} .07389119  
{txt}        95{c |} {space 3} {res}  .0001343 {space 3} {res} .54835505 {space 3} {res} .07389373  
{txt}        96{c |} {space 3} {res} .00012237 {space 3} {res} .54836245 {space 3} {res} .07389605  
{txt}        97{c |} {space 3} {res}  .0001115 {space 3} {res}  .5483692 {space 3} {res} .07389816  
{txt}        98{c |} {space 3} {res} .00010159 {space 3} {res} .54837535 {space 3} {res} .07390008  
{txt}        99{c |} {space 3} {res} .00009257 {space 3} {res} .54838096 {space 3} {res} .07390183  
{txt}       100{c |} {space 3} {res} .00008434 {space 3} {res} .54838608 {space 3} {res} .07390342  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
Estimate  with lambda=.082 (lopt).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4892425      0.5125769
{txt}{space 10}lweight {c |}{col 21}{res}      0.4733331      0.5490809
{txt}{space 13}lbph {c |}{col 21}{res}      0.0245194      0.0721513
{txt}{space 14}svi {c |}{col 21}{res}      0.5257949      0.6496250
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0010786      0.0024450
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.0423852     -0.4136749
{txt}{hline 18}{c BT}{hline 32}
r; t=1.73 12:05:25
{com}.         savedresults save nosklearn e()
{txt}r; t=0.00 12:05:25
{com}.         cvlasso $model, seed(123) lglmnet lopt sklearn

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} .84342744 {space 3} {res} 1.1985723 {space 3} {res} .12122983  
{txt}         2{c |} {space 3} {res} .76849967 {space 3} {res} 1.1009983 {space 3} {res} .11262081  
{txt}         3{c |} {space 3} {res} .70022828 {space 3} {res} 1.0203357 {space 3} {res} .10553207  
{txt}         4{c |} {space 3} {res} .63802193 {space 3} {res}  .9536824 {space 3} {res} .09966234  
{txt}         5{c |} {space 3} {res} .58134182 {space 3} {res} .89863205 {space 3} {res} .09478723  
{txt}         6{c |} {space 3} {res} .52969701 {space 3} {res} .85319575 {space 3} {res} .09073637  
{txt}         7{c |} {space 3} {res} .48264019 {space 3} {res} .81578472 {space 3} {res}  .0873491  
{txt}         8{c |} {space 3} {res} .43976377 {space 3} {res} .78154651 {space 3} {res} .08491925  
{txt}         9{c |} {space 3} {res} .40069637 {space 3} {res}  .7478268 {space 3} {res} .08380347  
{txt}        10{c |} {space 3} {res}  .3650996 {space 3} {res} .71342517 {space 3} {res} .08081716  
{txt}        11{c |} {space 3} {res} .33266516 {space 3} {res} .68235451 {space 3} {res} .07742971  
{txt}        12{c |} {space 3} {res} .30311211 {space 3} {res} .65370266 {space 3} {res} .07333234  
{txt}        13{c |} {space 3} {res} .27618446 {space 3} {res} .63000117 {space 3} {res} .06984016  
{txt}        14{c |} {space 3} {res}   .251649 {space 3} {res} .61040194 {space 3} {res} .06689166  
{txt}        15{c |} {space 3} {res} .22929319 {space 3} {res} .59420154 {space 3} {res} .06442817  
{txt}        16{c |} {space 3} {res} .20892342 {space 3} {res} .58090496 {space 3} {res} .06239885  ^
{txt}        17{c |} {space 3} {res} .19036324 {space 3} {res} .57016747 {space 3} {res} .06076552  
{txt}        18{c |} {space 3} {res} .17345189 {space 3} {res}   .561509 {space 3} {res} .05943333  
{txt}        19{c |} {space 3} {res}  .1580429 {space 3} {res} .55440203 {space 3} {res} .05843354  
{txt}        20{c |} {space 3} {res} .14400281 {space 3} {res} .54900851 {space 3} {res} .05780941  
{txt}        21{c |} {space 3} {res} .13120999 {space 3} {res} .54491135 {space 3} {res} .05742444  
{txt}        22{c |} {space 3} {res} .11955366 {space 3} {res} .54184215 {space 3} {res} .05721238  
{txt}        23{c |} {space 3} {res} .10893284 {space 3} {res} .53941952 {space 3} {res} .05712655  
{txt}        24{c |} {space 3} {res} .09925555 {space 3} {res} .53682782 {space 3} {res} .05736559  
{txt}        25{c |} {space 3} {res} .09043796 {space 3} {res}  .5343898 {space 3} {res} .05781237  
{txt}        26{c |} {space 3} {res}  .0824037 {space 3} {res} .53385524 {space 3} {res} .05833199  *
{txt}        27{c |} {space 3} {res} .07508318 {space 3} {res} .53417253 {space 3} {res} .05899937  
{txt}        28{c |} {space 3} {res}   .068413 {space 3} {res} .53448587 {space 3} {res} .05974718  
{txt}        29{c |} {space 3} {res} .06233538 {space 3} {res} .53463875 {space 3} {res} .06047825  
{txt}        30{c |} {space 3} {res} .05679767 {space 3} {res} .53480944 {space 3} {res} .06118856  
{txt}        31{c |} {space 3} {res} .05175193 {space 3} {res} .53476007 {space 3} {res} .06203773  
{txt}        32{c |} {space 3} {res} .04715443 {space 3} {res} .53492216 {space 3} {res} .06282275  
{txt}        33{c |} {space 3} {res} .04296536 {space 3} {res} .53522945 {space 3} {res} .06354815  
{txt}        34{c |} {space 3} {res} .03914843 {space 3} {res} .53569438 {space 3} {res} .06422422  
{txt}        35{c |} {space 3} {res} .03567059 {space 3} {res} .53736358 {space 3} {res} .06544877  
{txt}        36{c |} {space 3} {res} .03250172 {space 3} {res} .53904818 {space 3} {res} .06658825  
{txt}        37{c |} {space 3} {res} .02961435 {space 3} {res} .54071902 {space 3} {res} .06764623  
{txt}        38{c |} {space 3} {res}  .0269835 {space 3} {res} .54246226 {space 3} {res}  .0685909  
{txt}        39{c |} {space 3} {res} .02458636 {space 3} {res} .54416511 {space 3} {res} .06945369  
{txt}        40{c |} {space 3} {res} .02240217 {space 3} {res} .54558257 {space 3} {res} .07029247  
{txt}        41{c |} {space 3} {res} .02041203 {space 3} {res} .54684348 {space 3} {res} .07105511  
{txt}        42{c |} {space 3} {res} .01859868 {space 3} {res} .54696324 {space 3} {res} .07138346  
{txt}        43{c |} {space 3} {res} .01694642 {space 3} {res} .54699591 {space 3} {res} .07164329  
{txt}        44{c |} {space 3} {res} .01544095 {space 3} {res} .54676535 {space 3} {res} .07190318  
{txt}        45{c |} {space 3} {res} .01406922 {space 3} {res} .54656854 {space 3} {res} .07214593  
{txt}        46{c |} {space 3} {res} .01281935 {space 3} {res} .54617183 {space 3} {res} .07220737  
{txt}        47{c |} {space 3} {res} .01168051 {space 3} {res} .54577796 {space 3} {res} .07220798  
{txt}        48{c |} {space 3} {res} .01064285 {space 3} {res} .54561333 {space 3} {res} .07228299  
{txt}        49{c |} {space 3} {res} .00969737 {space 3} {res} .54558012 {space 3} {res} .07240173  
{txt}        50{c |} {space 3} {res} .00883588 {space 3} {res} .54557658 {space 3} {res} .07250897  
{txt}        51{c |} {space 3} {res} .00805092 {space 3} {res} .54560485 {space 3} {res} .07260503  
{txt}        52{c |} {space 3} {res}  .0073357 {space 3} {res} .54565677 {space 3} {res}  .0726912  
{txt}        53{c |} {space 3} {res} .00668402 {space 3} {res} .54572578 {space 3} {res} .07276861  
{txt}        54{c |} {space 3} {res} .00609023 {space 3} {res} .54580668 {space 3} {res} .07283824  
{txt}        55{c |} {space 3} {res} .00554919 {space 3} {res} .54589536 {space 3} {res} .07290094  
{txt}        56{c |} {space 3} {res} .00505621 {space 3} {res} .54598858 {space 3} {res} .07295747  
{txt}        57{c |} {space 3} {res} .00460703 {space 3} {res} .54608384 {space 3} {res} .07300848  
{txt}        58{c |} {space 3} {res} .00419776 {space 3} {res} .54624391 {space 3} {res} .07308788  
{txt}        59{c |} {space 3} {res} .00382484 {space 3} {res} .54640367 {space 3} {res} .07316335  
{txt}        60{c |} {space 3} {res} .00348505 {space 3} {res} .54655521 {space 3} {res} .07323184  
{txt}        61{c |} {space 3} {res} .00317545 {space 3} {res} .54669826 {space 3} {res} .07329401  
{txt}        62{c |} {space 3} {res} .00289335 {space 3} {res} .54683272 {space 3} {res} .07335048  
{txt}        63{c |} {space 3} {res} .00263631 {space 3} {res} .54695866 {space 3} {res} .07340178  
{txt}        64{c |} {space 3} {res} .00240211 {space 3} {res} .54707625 {space 3} {res}  .0734484  
{txt}        65{c |} {space 3} {res} .00218871 {space 3} {res} .54718576 {space 3} {res} .07349077  
{txt}        66{c |} {space 3} {res} .00199428 {space 3} {res} .54728749 {space 3} {res} .07352929  
{txt}        67{c |} {space 3} {res} .00181711 {space 3} {res} .54738181 {space 3} {res} .07356432  
{txt}        68{c |} {space 3} {res} .00165568 {space 3} {res} .54746911 {space 3} {res} .07359617  
{txt}        69{c |} {space 3} {res}  .0015086 {space 3} {res} .54754977 {space 3} {res} .07362515  
{txt}        70{c |} {space 3} {res} .00137458 {space 3} {res} .54762419 {space 3} {res} .07365152  
{txt}        71{c |} {space 3} {res} .00125246 {space 3} {res} .54769278 {space 3} {res} .07367551  
{txt}        72{c |} {space 3} {res}  .0011412 {space 3} {res} .54775591 {space 3} {res} .07369734  
{txt}        73{c |} {space 3} {res} .00103982 {space 3} {res} .54781397 {space 3} {res} .07371721  
{txt}        74{c |} {space 3} {res} .00094744 {space 3} {res} .54786731 {space 3} {res} .07373529  
{txt}        75{c |} {space 3} {res} .00086327 {space 3} {res} .54791628 {space 3} {res} .07375176  
{txt}        76{c |} {space 3} {res} .00078658 {space 3} {res} .54796121 {space 3} {res} .07376674  
{txt}        77{c |} {space 3} {res} .00071671 {space 3} {res} .54800239 {space 3} {res} .07378039  
{txt}        78{c |} {space 3} {res} .00065304 {space 3} {res} .54804013 {space 3} {res} .07379281  
{txt}        79{c |} {space 3} {res} .00059502 {space 3} {res} .54807469 {space 3} {res} .07380413  
{txt}        80{c |} {space 3} {res} .00054216 {space 3} {res} .54810632 {space 3} {res} .07381443  
{txt}        81{c |} {space 3} {res}   .000494 {space 3} {res} .54813527 {space 3} {res} .07382381  
{txt}        82{c |} {space 3} {res} .00045011 {space 3} {res} .54816174 {space 3} {res} .07383236  
{txt}        83{c |} {space 3} {res} .00041013 {space 3} {res} .54818594 {space 3} {res} .07384014  
{txt}        84{c |} {space 3} {res} .00037369 {space 3} {res} .54820807 {space 3} {res} .07384723  
{txt}        85{c |} {space 3} {res} .00034049 {space 3} {res} .54822828 {space 3} {res} .07385368  
{txt}        86{c |} {space 3} {res} .00031024 {space 3} {res} .54824674 {space 3} {res} .07385956  
{txt}        87{c |} {space 3} {res} .00028268 {space 3} {res} .54826361 {space 3} {res} .07386492  
{txt}        88{c |} {space 3} {res} .00025757 {space 3} {res} .54827901 {space 3} {res}  .0738698  
{txt}        89{c |} {space 3} {res} .00023469 {space 3} {res} .54829307 {space 3} {res} .07387425  
{txt}        90{c |} {space 3} {res} .00021384 {space 3} {res}  .5483059 {space 3} {res} .07387829  
{txt}        91{c |} {space 3} {res} .00019484 {space 3} {res} .54831761 {space 3} {res} .07388198  
{txt}        92{c |} {space 3} {res} .00017753 {space 3} {res} .54832829 {space 3} {res} .07388534  
{txt}        93{c |} {space 3} {res} .00016176 {space 3} {res} .54833804 {space 3} {res}  .0738884  
{txt}        94{c |} {space 3} {res} .00014739 {space 3} {res} .54834694 {space 3} {res} .07389119  
{txt}        95{c |} {space 3} {res}  .0001343 {space 3} {res} .54835505 {space 3} {res} .07389373  
{txt}        96{c |} {space 3} {res} .00012237 {space 3} {res} .54836245 {space 3} {res} .07389605  
{txt}        97{c |} {space 3} {res}  .0001115 {space 3} {res}  .5483692 {space 3} {res} .07389816  
{txt}        98{c |} {space 3} {res} .00010159 {space 3} {res} .54837535 {space 3} {res} .07390008  
{txt}        99{c |} {space 3} {res} .00009257 {space 3} {res} .54838096 {space 3} {res} .07390183  
{txt}       100{c |} {space 3} {res} .00008434 {space 3} {res} .54838608 {space 3} {res} .07390342  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
Estimate  with lambda=.082 (lopt).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4892425      0.5125769
{txt}{space 10}lweight {c |}{col 21}{res}      0.4733331      0.5490809
{txt}{space 13}lbph {c |}{col 21}{res}      0.0245194      0.0721513
{txt}{space 14}svi {c |}{col 21}{res}      0.5257949      0.6496250
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0010786      0.0024450
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.0423852     -0.4136749
{txt}{hline 18}{c BT}{hline 32}
r; t=1.89 12:05:27
{com}.         savedresults comp nosklearn e(),                                                                        ///
>                 exclude(macros: lasso2opt)                                                                              ///
>                 tol(1e-7) verbose
{txt}comparing macro  e(cvmethod)
comparing macro  e(varXmodel)
comparing macro  e(varX)
comparing macro  e(depvar)
comparing macro  e(predict)
comparing macro  e(cmd)
comparing scalar e(mspemin)
comparing scalar e(lse)
comparing scalar e(lopt)
comparing scalar e(alpha)
comparing scalar e(p)
comparing scalar e(nalpha)
comparing scalar e(prestd)
comparing scalar e(partial_ct)
comparing scalar e(notpen_ct)
comparing scalar e(ols)
comparing scalar e(adaptive)
comparing scalar e(sqrt)
comparing scalar e(lcount)
comparing scalar e(lmin)
comparing scalar e(lmax)
comparing scalar e(nfolds)
comparing scalar e(N)
comparing matrix e(cvlower)
comparing matrix e(cvupper)
comparing matrix e(cvsd)
comparing matrix e(mmspe)
comparing matrix e(mspe)
comparing matrix e(lambdamat)
r; t=0.01 12:05:27
{com}. 
.         * load example data
.         webuse air2, clear
{txt}(TIMESLAB: Airline passengers)
r; t=0.44 12:05:28
{com}.         cvlasso air L(1/12).air, rolling origin(130) lglmnet
{txt}Rolling forecasting cross-validation with 1-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (131), 13-131 (132), 13-132 (133), 13-133 (134), 13-134 (135), 13-135 (136), 13-136 (137), 13-137 (138), 13-138 (139), 13-139 (140), 13-140 (141), 13-141 (142), 13-142 (143), 13-143 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 113.95278 {space 3} {res} 32759.166 {space 3} {res} 8602.8095  
{txt}         2{c |} {space 3} {res} 103.82953 {space 3} {res} 27396.865 {space 3} {res} 7183.8904  
{txt}         3{c |} {space 3} {res} 94.605603 {space 3} {res} 22932.242 {space 3} {res}  6003.826  
{txt}         4{c |} {space 3} {res} 86.201102 {space 3} {res}  19214.02 {space 3} {res} 5022.2286  
{txt}         5{c |} {space 3} {res} 78.543233 {space 3} {res} 16116.506 {space 3} {res} 4205.5512  
{txt}         6{c |} {space 3} {res} 71.565669 {space 3} {res} 13535.253 {space 3} {res} 3525.9271  
{txt}         7{c |} {space 3} {res} 65.207972 {space 3} {res} 11383.466 {space 3} {res} 2960.2071  
{txt}         8{c |} {space 3} {res} 59.415076 {space 3} {res} 9589.0102 {space 3} {res} 2489.1594  
{txt}         9{c |} {space 3} {res} 54.136804 {space 3} {res} 8091.9278 {space 3} {res} 2096.8058  
{txt}        10{c |} {space 3} {res}  49.32744 {space 3} {res}  6842.378 {space 3} {res} 1769.8701  
{txt}        11{c |} {space 3} {res} 44.945326 {space 3} {res} 5798.9245 {space 3} {res} 1497.3208  
{txt}        12{c |} {space 3} {res} 40.952507 {space 3} {res} 4927.1137 {space 3} {res} 1269.9904  
{txt}        13{c |} {space 3} {res} 37.314399 {space 3} {res} 4198.2939 {space 3} {res} 1080.2606  
{txt}        14{c |} {space 3} {res} 33.999491 {space 3} {res} 3589.8062 {space 3} {res} 925.29615  
{txt}        15{c |} {space 3} {res}  30.97907 {space 3} {res} 3072.5147 {space 3} {res} 803.52021  
{txt}        16{c |} {space 3} {res} 28.226975 {space 3} {res} 2636.9581 {space 3} {res} 701.05811  
{txt}        17{c |} {space 3} {res} 25.719368 {space 3} {res} 2273.1768 {space 3} {res} 615.55458  
{txt}        18{c |} {space 3} {res}  23.43453 {space 3} {res} 1969.1778 {space 3} {res} 543.98717  
{txt}        19{c |} {space 3} {res} 21.352671 {space 3} {res} 1714.9871 {space 3} {res} 483.86389  
{txt}        20{c |} {space 3} {res} 19.455759 {space 3} {res} 1502.3085 {space 3} {res} 433.13731  
{txt}        21{c |} {space 3} {res} 17.727363 {space 3} {res} 1324.2402 {space 3} {res} 390.13176  
{txt}        22{c |} {space 3} {res} 16.152513 {space 3} {res}  1175.039 {space 3} {res}  353.4813  
{txt}        23{c |} {space 3} {res} 14.717568 {space 3} {res} 1049.9251 {space 3} {res} 322.07648  
{txt}        24{c |} {space 3} {res}   13.4101 {space 3} {res}  944.9196 {space 3} {res} 295.01884  
{txt}        25{c |} {space 3} {res} 12.218783 {space 3} {res} 856.70905 {space 3} {res}  271.5822  
{txt}        26{c |} {space 3} {res}   11.1333 {space 3} {res}  782.9747 {space 3} {res} 251.09892  
{txt}        27{c |} {space 3} {res} 10.144249 {space 3} {res} 720.87345 {space 3} {res} 233.19653  
{txt}        28{c |} {space 3} {res} 9.2430616 {space 3} {res} 666.11692 {space 3} {res}  216.9746  
{txt}        29{c |} {space 3} {res} 8.4219335 {space 3} {res}  618.8794 {space 3} {res}  202.2275  
{txt}        30{c |} {space 3} {res} 7.6737521 {space 3} {res} 578.08357 {space 3} {res} 189.02224  
{txt}        31{c |} {space 3} {res} 6.9920371 {space 3} {res} 543.55168 {space 3} {res} 177.41797  
{txt}        32{c |} {space 3} {res} 6.3708838 {space 3} {res} 514.27908 {space 3} {res} 167.21667  
{txt}        33{c |} {space 3} {res} 5.8049121 {space 3} {res} 489.42647 {space 3} {res} 158.24735  
{txt}        34{c |} {space 3} {res} 5.2892197 {space 3} {res} 468.29226 {space 3} {res} 150.36152  
{txt}        35{c |} {space 3} {res}   4.81934 {space 3} {res} 450.28966 {space 3} {res} 143.42944  ^
{txt}        36{c |} {space 3} {res} 4.3912031 {space 3} {res} 434.92753 {space 3} {res} 137.33727  
{txt}        37{c |} {space 3} {res} 4.0011007 {space 3} {res} 421.79453 {space 3} {res} 131.98471  
{txt}        38{c |} {space 3} {res}  3.645654 {space 3} {res} 410.54587 {space 3} {res} 127.28319  
{txt}        39{c |} {space 3} {res} 3.3217841 {space 3} {res} 400.89232 {space 3} {res} 123.15435  
{txt}        40{c |} {space 3} {res}  3.026686 {space 3} {res}   392.591 {space 3} {res} 119.52881  
{txt}        41{c |} {space 3} {res} 2.7578035 {space 3} {res} 385.43781 {space 3} {res}  116.3452  
{txt}        42{c |} {space 3} {res} 2.5128079 {space 3} {res} 379.26102 {space 3} {res} 113.54924  
{txt}        43{c |} {space 3} {res} 2.2895769 {space 3} {res} 373.91602 {space 3} {res} 111.09302  
{txt}        44{c |} {space 3} {res} 2.0861772 {space 3} {res} 369.28085 {space 3} {res} 108.93431  
{txt}        45{c |} {space 3} {res}  1.900847 {space 3} {res} 365.25255 {space 3} {res} 107.03595  
{txt}        46{c |} {space 3} {res}  1.731981 {space 3} {res} 361.74408 {space 3} {res} 105.36534  
{txt}        47{c |} {space 3} {res} 1.5781166 {space 3} {res} 358.68178 {space 3} {res} 103.89389  
{txt}        48{c |} {space 3} {res}  1.437921 {space 3} {res} 356.00316 {space 3} {res}  102.5966  
{txt}        49{c |} {space 3} {res} 1.3101801 {space 3} {res} 353.65519 {space 3} {res} 101.45163  
{txt}        50{c |} {space 3} {res} 1.1937873 {space 3} {res} 352.50685 {space 3} {res} 100.64934  *
{txt}        51{c |} {space 3} {res} 1.0877345 {space 3} {res} 356.83976 {space 3} {res} 101.26159  
{txt}        52{c |} {space 3} {res}  .9911032 {space 3} {res} 364.02088 {space 3} {res} 102.92767  
{txt}        53{c |} {space 3} {res} .90305632 {space 3} {res} 370.90437 {space 3} {res} 105.19346  
{txt}        54{c |} {space 3} {res} .82283129 {space 3} {res} 372.30569 {space 3} {res} 106.66025  
{txt}        55{c |} {space 3} {res} .74973322 {space 3} {res} 373.75584 {space 3} {res} 108.30098  
{txt}        56{c |} {space 3} {res} .68312899 {space 3} {res} 376.14489 {space 3} {res} 109.93039  
{txt}        57{c |} {space 3} {res} .62244169 {space 3} {res} 379.23972 {space 3} {res} 111.50851  
{txt}        58{c |} {space 3} {res} .56714569 {space 3} {res} 380.57736 {space 3} {res}  112.6518  
{txt}        59{c |} {space 3} {res} .51676203 {space 3} {res} 381.10371 {space 3} {res} 113.83269  
{txt}        60{c |} {space 3} {res} .47085431 {space 3} {res} 381.65622 {space 3} {res} 115.03639  
{txt}        61{c |} {space 3} {res} .42902491 {space 3} {res} 380.60594 {space 3} {res} 115.63453  
{txt}        62{c |} {space 3} {res} .39091152 {space 3} {res}  379.4489 {space 3} {res} 116.03648  
{txt}        63{c |} {space 3} {res} .35618402 {space 3} {res} 380.93282 {space 3} {res} 117.11687  
{txt}        64{c |} {space 3} {res} .32454161 {space 3} {res}  382.4117 {space 3} {res} 117.95338  
{txt}        65{c |} {space 3} {res} .29571023 {space 3} {res} 381.88529 {space 3} {res} 118.32834  
{txt}        66{c |} {space 3} {res} .26944015 {space 3} {res} 379.28013 {space 3} {res} 118.31961  
{txt}        67{c |} {space 3} {res} .24550383 {space 3} {res} 377.40912 {space 3} {res} 118.64324  
{txt}        68{c |} {space 3} {res} .22369395 {space 3} {res} 376.66023 {space 3} {res} 119.09348  
{txt}        69{c |} {space 3} {res} .20382159 {space 3} {res} 376.15548 {space 3} {res} 119.53354  
{txt}        70{c |} {space 3} {res} .18571464 {space 3} {res} 375.12187 {space 3} {res} 120.01658  
{txt}        71{c |} {space 3} {res} .16921627 {space 3} {res} 373.18437 {space 3} {res} 120.19118  
{txt}        72{c |} {space 3} {res} .15418356 {space 3} {res} 372.47464 {space 3} {res} 120.46793  
{txt}        73{c |} {space 3} {res} .14048632 {space 3} {res}  372.6192 {space 3} {res}  120.8496  
{txt}        74{c |} {space 3} {res}  .1280059 {space 3} {res} 374.21435 {space 3} {res}   121.223  
{txt}        75{c |} {space 3} {res} .11663421 {space 3} {res} 377.80976 {space 3} {res} 121.17238  
{txt}        76{c |} {space 3} {res} .10627275 {space 3} {res} 382.23213 {space 3} {res} 120.99175  
{txt}        77{c |} {space 3} {res} .09683177 {space 3} {res} 386.17951 {space 3} {res} 120.77563  
{txt}        78{c |} {space 3} {res}  .0882295 {space 3} {res} 389.39199 {space 3} {res} 120.33265  
{txt}        79{c |} {space 3} {res} .08039144 {space 3} {res} 392.68466 {space 3} {res} 120.07222  
{txt}        80{c |} {space 3} {res} .07324968 {space 3} {res} 397.26264 {space 3} {res} 120.51452  
{txt}        81{c |} {space 3} {res} .06674238 {space 3} {res} 403.46111 {space 3} {res} 121.31889  
{txt}        82{c |} {space 3} {res} .06081317 {space 3} {res} 413.08026 {space 3} {res}  121.8094  
{txt}        83{c |} {space 3} {res}  .0554107 {space 3} {res} 421.58256 {space 3} {res} 121.40802  
{txt}        84{c |} {space 3} {res} .05048816 {space 3} {res} 427.33017 {space 3} {res} 120.11069  
{txt}        85{c |} {space 3} {res} .04600294 {space 3} {res} 431.32963 {space 3} {res} 118.94941  
{txt}        86{c |} {space 3} {res} .04191616 {space 3} {res} 433.96907 {space 3} {res} 117.98959  
{txt}        87{c |} {space 3} {res} .03819245 {space 3} {res} 436.77314 {space 3} {res} 117.32436  
{txt}        88{c |} {space 3} {res} .03479953 {space 3} {res} 439.65945 {space 3} {res} 116.89027  
{txt}        89{c |} {space 3} {res} .03170804 {space 3} {res} 442.56444 {space 3} {res} 116.63575  
{txt}        90{c |} {space 3} {res} .02889118 {space 3} {res} 445.43974 {space 3} {res}  116.5192  
{txt}        91{c |} {space 3} {res} .02632457 {space 3} {res} 448.24922 {space 3} {res} 116.50728  
{txt}        92{c |} {space 3} {res} .02398597 {space 3} {res} 450.96653 {space 3} {res} 116.57341  
{txt}        93{c |} {space 3} {res} .02185512 {space 3} {res} 453.57313 {space 3} {res} 116.69652  
{txt}        94{c |} {space 3} {res} .01991357 {space 3} {res} 456.05667 {space 3} {res} 116.86002  
{txt}        95{c |} {space 3} {res} .01814451 {space 3} {res} 458.40966 {space 3} {res} 117.05094  
{txt}        96{c |} {space 3} {res}  .0165326 {space 3} {res}  460.6284 {space 3} {res} 117.25916  
{txt}        97{c |} {space 3} {res} .01506389 {space 3} {res} 462.71212 {space 3} {res} 117.47693  
{txt}        98{c |} {space 3} {res} .01372565 {space 3} {res} 464.66228 {space 3} {res} 117.69829  
{txt}        99{c |} {space 3} {res}  .0125063 {space 3} {res} 466.48198 {space 3} {res} 117.91878  
{txt}       100{c |} {space 3} {res} .01139528 {space 3} {res} 468.17556 {space 3} {res}  118.1351  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=22.96 12:05:51
{com}.         savedresults save nosklearn e()
{txt}r; t=0.01 12:05:51
{com}.         cvlasso air L(1/12).air, rolling origin(130) lglmnet sklearn
{txt}Rolling forecasting cross-validation with 1-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (131), 13-131 (132), 13-132 (133), 13-133 (134), 13-134 (135), 13-135 (136), 13-136 (137), 13-137 (138), 13-138 (139), 13-139 (140), 13-140 (141), 13-141 (142), 13-142 (143), 13-143 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 113.95278 {space 3} {res} 32759.166 {space 3} {res} 8602.8095  
{txt}         2{c |} {space 3} {res} 103.82953 {space 3} {res} 27396.865 {space 3} {res} 7183.8904  
{txt}         3{c |} {space 3} {res} 94.605603 {space 3} {res} 22932.242 {space 3} {res}  6003.826  
{txt}         4{c |} {space 3} {res} 86.201102 {space 3} {res}  19214.02 {space 3} {res} 5022.2286  
{txt}         5{c |} {space 3} {res} 78.543233 {space 3} {res} 16116.506 {space 3} {res} 4205.5512  
{txt}         6{c |} {space 3} {res} 71.565669 {space 3} {res} 13535.253 {space 3} {res} 3525.9271  
{txt}         7{c |} {space 3} {res} 65.207972 {space 3} {res} 11383.466 {space 3} {res} 2960.2071  
{txt}         8{c |} {space 3} {res} 59.415076 {space 3} {res} 9589.0102 {space 3} {res} 2489.1594  
{txt}         9{c |} {space 3} {res} 54.136804 {space 3} {res} 8091.9278 {space 3} {res} 2096.8058  
{txt}        10{c |} {space 3} {res}  49.32744 {space 3} {res}  6842.378 {space 3} {res} 1769.8701  
{txt}        11{c |} {space 3} {res} 44.945326 {space 3} {res} 5798.9245 {space 3} {res} 1497.3208  
{txt}        12{c |} {space 3} {res} 40.952507 {space 3} {res} 4927.1137 {space 3} {res} 1269.9904  
{txt}        13{c |} {space 3} {res} 37.314399 {space 3} {res} 4198.2939 {space 3} {res} 1080.2606  
{txt}        14{c |} {space 3} {res} 33.999491 {space 3} {res} 3589.8062 {space 3} {res} 925.29615  
{txt}        15{c |} {space 3} {res}  30.97907 {space 3} {res} 3072.5147 {space 3} {res} 803.52021  
{txt}        16{c |} {space 3} {res} 28.226975 {space 3} {res} 2636.9581 {space 3} {res} 701.05811  
{txt}        17{c |} {space 3} {res} 25.719368 {space 3} {res} 2273.1768 {space 3} {res} 615.55458  
{txt}        18{c |} {space 3} {res}  23.43453 {space 3} {res} 1969.1778 {space 3} {res} 543.98717  
{txt}        19{c |} {space 3} {res} 21.352671 {space 3} {res} 1714.9871 {space 3} {res} 483.86389  
{txt}        20{c |} {space 3} {res} 19.455759 {space 3} {res} 1502.3085 {space 3} {res} 433.13731  
{txt}        21{c |} {space 3} {res} 17.727363 {space 3} {res} 1324.2402 {space 3} {res} 390.13176  
{txt}        22{c |} {space 3} {res} 16.152513 {space 3} {res}  1175.039 {space 3} {res}  353.4813  
{txt}        23{c |} {space 3} {res} 14.717568 {space 3} {res} 1049.9251 {space 3} {res} 322.07648  
{txt}        24{c |} {space 3} {res}   13.4101 {space 3} {res}  944.9196 {space 3} {res} 295.01884  
{txt}        25{c |} {space 3} {res} 12.218783 {space 3} {res} 856.70905 {space 3} {res}  271.5822  
{txt}        26{c |} {space 3} {res}   11.1333 {space 3} {res}  782.9747 {space 3} {res} 251.09892  
{txt}        27{c |} {space 3} {res} 10.144249 {space 3} {res} 720.87345 {space 3} {res} 233.19653  
{txt}        28{c |} {space 3} {res} 9.2430616 {space 3} {res} 666.11692 {space 3} {res}  216.9746  
{txt}        29{c |} {space 3} {res} 8.4219335 {space 3} {res}  618.8794 {space 3} {res}  202.2275  
{txt}        30{c |} {space 3} {res} 7.6737521 {space 3} {res} 578.08357 {space 3} {res} 189.02224  
{txt}        31{c |} {space 3} {res} 6.9920371 {space 3} {res} 543.55168 {space 3} {res} 177.41797  
{txt}        32{c |} {space 3} {res} 6.3708838 {space 3} {res} 514.27909 {space 3} {res} 167.21667  
{txt}        33{c |} {space 3} {res} 5.8049121 {space 3} {res} 489.42647 {space 3} {res} 158.24735  
{txt}        34{c |} {space 3} {res} 5.2892197 {space 3} {res} 468.29226 {space 3} {res} 150.36152  
{txt}        35{c |} {space 3} {res}   4.81934 {space 3} {res} 450.28966 {space 3} {res} 143.42944  ^
{txt}        36{c |} {space 3} {res} 4.3912031 {space 3} {res} 434.92753 {space 3} {res} 137.33727  
{txt}        37{c |} {space 3} {res} 4.0011007 {space 3} {res} 421.79453 {space 3} {res} 131.98471  
{txt}        38{c |} {space 3} {res}  3.645654 {space 3} {res} 410.54588 {space 3} {res} 127.28319  
{txt}        39{c |} {space 3} {res} 3.3217841 {space 3} {res} 400.89232 {space 3} {res} 123.15435  
{txt}        40{c |} {space 3} {res}  3.026686 {space 3} {res}   392.591 {space 3} {res} 119.52881  
{txt}        41{c |} {space 3} {res} 2.7578035 {space 3} {res} 385.43781 {space 3} {res}  116.3452  
{txt}        42{c |} {space 3} {res} 2.5128079 {space 3} {res} 379.26102 {space 3} {res} 113.54924  
{txt}        43{c |} {space 3} {res} 2.2895769 {space 3} {res} 373.91602 {space 3} {res} 111.09302  
{txt}        44{c |} {space 3} {res} 2.0861772 {space 3} {res} 369.28085 {space 3} {res} 108.93431  
{txt}        45{c |} {space 3} {res}  1.900847 {space 3} {res} 365.25255 {space 3} {res} 107.03595  
{txt}        46{c |} {space 3} {res}  1.731981 {space 3} {res} 361.74408 {space 3} {res} 105.36534  
{txt}        47{c |} {space 3} {res} 1.5781166 {space 3} {res} 358.68178 {space 3} {res} 103.89389  
{txt}        48{c |} {space 3} {res}  1.437921 {space 3} {res} 356.00316 {space 3} {res}  102.5966  
{txt}        49{c |} {space 3} {res} 1.3101801 {space 3} {res} 353.65519 {space 3} {res} 101.45163  
{txt}        50{c |} {space 3} {res} 1.1937873 {space 3} {res} 352.50685 {space 3} {res} 100.64934  *
{txt}        51{c |} {space 3} {res} 1.0877345 {space 3} {res} 356.83976 {space 3} {res} 101.26159  
{txt}        52{c |} {space 3} {res}  .9911032 {space 3} {res} 364.02087 {space 3} {res} 102.92767  
{txt}        53{c |} {space 3} {res} .90305632 {space 3} {res} 370.90437 {space 3} {res} 105.19346  
{txt}        54{c |} {space 3} {res} .82283129 {space 3} {res} 372.30569 {space 3} {res} 106.66025  
{txt}        55{c |} {space 3} {res} .74973322 {space 3} {res} 373.75584 {space 3} {res} 108.30098  
{txt}        56{c |} {space 3} {res} .68312899 {space 3} {res} 376.14489 {space 3} {res} 109.93039  
{txt}        57{c |} {space 3} {res} .62244169 {space 3} {res} 379.23972 {space 3} {res} 111.50851  
{txt}        58{c |} {space 3} {res} .56714569 {space 3} {res} 380.57736 {space 3} {res}  112.6518  
{txt}        59{c |} {space 3} {res} .51676203 {space 3} {res} 381.10371 {space 3} {res} 113.83269  
{txt}        60{c |} {space 3} {res} .47085431 {space 3} {res} 381.65622 {space 3} {res} 115.03639  
{txt}        61{c |} {space 3} {res} .42902491 {space 3} {res} 380.60594 {space 3} {res} 115.63453  
{txt}        62{c |} {space 3} {res} .39091152 {space 3} {res}  379.4489 {space 3} {res} 116.03648  
{txt}        63{c |} {space 3} {res} .35618402 {space 3} {res} 380.93282 {space 3} {res} 117.11687  
{txt}        64{c |} {space 3} {res} .32454161 {space 3} {res}  382.4117 {space 3} {res} 117.95338  
{txt}        65{c |} {space 3} {res} .29571023 {space 3} {res} 381.88529 {space 3} {res} 118.32834  
{txt}        66{c |} {space 3} {res} .26944015 {space 3} {res} 379.28013 {space 3} {res} 118.31961  
{txt}        67{c |} {space 3} {res} .24550383 {space 3} {res} 377.40912 {space 3} {res} 118.64324  
{txt}        68{c |} {space 3} {res} .22369395 {space 3} {res} 376.66024 {space 3} {res} 119.09348  
{txt}        69{c |} {space 3} {res} .20382159 {space 3} {res} 376.15548 {space 3} {res} 119.53354  
{txt}        70{c |} {space 3} {res} .18571464 {space 3} {res} 375.12187 {space 3} {res} 120.01658  
{txt}        71{c |} {space 3} {res} .16921627 {space 3} {res} 373.18437 {space 3} {res} 120.19118  
{txt}        72{c |} {space 3} {res} .15418356 {space 3} {res} 372.47464 {space 3} {res} 120.46793  
{txt}        73{c |} {space 3} {res} .14048632 {space 3} {res}  372.6192 {space 3} {res}  120.8496  
{txt}        74{c |} {space 3} {res}  .1280059 {space 3} {res} 374.21435 {space 3} {res}   121.223  
{txt}        75{c |} {space 3} {res} .11663421 {space 3} {res} 377.80975 {space 3} {res} 121.17238  
{txt}        76{c |} {space 3} {res} .10627275 {space 3} {res} 382.23213 {space 3} {res} 120.99175  
{txt}        77{c |} {space 3} {res} .09683177 {space 3} {res} 386.17951 {space 3} {res} 120.77563  
{txt}        78{c |} {space 3} {res}  .0882295 {space 3} {res} 389.39199 {space 3} {res} 120.33265  
{txt}        79{c |} {space 3} {res} .08039144 {space 3} {res} 392.68466 {space 3} {res} 120.07222  
{txt}        80{c |} {space 3} {res} .07324968 {space 3} {res} 397.26264 {space 3} {res} 120.51452  
{txt}        81{c |} {space 3} {res} .06674238 {space 3} {res}  403.4611 {space 3} {res} 121.31889  
{txt}        82{c |} {space 3} {res} .06081317 {space 3} {res} 413.08025 {space 3} {res}  121.8094  
{txt}        83{c |} {space 3} {res}  .0554107 {space 3} {res} 421.58255 {space 3} {res} 121.40802  
{txt}        84{c |} {space 3} {res} .05048816 {space 3} {res} 427.33017 {space 3} {res}  120.1107  
{txt}        85{c |} {space 3} {res} .04600294 {space 3} {res} 431.32962 {space 3} {res} 118.94941  
{txt}        86{c |} {space 3} {res} .04191616 {space 3} {res} 433.96906 {space 3} {res} 117.98959  
{txt}        87{c |} {space 3} {res} .03819245 {space 3} {res} 436.77313 {space 3} {res} 117.32436  
{txt}        88{c |} {space 3} {res} .03479953 {space 3} {res} 439.65944 {space 3} {res} 116.89027  
{txt}        89{c |} {space 3} {res} .03170804 {space 3} {res} 442.56443 {space 3} {res} 116.63575  
{txt}        90{c |} {space 3} {res} .02889118 {space 3} {res} 445.43973 {space 3} {res}  116.5192  
{txt}        91{c |} {space 3} {res} .02632457 {space 3} {res} 448.24921 {space 3} {res} 116.50728  
{txt}        92{c |} {space 3} {res} .02398597 {space 3} {res} 450.96652 {space 3} {res} 116.57341  
{txt}        93{c |} {space 3} {res} .02185512 {space 3} {res} 453.57312 {space 3} {res} 116.69652  
{txt}        94{c |} {space 3} {res} .01991357 {space 3} {res} 456.05666 {space 3} {res} 116.86002  
{txt}        95{c |} {space 3} {res} .01814451 {space 3} {res} 458.40965 {space 3} {res} 117.05094  
{txt}        96{c |} {space 3} {res}  .0165326 {space 3} {res} 460.62839 {space 3} {res} 117.25916  
{txt}        97{c |} {space 3} {res} .01506389 {space 3} {res} 462.71211 {space 3} {res} 117.47692  
{txt}        98{c |} {space 3} {res} .01372565 {space 3} {res} 464.66227 {space 3} {res} 117.69829  
{txt}        99{c |} {space 3} {res}  .0125063 {space 3} {res} 466.48198 {space 3} {res} 117.91878  
{txt}       100{c |} {space 3} {res} .01139528 {space 3} {res} 468.17556 {space 3} {res}  118.1351  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=3.13 12:05:54
{com}.         // note slightly looser tolerance
.         savedresults comp nosklearn e(),                                                                        ///
>                 exclude(macros: lasso2opt)                                                                              ///
>                 tol(1e-6) verbose
{txt}comparing macro  e(cvmethod)
comparing macro  e(varXmodel)
comparing macro  e(varX)
comparing macro  e(depvar)
comparing macro  e(predict)
comparing macro  e(cmd)
comparing scalar e(N)
comparing scalar e(nfolds)
comparing scalar e(lmax)
comparing scalar e(lmin)
comparing scalar e(lcount)
comparing scalar e(sqrt)
comparing scalar e(adaptive)
comparing scalar e(ols)
comparing scalar e(notpen_ct)
comparing scalar e(partial_ct)
comparing scalar e(prestd)
comparing scalar e(nalpha)
comparing scalar e(p)
comparing scalar e(alpha)
comparing scalar e(lopt)
comparing scalar e(lse)
comparing scalar e(mspemin)
comparing scalar e(h)
comparing scalar e(origin)
comparing matrix e(cvlower)
comparing matrix e(cvupper)
comparing matrix e(cvsd)
comparing matrix e(mmspe)
comparing matrix e(mspe)
comparing matrix e(lambdamat)
r; t=0.00 12:05:54
{com}.         // now with lopt
.         cvlasso air L(1/12).air, rolling origin(130) lglmnet lopt
{txt}Rolling forecasting cross-validation with 1-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (131), 13-131 (132), 13-132 (133), 13-133 (134), 13-134 (135), 13-135 (136), 13-136 (137), 13-137 (138), 13-138 (139), 13-139 (140), 13-140 (141), 13-141 (142), 13-142 (143), 13-143 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 113.95278 {space 3} {res} 32759.166 {space 3} {res} 8602.8095  
{txt}         2{c |} {space 3} {res} 103.82953 {space 3} {res} 27396.865 {space 3} {res} 7183.8904  
{txt}         3{c |} {space 3} {res} 94.605603 {space 3} {res} 22932.242 {space 3} {res}  6003.826  
{txt}         4{c |} {space 3} {res} 86.201102 {space 3} {res}  19214.02 {space 3} {res} 5022.2286  
{txt}         5{c |} {space 3} {res} 78.543233 {space 3} {res} 16116.506 {space 3} {res} 4205.5512  
{txt}         6{c |} {space 3} {res} 71.565669 {space 3} {res} 13535.253 {space 3} {res} 3525.9271  
{txt}         7{c |} {space 3} {res} 65.207972 {space 3} {res} 11383.466 {space 3} {res} 2960.2071  
{txt}         8{c |} {space 3} {res} 59.415076 {space 3} {res} 9589.0102 {space 3} {res} 2489.1594  
{txt}         9{c |} {space 3} {res} 54.136804 {space 3} {res} 8091.9278 {space 3} {res} 2096.8058  
{txt}        10{c |} {space 3} {res}  49.32744 {space 3} {res}  6842.378 {space 3} {res} 1769.8701  
{txt}        11{c |} {space 3} {res} 44.945326 {space 3} {res} 5798.9245 {space 3} {res} 1497.3208  
{txt}        12{c |} {space 3} {res} 40.952507 {space 3} {res} 4927.1137 {space 3} {res} 1269.9904  
{txt}        13{c |} {space 3} {res} 37.314399 {space 3} {res} 4198.2939 {space 3} {res} 1080.2606  
{txt}        14{c |} {space 3} {res} 33.999491 {space 3} {res} 3589.8062 {space 3} {res} 925.29615  
{txt}        15{c |} {space 3} {res}  30.97907 {space 3} {res} 3072.5147 {space 3} {res} 803.52021  
{txt}        16{c |} {space 3} {res} 28.226975 {space 3} {res} 2636.9581 {space 3} {res} 701.05811  
{txt}        17{c |} {space 3} {res} 25.719368 {space 3} {res} 2273.1768 {space 3} {res} 615.55458  
{txt}        18{c |} {space 3} {res}  23.43453 {space 3} {res} 1969.1778 {space 3} {res} 543.98717  
{txt}        19{c |} {space 3} {res} 21.352671 {space 3} {res} 1714.9871 {space 3} {res} 483.86389  
{txt}        20{c |} {space 3} {res} 19.455759 {space 3} {res} 1502.3085 {space 3} {res} 433.13731  
{txt}        21{c |} {space 3} {res} 17.727363 {space 3} {res} 1324.2402 {space 3} {res} 390.13176  
{txt}        22{c |} {space 3} {res} 16.152513 {space 3} {res}  1175.039 {space 3} {res}  353.4813  
{txt}        23{c |} {space 3} {res} 14.717568 {space 3} {res} 1049.9251 {space 3} {res} 322.07648  
{txt}        24{c |} {space 3} {res}   13.4101 {space 3} {res}  944.9196 {space 3} {res} 295.01884  
{txt}        25{c |} {space 3} {res} 12.218783 {space 3} {res} 856.70905 {space 3} {res}  271.5822  
{txt}        26{c |} {space 3} {res}   11.1333 {space 3} {res}  782.9747 {space 3} {res} 251.09892  
{txt}        27{c |} {space 3} {res} 10.144249 {space 3} {res} 720.87345 {space 3} {res} 233.19653  
{txt}        28{c |} {space 3} {res} 9.2430616 {space 3} {res} 666.11692 {space 3} {res}  216.9746  
{txt}        29{c |} {space 3} {res} 8.4219335 {space 3} {res}  618.8794 {space 3} {res}  202.2275  
{txt}        30{c |} {space 3} {res} 7.6737521 {space 3} {res} 578.08357 {space 3} {res} 189.02224  
{txt}        31{c |} {space 3} {res} 6.9920371 {space 3} {res} 543.55168 {space 3} {res} 177.41797  
{txt}        32{c |} {space 3} {res} 6.3708838 {space 3} {res} 514.27908 {space 3} {res} 167.21667  
{txt}        33{c |} {space 3} {res} 5.8049121 {space 3} {res} 489.42647 {space 3} {res} 158.24735  
{txt}        34{c |} {space 3} {res} 5.2892197 {space 3} {res} 468.29226 {space 3} {res} 150.36152  
{txt}        35{c |} {space 3} {res}   4.81934 {space 3} {res} 450.28966 {space 3} {res} 143.42944  ^
{txt}        36{c |} {space 3} {res} 4.3912031 {space 3} {res} 434.92753 {space 3} {res} 137.33727  
{txt}        37{c |} {space 3} {res} 4.0011007 {space 3} {res} 421.79453 {space 3} {res} 131.98471  
{txt}        38{c |} {space 3} {res}  3.645654 {space 3} {res} 410.54587 {space 3} {res} 127.28319  
{txt}        39{c |} {space 3} {res} 3.3217841 {space 3} {res} 400.89232 {space 3} {res} 123.15435  
{txt}        40{c |} {space 3} {res}  3.026686 {space 3} {res}   392.591 {space 3} {res} 119.52881  
{txt}        41{c |} {space 3} {res} 2.7578035 {space 3} {res} 385.43781 {space 3} {res}  116.3452  
{txt}        42{c |} {space 3} {res} 2.5128079 {space 3} {res} 379.26102 {space 3} {res} 113.54924  
{txt}        43{c |} {space 3} {res} 2.2895769 {space 3} {res} 373.91602 {space 3} {res} 111.09302  
{txt}        44{c |} {space 3} {res} 2.0861772 {space 3} {res} 369.28085 {space 3} {res} 108.93431  
{txt}        45{c |} {space 3} {res}  1.900847 {space 3} {res} 365.25255 {space 3} {res} 107.03595  
{txt}        46{c |} {space 3} {res}  1.731981 {space 3} {res} 361.74408 {space 3} {res} 105.36534  
{txt}        47{c |} {space 3} {res} 1.5781166 {space 3} {res} 358.68178 {space 3} {res} 103.89389  
{txt}        48{c |} {space 3} {res}  1.437921 {space 3} {res} 356.00316 {space 3} {res}  102.5966  
{txt}        49{c |} {space 3} {res} 1.3101801 {space 3} {res} 353.65519 {space 3} {res} 101.45163  
{txt}        50{c |} {space 3} {res} 1.1937873 {space 3} {res} 352.50685 {space 3} {res} 100.64934  *
{txt}        51{c |} {space 3} {res} 1.0877345 {space 3} {res} 356.83976 {space 3} {res} 101.26159  
{txt}        52{c |} {space 3} {res}  .9911032 {space 3} {res} 364.02088 {space 3} {res} 102.92767  
{txt}        53{c |} {space 3} {res} .90305632 {space 3} {res} 370.90437 {space 3} {res} 105.19346  
{txt}        54{c |} {space 3} {res} .82283129 {space 3} {res} 372.30569 {space 3} {res} 106.66025  
{txt}        55{c |} {space 3} {res} .74973322 {space 3} {res} 373.75584 {space 3} {res} 108.30098  
{txt}        56{c |} {space 3} {res} .68312899 {space 3} {res} 376.14489 {space 3} {res} 109.93039  
{txt}        57{c |} {space 3} {res} .62244169 {space 3} {res} 379.23972 {space 3} {res} 111.50851  
{txt}        58{c |} {space 3} {res} .56714569 {space 3} {res} 380.57736 {space 3} {res}  112.6518  
{txt}        59{c |} {space 3} {res} .51676203 {space 3} {res} 381.10371 {space 3} {res} 113.83269  
{txt}        60{c |} {space 3} {res} .47085431 {space 3} {res} 381.65622 {space 3} {res} 115.03639  
{txt}        61{c |} {space 3} {res} .42902491 {space 3} {res} 380.60594 {space 3} {res} 115.63453  
{txt}        62{c |} {space 3} {res} .39091152 {space 3} {res}  379.4489 {space 3} {res} 116.03648  
{txt}        63{c |} {space 3} {res} .35618402 {space 3} {res} 380.93282 {space 3} {res} 117.11687  
{txt}        64{c |} {space 3} {res} .32454161 {space 3} {res}  382.4117 {space 3} {res} 117.95338  
{txt}        65{c |} {space 3} {res} .29571023 {space 3} {res} 381.88529 {space 3} {res} 118.32834  
{txt}        66{c |} {space 3} {res} .26944015 {space 3} {res} 379.28013 {space 3} {res} 118.31961  
{txt}        67{c |} {space 3} {res} .24550383 {space 3} {res} 377.40912 {space 3} {res} 118.64324  
{txt}        68{c |} {space 3} {res} .22369395 {space 3} {res} 376.66023 {space 3} {res} 119.09348  
{txt}        69{c |} {space 3} {res} .20382159 {space 3} {res} 376.15548 {space 3} {res} 119.53354  
{txt}        70{c |} {space 3} {res} .18571464 {space 3} {res} 375.12187 {space 3} {res} 120.01658  
{txt}        71{c |} {space 3} {res} .16921627 {space 3} {res} 373.18437 {space 3} {res} 120.19118  
{txt}        72{c |} {space 3} {res} .15418356 {space 3} {res} 372.47464 {space 3} {res} 120.46793  
{txt}        73{c |} {space 3} {res} .14048632 {space 3} {res}  372.6192 {space 3} {res}  120.8496  
{txt}        74{c |} {space 3} {res}  .1280059 {space 3} {res} 374.21435 {space 3} {res}   121.223  
{txt}        75{c |} {space 3} {res} .11663421 {space 3} {res} 377.80976 {space 3} {res} 121.17238  
{txt}        76{c |} {space 3} {res} .10627275 {space 3} {res} 382.23213 {space 3} {res} 120.99175  
{txt}        77{c |} {space 3} {res} .09683177 {space 3} {res} 386.17951 {space 3} {res} 120.77563  
{txt}        78{c |} {space 3} {res}  .0882295 {space 3} {res} 389.39199 {space 3} {res} 120.33265  
{txt}        79{c |} {space 3} {res} .08039144 {space 3} {res} 392.68466 {space 3} {res} 120.07222  
{txt}        80{c |} {space 3} {res} .07324968 {space 3} {res} 397.26264 {space 3} {res} 120.51452  
{txt}        81{c |} {space 3} {res} .06674238 {space 3} {res} 403.46111 {space 3} {res} 121.31889  
{txt}        82{c |} {space 3} {res} .06081317 {space 3} {res} 413.08026 {space 3} {res}  121.8094  
{txt}        83{c |} {space 3} {res}  .0554107 {space 3} {res} 421.58256 {space 3} {res} 121.40802  
{txt}        84{c |} {space 3} {res} .05048816 {space 3} {res} 427.33017 {space 3} {res} 120.11069  
{txt}        85{c |} {space 3} {res} .04600294 {space 3} {res} 431.32963 {space 3} {res} 118.94941  
{txt}        86{c |} {space 3} {res} .04191616 {space 3} {res} 433.96907 {space 3} {res} 117.98959  
{txt}        87{c |} {space 3} {res} .03819245 {space 3} {res} 436.77314 {space 3} {res} 117.32436  
{txt}        88{c |} {space 3} {res} .03479953 {space 3} {res} 439.65945 {space 3} {res} 116.89027  
{txt}        89{c |} {space 3} {res} .03170804 {space 3} {res} 442.56444 {space 3} {res} 116.63575  
{txt}        90{c |} {space 3} {res} .02889118 {space 3} {res} 445.43974 {space 3} {res}  116.5192  
{txt}        91{c |} {space 3} {res} .02632457 {space 3} {res} 448.24922 {space 3} {res} 116.50728  
{txt}        92{c |} {space 3} {res} .02398597 {space 3} {res} 450.96653 {space 3} {res} 116.57341  
{txt}        93{c |} {space 3} {res} .02185512 {space 3} {res} 453.57313 {space 3} {res} 116.69652  
{txt}        94{c |} {space 3} {res} .01991357 {space 3} {res} 456.05667 {space 3} {res} 116.86002  
{txt}        95{c |} {space 3} {res} .01814451 {space 3} {res} 458.40966 {space 3} {res} 117.05094  
{txt}        96{c |} {space 3} {res}  .0165326 {space 3} {res}  460.6284 {space 3} {res} 117.25916  
{txt}        97{c |} {space 3} {res} .01506389 {space 3} {res} 462.71212 {space 3} {res} 117.47693  
{txt}        98{c |} {space 3} {res} .01372565 {space 3} {res} 464.66228 {space 3} {res} 117.69829  
{txt}        99{c |} {space 3} {res}  .0125063 {space 3} {res} 466.48198 {space 3} {res} 117.91878  
{txt}       100{c |} {space 3} {res} .01139528 {space 3} {res} 468.17556 {space 3} {res}  118.1351  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
Estimate  with lambda=1.194 (lopt).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 14}air {c |}
{space 14}L1. {c |}{col 21}{res}      0.1534004      0.1610229
{txt}{space 13}L11. {c |}{col 21}{res}      0.0638066      0.0724006
{txt}{space 13}L12. {c |}{col 21}{res}      0.8422566      0.8374074
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 17} {c |}
{space 12}_cons {c |}{col 21}{res}     11.5075093      8.2797832
{txt}{hline 18}{c BT}{hline 32}
r; t=22.28 12:06:16
{com}.         savedresults save nosklearn e()
{txt}r; t=0.00 12:06:16
{com}.         cvlasso air L(1/12).air, rolling origin(130) lglmnet lopt sklearn
{txt}Rolling forecasting cross-validation with 1-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (131), 13-131 (132), 13-132 (133), 13-133 (134), 13-134 (135), 13-135 (136), 13-136 (137), 13-137 (138), 13-138 (139), 13-139 (140), 13-140 (141), 13-141 (142), 13-142 (143), 13-143 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 113.95278 {space 3} {res} 32759.166 {space 3} {res} 8602.8095  
{txt}         2{c |} {space 3} {res} 103.82953 {space 3} {res} 27396.865 {space 3} {res} 7183.8904  
{txt}         3{c |} {space 3} {res} 94.605603 {space 3} {res} 22932.242 {space 3} {res}  6003.826  
{txt}         4{c |} {space 3} {res} 86.201102 {space 3} {res}  19214.02 {space 3} {res} 5022.2286  
{txt}         5{c |} {space 3} {res} 78.543233 {space 3} {res} 16116.506 {space 3} {res} 4205.5512  
{txt}         6{c |} {space 3} {res} 71.565669 {space 3} {res} 13535.253 {space 3} {res} 3525.9271  
{txt}         7{c |} {space 3} {res} 65.207972 {space 3} {res} 11383.466 {space 3} {res} 2960.2071  
{txt}         8{c |} {space 3} {res} 59.415076 {space 3} {res} 9589.0102 {space 3} {res} 2489.1594  
{txt}         9{c |} {space 3} {res} 54.136804 {space 3} {res} 8091.9278 {space 3} {res} 2096.8058  
{txt}        10{c |} {space 3} {res}  49.32744 {space 3} {res}  6842.378 {space 3} {res} 1769.8701  
{txt}        11{c |} {space 3} {res} 44.945326 {space 3} {res} 5798.9245 {space 3} {res} 1497.3208  
{txt}        12{c |} {space 3} {res} 40.952507 {space 3} {res} 4927.1137 {space 3} {res} 1269.9904  
{txt}        13{c |} {space 3} {res} 37.314399 {space 3} {res} 4198.2939 {space 3} {res} 1080.2606  
{txt}        14{c |} {space 3} {res} 33.999491 {space 3} {res} 3589.8062 {space 3} {res} 925.29615  
{txt}        15{c |} {space 3} {res}  30.97907 {space 3} {res} 3072.5147 {space 3} {res} 803.52021  
{txt}        16{c |} {space 3} {res} 28.226975 {space 3} {res} 2636.9581 {space 3} {res} 701.05811  
{txt}        17{c |} {space 3} {res} 25.719368 {space 3} {res} 2273.1768 {space 3} {res} 615.55458  
{txt}        18{c |} {space 3} {res}  23.43453 {space 3} {res} 1969.1778 {space 3} {res} 543.98717  
{txt}        19{c |} {space 3} {res} 21.352671 {space 3} {res} 1714.9871 {space 3} {res} 483.86389  
{txt}        20{c |} {space 3} {res} 19.455759 {space 3} {res} 1502.3085 {space 3} {res} 433.13731  
{txt}        21{c |} {space 3} {res} 17.727363 {space 3} {res} 1324.2402 {space 3} {res} 390.13176  
{txt}        22{c |} {space 3} {res} 16.152513 {space 3} {res}  1175.039 {space 3} {res}  353.4813  
{txt}        23{c |} {space 3} {res} 14.717568 {space 3} {res} 1049.9251 {space 3} {res} 322.07648  
{txt}        24{c |} {space 3} {res}   13.4101 {space 3} {res}  944.9196 {space 3} {res} 295.01884  
{txt}        25{c |} {space 3} {res} 12.218783 {space 3} {res} 856.70905 {space 3} {res}  271.5822  
{txt}        26{c |} {space 3} {res}   11.1333 {space 3} {res}  782.9747 {space 3} {res} 251.09892  
{txt}        27{c |} {space 3} {res} 10.144249 {space 3} {res} 720.87345 {space 3} {res} 233.19653  
{txt}        28{c |} {space 3} {res} 9.2430616 {space 3} {res} 666.11692 {space 3} {res}  216.9746  
{txt}        29{c |} {space 3} {res} 8.4219335 {space 3} {res}  618.8794 {space 3} {res}  202.2275  
{txt}        30{c |} {space 3} {res} 7.6737521 {space 3} {res} 578.08357 {space 3} {res} 189.02224  
{txt}        31{c |} {space 3} {res} 6.9920371 {space 3} {res} 543.55168 {space 3} {res} 177.41797  
{txt}        32{c |} {space 3} {res} 6.3708838 {space 3} {res} 514.27909 {space 3} {res} 167.21667  
{txt}        33{c |} {space 3} {res} 5.8049121 {space 3} {res} 489.42647 {space 3} {res} 158.24735  
{txt}        34{c |} {space 3} {res} 5.2892197 {space 3} {res} 468.29226 {space 3} {res} 150.36152  
{txt}        35{c |} {space 3} {res}   4.81934 {space 3} {res} 450.28966 {space 3} {res} 143.42944  ^
{txt}        36{c |} {space 3} {res} 4.3912031 {space 3} {res} 434.92753 {space 3} {res} 137.33727  
{txt}        37{c |} {space 3} {res} 4.0011007 {space 3} {res} 421.79453 {space 3} {res} 131.98471  
{txt}        38{c |} {space 3} {res}  3.645654 {space 3} {res} 410.54588 {space 3} {res} 127.28319  
{txt}        39{c |} {space 3} {res} 3.3217841 {space 3} {res} 400.89232 {space 3} {res} 123.15435  
{txt}        40{c |} {space 3} {res}  3.026686 {space 3} {res}   392.591 {space 3} {res} 119.52881  
{txt}        41{c |} {space 3} {res} 2.7578035 {space 3} {res} 385.43781 {space 3} {res}  116.3452  
{txt}        42{c |} {space 3} {res} 2.5128079 {space 3} {res} 379.26102 {space 3} {res} 113.54924  
{txt}        43{c |} {space 3} {res} 2.2895769 {space 3} {res} 373.91602 {space 3} {res} 111.09302  
{txt}        44{c |} {space 3} {res} 2.0861772 {space 3} {res} 369.28085 {space 3} {res} 108.93431  
{txt}        45{c |} {space 3} {res}  1.900847 {space 3} {res} 365.25255 {space 3} {res} 107.03595  
{txt}        46{c |} {space 3} {res}  1.731981 {space 3} {res} 361.74408 {space 3} {res} 105.36534  
{txt}        47{c |} {space 3} {res} 1.5781166 {space 3} {res} 358.68178 {space 3} {res} 103.89389  
{txt}        48{c |} {space 3} {res}  1.437921 {space 3} {res} 356.00316 {space 3} {res}  102.5966  
{txt}        49{c |} {space 3} {res} 1.3101801 {space 3} {res} 353.65519 {space 3} {res} 101.45163  
{txt}        50{c |} {space 3} {res} 1.1937873 {space 3} {res} 352.50685 {space 3} {res} 100.64934  *
{txt}        51{c |} {space 3} {res} 1.0877345 {space 3} {res} 356.83976 {space 3} {res} 101.26159  
{txt}        52{c |} {space 3} {res}  .9911032 {space 3} {res} 364.02087 {space 3} {res} 102.92767  
{txt}        53{c |} {space 3} {res} .90305632 {space 3} {res} 370.90437 {space 3} {res} 105.19346  
{txt}        54{c |} {space 3} {res} .82283129 {space 3} {res} 372.30569 {space 3} {res} 106.66025  
{txt}        55{c |} {space 3} {res} .74973322 {space 3} {res} 373.75584 {space 3} {res} 108.30098  
{txt}        56{c |} {space 3} {res} .68312899 {space 3} {res} 376.14489 {space 3} {res} 109.93039  
{txt}        57{c |} {space 3} {res} .62244169 {space 3} {res} 379.23972 {space 3} {res} 111.50851  
{txt}        58{c |} {space 3} {res} .56714569 {space 3} {res} 380.57736 {space 3} {res}  112.6518  
{txt}        59{c |} {space 3} {res} .51676203 {space 3} {res} 381.10371 {space 3} {res} 113.83269  
{txt}        60{c |} {space 3} {res} .47085431 {space 3} {res} 381.65622 {space 3} {res} 115.03639  
{txt}        61{c |} {space 3} {res} .42902491 {space 3} {res} 380.60594 {space 3} {res} 115.63453  
{txt}        62{c |} {space 3} {res} .39091152 {space 3} {res}  379.4489 {space 3} {res} 116.03648  
{txt}        63{c |} {space 3} {res} .35618402 {space 3} {res} 380.93282 {space 3} {res} 117.11687  
{txt}        64{c |} {space 3} {res} .32454161 {space 3} {res}  382.4117 {space 3} {res} 117.95338  
{txt}        65{c |} {space 3} {res} .29571023 {space 3} {res} 381.88529 {space 3} {res} 118.32834  
{txt}        66{c |} {space 3} {res} .26944015 {space 3} {res} 379.28013 {space 3} {res} 118.31961  
{txt}        67{c |} {space 3} {res} .24550383 {space 3} {res} 377.40912 {space 3} {res} 118.64324  
{txt}        68{c |} {space 3} {res} .22369395 {space 3} {res} 376.66024 {space 3} {res} 119.09348  
{txt}        69{c |} {space 3} {res} .20382159 {space 3} {res} 376.15548 {space 3} {res} 119.53354  
{txt}        70{c |} {space 3} {res} .18571464 {space 3} {res} 375.12187 {space 3} {res} 120.01658  
{txt}        71{c |} {space 3} {res} .16921627 {space 3} {res} 373.18437 {space 3} {res} 120.19118  
{txt}        72{c |} {space 3} {res} .15418356 {space 3} {res} 372.47464 {space 3} {res} 120.46793  
{txt}        73{c |} {space 3} {res} .14048632 {space 3} {res}  372.6192 {space 3} {res}  120.8496  
{txt}        74{c |} {space 3} {res}  .1280059 {space 3} {res} 374.21435 {space 3} {res}   121.223  
{txt}        75{c |} {space 3} {res} .11663421 {space 3} {res} 377.80975 {space 3} {res} 121.17238  
{txt}        76{c |} {space 3} {res} .10627275 {space 3} {res} 382.23213 {space 3} {res} 120.99175  
{txt}        77{c |} {space 3} {res} .09683177 {space 3} {res} 386.17951 {space 3} {res} 120.77563  
{txt}        78{c |} {space 3} {res}  .0882295 {space 3} {res} 389.39199 {space 3} {res} 120.33265  
{txt}        79{c |} {space 3} {res} .08039144 {space 3} {res} 392.68466 {space 3} {res} 120.07222  
{txt}        80{c |} {space 3} {res} .07324968 {space 3} {res} 397.26264 {space 3} {res} 120.51452  
{txt}        81{c |} {space 3} {res} .06674238 {space 3} {res}  403.4611 {space 3} {res} 121.31889  
{txt}        82{c |} {space 3} {res} .06081317 {space 3} {res} 413.08025 {space 3} {res}  121.8094  
{txt}        83{c |} {space 3} {res}  .0554107 {space 3} {res} 421.58255 {space 3} {res} 121.40802  
{txt}        84{c |} {space 3} {res} .05048816 {space 3} {res} 427.33017 {space 3} {res}  120.1107  
{txt}        85{c |} {space 3} {res} .04600294 {space 3} {res} 431.32962 {space 3} {res} 118.94941  
{txt}        86{c |} {space 3} {res} .04191616 {space 3} {res} 433.96906 {space 3} {res} 117.98959  
{txt}        87{c |} {space 3} {res} .03819245 {space 3} {res} 436.77313 {space 3} {res} 117.32436  
{txt}        88{c |} {space 3} {res} .03479953 {space 3} {res} 439.65944 {space 3} {res} 116.89027  
{txt}        89{c |} {space 3} {res} .03170804 {space 3} {res} 442.56443 {space 3} {res} 116.63575  
{txt}        90{c |} {space 3} {res} .02889118 {space 3} {res} 445.43973 {space 3} {res}  116.5192  
{txt}        91{c |} {space 3} {res} .02632457 {space 3} {res} 448.24921 {space 3} {res} 116.50728  
{txt}        92{c |} {space 3} {res} .02398597 {space 3} {res} 450.96652 {space 3} {res} 116.57341  
{txt}        93{c |} {space 3} {res} .02185512 {space 3} {res} 453.57312 {space 3} {res} 116.69652  
{txt}        94{c |} {space 3} {res} .01991357 {space 3} {res} 456.05666 {space 3} {res} 116.86002  
{txt}        95{c |} {space 3} {res} .01814451 {space 3} {res} 458.40965 {space 3} {res} 117.05094  
{txt}        96{c |} {space 3} {res}  .0165326 {space 3} {res} 460.62839 {space 3} {res} 117.25916  
{txt}        97{c |} {space 3} {res} .01506389 {space 3} {res} 462.71211 {space 3} {res} 117.47692  
{txt}        98{c |} {space 3} {res} .01372565 {space 3} {res} 464.66227 {space 3} {res} 117.69829  
{txt}        99{c |} {space 3} {res}  .0125063 {space 3} {res} 466.48198 {space 3} {res} 117.91878  
{txt}       100{c |} {space 3} {res} .01139528 {space 3} {res} 468.17556 {space 3} {res}  118.1351  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
Estimate  with lambda=1.194 (lopt).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 14}air {c |}
{space 14}L1. {c |}{col 21}{res}      0.1534004      0.1610229
{txt}{space 13}L11. {c |}{col 21}{res}      0.0638066      0.0724006
{txt}{space 13}L12. {c |}{col 21}{res}      0.8422566      0.8374074
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 17} {c |}
{space 12}_cons {c |}{col 21}{res}     11.5075093      8.2797832
{txt}{hline 18}{c BT}{hline 32}
r; t=2.95 12:06:19
{com}.         // note slightly looser tolerance
.         savedresults comp nosklearn e(),                                                                        ///
>                 exclude(macros: lasso2opt)                                                                              ///
>                 tol(1e-6) verbose
{txt}comparing macro  e(cvmethod)
comparing macro  e(varXmodel)
comparing macro  e(varX)
comparing macro  e(depvar)
comparing macro  e(predict)
comparing macro  e(cmd)
comparing scalar e(origin)
comparing scalar e(h)
comparing scalar e(mspemin)
comparing scalar e(lse)
comparing scalar e(lopt)
comparing scalar e(alpha)
comparing scalar e(p)
comparing scalar e(nalpha)
comparing scalar e(prestd)
comparing scalar e(partial_ct)
comparing scalar e(notpen_ct)
comparing scalar e(ols)
comparing scalar e(adaptive)
comparing scalar e(sqrt)
comparing scalar e(lcount)
comparing scalar e(lmin)
comparing scalar e(lmax)
comparing scalar e(nfolds)
comparing scalar e(N)
comparing matrix e(cvlower)
comparing matrix e(cvupper)
comparing matrix e(cvsd)
comparing matrix e(mmspe)
comparing matrix e(mspe)
comparing matrix e(lambdamat)
r; t=0.00 12:06:19
{com}. 
. {c )-}
{txt}r; t=58.82 12:06:19

{com}. 
. ********************************************************************************
. *** partial                                                                                             ****
. ********************************************************************************
. 
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 12:06:19

{com}. 
. cvlasso $model, partial(svi) saveest(m)

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 113.54767 {space 3} {res}  .9448975 {space 3} {res} .19430592  
{txt}         2{c |} {space 3} {res} 103.46041 {space 3} {res} .90969054 {space 3} {res}  .1962486  
{txt}         3{c |} {space 3} {res} 94.269272 {space 3} {res} .86115275 {space 3} {res}  .1892432  
{txt}         4{c |} {space 3} {res} 85.894649 {space 3} {res} .81941625 {space 3} {res} .18159904  
{txt}         5{c |} {space 3} {res} 78.264005 {space 3} {res} .78479735 {space 3} {res} .17480695  
{txt}         6{c |} {space 3} {res} 71.311247 {space 3} {res} .75591078 {space 3} {res} .16880123  
{txt}         7{c |} {space 3} {res} 64.976152 {space 3} {res}  .7295339 {space 3} {res} .16376987  
{txt}         8{c |} {space 3} {res}  59.20385 {space 3} {res} .70309648 {space 3} {res} .15922601  
{txt}         9{c |} {space 3} {res} 53.944343 {space 3} {res} .67785431 {space 3} {res}  .1538749  ^
{txt}        10{c |} {space 3} {res} 49.152076 {space 3} {res} .65548192 {space 3} {res} .14771358  
{txt}        11{c |} {space 3} {res} 44.785541 {space 3} {res} .63784496 {space 3} {res} .14231551  
{txt}        12{c |} {space 3} {res} 40.806917 {space 3} {res} .62386194 {space 3} {res} .13760919  
{txt}        13{c |} {space 3} {res} 37.181743 {space 3} {res}  .6124637 {space 3} {res} .13349693  
{txt}        14{c |} {space 3} {res}  33.87862 {space 3} {res} .60328711 {space 3} {res} .12989378  
{txt}        15{c |} {space 3} {res} 30.868936 {space 3} {res} .59605284 {space 3} {res} .12689519  
{txt}        16{c |} {space 3} {res} 28.126625 {space 3} {res} .59084567 {space 3} {res} .12516542  
{txt}        17{c |} {space 3} {res} 25.627933 {space 3} {res} .58570458 {space 3} {res} .12350471  
{txt}        18{c |} {space 3} {res} 23.351218 {space 3} {res} .58203971 {space 3} {res} .12203743  
{txt}        19{c |} {space 3} {res}  21.27676 {space 3} {res} .57872445 {space 3} {res} .12082145  
{txt}        20{c |} {space 3} {res} 19.386592 {space 3} {res} .57580424 {space 3} {res} .11983263  
{txt}        21{c |} {space 3} {res}  17.66434 {space 3} {res} .57350109 {space 3} {res} .11900135  
{txt}        22{c |} {space 3} {res} 16.095089 {space 3} {res} .57169968 {space 3} {res} .11829661  
{txt}        23{c |} {space 3} {res} 14.665246 {space 3} {res} .57041081 {space 3} {res} .11768159  
{txt}        24{c |} {space 3} {res} 13.362426 {space 3} {res} .57007522 {space 3} {res}  .1170492  
{txt}        25{c |} {space 3} {res} 12.175345 {space 3} {res} .56974475 {space 3} {res} .11653011  
{txt}        26{c |} {space 3} {res} 11.093721 {space 3} {res} .56881286 {space 3} {res} .11608357  
{txt}        27{c |} {space 3} {res} 10.108185 {space 3} {res} .56768067 {space 3} {res} .11567786  
{txt}        28{c |} {space 3} {res} 9.2102017 {space 3} {res} .56695587 {space 3} {res} .11562148  
{txt}        29{c |} {space 3} {res} 8.3919928 {space 3} {res} .56679336 {space 3} {res} .11631919  
{txt}        30{c |} {space 3} {res} 7.6464713 {space 3} {res} .56653792 {space 3} {res} .11646714  
{txt}        31{c |} {space 3} {res} 6.9671798 {space 3} {res} .56641619 {space 3} {res} .11632036  
{txt}        32{c |} {space 3} {res} 6.3482348 {space 3} {res} .56654249 {space 3} {res} .11619824  
{txt}        33{c |} {space 3} {res} 5.7842751 {space 3} {res} .56681841 {space 3} {res} .11610995  
{txt}        34{c |} {space 3} {res}  5.270416 {space 3} {res} .56694083 {space 3} {res} .11607963  
{txt}        35{c |} {space 3} {res} 4.8022068 {space 3} {res} .56667298 {space 3} {res} .11611901  
{txt}        36{c |} {space 3} {res}  4.375592 {space 3} {res} .56649339 {space 3} {res}  .1161714  
{txt}        37{c |} {space 3} {res} 3.9868765 {space 3} {res} .56644391 {space 3} {res} .11622513  
{txt}        38{c |} {space 3} {res} 3.6326933 {space 3} {res} .56628676 {space 3} {res}  .1163229  
{txt}        39{c |} {space 3} {res} 3.3099749 {space 3} {res} .56605693 {space 3} {res}  .1164521  
{txt}        40{c |} {space 3} {res} 3.0159258 {space 3} {res} .56591529 {space 3} {res} .11657381  
{txt}        41{c |} {space 3} {res} 2.7479993 {space 3} {res} .56584249 {space 3} {res}   .116688  
{txt}        42{c |} {space 3} {res} 2.5038746 {space 3} {res} .56582288 {space 3} {res}  .1167948  
{txt}        43{c |} {space 3} {res} 2.2814373 {space 3} {res} .56567232 {space 3} {res} .11692778  
{txt}        44{c |} {space 3} {res} 2.0787607 {space 3} {res} .56538065 {space 3} {res} .11708805  
{txt}        45{c |} {space 3} {res} 1.8940893 {space 3} {res} .56514498 {space 3} {res} .11723602  
{txt}        46{c |} {space 3} {res} 1.7258236 {space 3} {res} .56495524 {space 3} {res} .11737244  
{txt}        47{c |} {space 3} {res} 1.5725062 {space 3} {res} .56480309 {space 3} {res} .11749806  
{txt}        48{c |} {space 3} {res} 1.4328091 {space 3} {res} .56468169 {space 3} {res}  .1176136  
{txt}        49{c |} {space 3} {res} 1.3055223 {space 3} {res} .56458537 {space 3} {res} .11771977  
{txt}        50{c |} {space 3} {res} 1.1895433 {space 3} {res} .56450947 {space 3} {res} .11781726  
{txt}        51{c |} {space 3} {res} 1.0838675 {space 3} {res} .56445018 {space 3} {res} .11790669  
{txt}        52{c |} {space 3} {res} .98757974 {space 3} {res} .56440433 {space 3} {res} .11798868  
{txt}        53{c |} {space 3} {res} .89984588 {space 3} {res} .56436937 {space 3} {res} .11806381  
{txt}        54{c |} {space 3} {res} .81990605 {space 3} {res} .56433193 {space 3} {res} .11813375  
{txt}        55{c |} {space 3} {res} .74706786 {space 3} {res} .56430261 {space 3} {res} .11819774  
{txt}        56{c |} {space 3} {res} .68070041 {space 3} {res}  .5642798 {space 3} {res} .11825628  
{txt}        57{c |} {space 3} {res} .62022886 {space 3} {res} .56426227 {space 3} {res} .11830982  
{txt}        58{c |} {space 3} {res} .56512944 {space 3} {res} .56424899 {space 3} {res} .11835875  
{txt}        59{c |} {space 3} {res} .51492489 {space 3} {res} .56423913 {space 3} {res} .11840347  
{txt}        60{c |} {space 3} {res} .46918039 {space 3} {res}   .564232 {space 3} {res} .11844432  *
{txt}        61{c |} {space 3} {res} .42749969 {space 3} {res} .56425285 {space 3} {res} .11847589  
{txt}        62{c |} {space 3} {res}  .3895218 {space 3} {res} .56427636 {space 3} {res} .11850399  
{txt}        63{c |} {space 3} {res} .35491776 {space 3} {res} .56429878 {space 3} {res} .11852965  
{txt}        64{c |} {space 3} {res} .32338784 {space 3} {res} .56432003 {space 3} {res} .11855308  
{txt}        65{c |} {space 3} {res} .29465896 {space 3} {res} .56434008 {space 3} {res} .11857447  
{txt}        66{c |} {space 3} {res} .26848227 {space 3} {res} .56435892 {space 3} {res} .11859398  
{txt}        67{c |} {space 3} {res} .24463104 {space 3} {res} .56437655 {space 3} {res}  .1186118  
{txt}        68{c |} {space 3} {res} .22289869 {space 3} {res} .56439302 {space 3} {res} .11862805  
{txt}        69{c |} {space 3} {res} .20309699 {space 3} {res} .56440835 {space 3} {res} .11864288  
{txt}        70{c |} {space 3} {res} .18505441 {space 3} {res} .56442258 {space 3} {res}  .1186564  
{txt}        71{c |} {space 3} {res} .16861469 {space 3} {res} .56443578 {space 3} {res} .11866874  
{txt}        72{c |} {space 3} {res} .15363542 {space 3} {res} .56444799 {space 3} {res} .11867999  
{txt}        73{c |} {space 3} {res} .13998688 {space 3} {res} .56445927 {space 3} {res} .11869025  
{txt}        74{c |} {space 3} {res} .12755083 {space 3} {res} .56446967 {space 3} {res} .11869961  
{txt}        75{c |} {space 3} {res} .11621956 {space 3} {res} .56447926 {space 3} {res} .11870814  
{txt}        76{c |} {space 3} {res} .10589494 {space 3} {res} .56448809 {space 3} {res} .11871592  
{txt}        77{c |} {space 3} {res} .09648752 {space 3} {res}  .5644962 {space 3} {res} .11872301  
{txt}        78{c |} {space 3} {res} .08791584 {space 3} {res} .56450366 {space 3} {res} .11872948  
{txt}        79{c |} {space 3} {res} .08010564 {space 3} {res}  .5645105 {space 3} {res} .11873537  
{txt}        80{c |} {space 3} {res} .07298927 {space 3} {res} .56451678 {space 3} {res} .11874074  
{txt}        81{c |} {space 3} {res} .06650511 {space 3} {res} .56452254 {space 3} {res} .11874564  
{txt}        82{c |} {space 3} {res} .06059698 {space 3} {res} .56452781 {space 3} {res} .11875011  
{txt}        83{c |} {space 3} {res} .05521371 {space 3} {res} .56453264 {space 3} {res} .11875417  
{txt}        84{c |} {space 3} {res} .05030867 {space 3} {res} .56453706 {space 3} {res} .11875788  
{txt}        85{c |} {space 3} {res} .04583939 {space 3} {res}  .5645411 {space 3} {res} .11876126  
{txt}        86{c |} {space 3} {res} .04176715 {space 3} {res}  .5645448 {space 3} {res} .11876434  
{txt}        87{c |} {space 3} {res} .03805667 {space 3} {res} .56454818 {space 3} {res} .11876715  
{txt}        88{c |} {space 3} {res} .03467582 {space 3} {res} .56455127 {space 3} {res} .11876971  
{txt}        89{c |} {space 3} {res} .03159531 {space 3} {res} .56455409 {space 3} {res} .11877204  
{txt}        90{c |} {space 3} {res} .02878847 {space 3} {res} .56455667 {space 3} {res} .11877417  
{txt}        91{c |} {space 3} {res} .02623098 {space 3} {res} .56455903 {space 3} {res}  .1187761  
{txt}        92{c |} {space 3} {res}  .0239007 {space 3} {res} .56456118 {space 3} {res} .11877787  
{txt}        93{c |} {space 3} {res} .02177742 {space 3} {res} .56456314 {space 3} {res} .11877948  
{txt}        94{c |} {space 3} {res} .01984278 {space 3} {res} .56456493 {space 3} {res} .11878094  
{txt}        95{c |} {space 3} {res}    .01808 {space 3} {res} .56456657 {space 3} {res} .11878228  
{txt}        96{c |} {space 3} {res} .01647382 {space 3} {res} .56456806 {space 3} {res}  .1187835  
{txt}        97{c |} {space 3} {res} .01501033 {space 3} {res} .56456942 {space 3} {res} .11878461  
{txt}        98{c |} {space 3} {res} .01367686 {space 3} {res} .56457067 {space 3} {res} .11878562  
{txt}        99{c |} {space 3} {res} .01246184 {space 3} {res}  .5645718 {space 3} {res} .11878654  
{txt}       100{c |} {space 3} {res} .01135477 {space 3} {res} .56457283 {space 3} {res} .11878738  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=16.35 12:06:35

{com}. 
. // make sure that partial works
. estimates restore m1
{txt}(results {stata estimates replay m1:m1} are active now)
r; t=0.01 12:06:35

{com}. assert "`e(partial)'"=="svi"
{txt}r; t=0.00 12:06:35

{com}. 
. 
. ********************************************************************************
. *** misc options/syntax checks                                                   ***
. ********************************************************************************
. 
. // Support for inrange(.) and similar [if] expressions:
. cvlasso $model if inrange(age,50,70)

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 132.46591 {space 3} {res}  1.417018 {space 3} {res} .23351424  
{txt}         2{c |} {space 3} {res}   120.698 {space 3} {res} 1.3299371 {space 3} {res} .22154892  
{txt}         3{c |} {space 3} {res} 109.97553 {space 3} {res} 1.2215724 {space 3} {res} .20347294  
{txt}         4{c |} {space 3} {res}  100.2056 {space 3} {res} 1.1315512 {space 3} {res} .18799113  
{txt}         5{c |} {space 3} {res} 91.303614 {space 3} {res} 1.0567639 {space 3} {res} .17470027  
{txt}         6{c |} {space 3} {res} 83.192453 {space 3} {res} .99665247 {space 3} {res} .16288428  
{txt}         7{c |} {space 3} {res} 75.801865 {space 3} {res} .94719323 {space 3} {res} .15264767  
{txt}         8{c |} {space 3} {res} 69.067836 {space 3} {res} .90296826 {space 3} {res} .14331089  
{txt}         9{c |} {space 3} {res}  62.93204 {space 3} {res} .86471736 {space 3} {res} .13434959  
{txt}        10{c |} {space 3} {res} 57.341331 {space 3} {res} .83014776 {space 3} {res} .12589793  
{txt}        11{c |} {space 3} {res} 52.247285 {space 3} {res} .79969069 {space 3} {res} .11828654  
{txt}        12{c |} {space 3} {res}  47.60578 {space 3} {res} .77136516 {space 3} {res} .11124048  
{txt}        13{c |} {space 3} {res} 43.376614 {space 3} {res} .74347378 {space 3} {res} .10425766  
{txt}        14{c |} {space 3} {res} 39.523155 {space 3} {res} .71822142 {space 3} {res} .09774546  
{txt}        15{c |} {space 3} {res} 36.012027 {space 3} {res} .69625126 {space 3} {res} .09188606  
{txt}        16{c |} {space 3} {res} 32.812818 {space 3} {res} .67788308 {space 3} {res} .08678453  ^
{txt}        17{c |} {space 3} {res} 29.897817 {space 3} {res} .66282167 {space 3} {res} .08267039  
{txt}        18{c |} {space 3} {res} 27.241778 {space 3} {res} .65050552 {space 3} {res} .07962729  
{txt}        19{c |} {space 3} {res} 24.821693 {space 3} {res} .64055758 {space 3} {res}  .0774997  
{txt}        20{c |} {space 3} {res} 22.616602 {space 3} {res} .63243396 {space 3} {res} .07610465  
{txt}        21{c |} {space 3} {res} 20.607406 {space 3} {res} .62598067 {space 3} {res} .07531726  
{txt}        22{c |} {space 3} {res} 18.776701 {space 3} {res} .62088826 {space 3} {res} .07500287  
{txt}        23{c |} {space 3} {res}  17.10863 {space 3} {res} .61671147 {space 3} {res} .07511389  
{txt}        24{c |} {space 3} {res} 15.588747 {space 3} {res} .61340474 {space 3} {res} .07565958  
{txt}        25{c |} {space 3} {res} 14.203885 {space 3} {res} .61075837 {space 3} {res}  .0764187  
{txt}        26{c |} {space 3} {res} 12.942051 {space 3} {res} .60859317 {space 3} {res} .07729429  
{txt}        27{c |} {space 3} {res} 11.792315 {space 3} {res}  .6069923 {space 3} {res} .07820519  
{txt}        28{c |} {space 3} {res} 10.744718 {space 3} {res} .60556584 {space 3} {res} .07916127  
{txt}        29{c |} {space 3} {res} 9.7901873 {space 3} {res} .60447794 {space 3} {res} .08011768  
{txt}        30{c |} {space 3} {res}  8.920454 {space 3} {res} .60370951 {space 3} {res} .08105117  
{txt}        31{c |} {space 3} {res} 8.1279855 {space 3} {res} .60296444 {space 3} {res} .08188268  
{txt}        32{c |} {space 3} {res} 7.4059177 {space 3} {res} .60230217 {space 3} {res} .08263919  
{txt}        33{c |} {space 3} {res} 6.7479964 {space 3} {res} .60160411 {space 3} {res} .08329122  
{txt}        34{c |} {space 3} {res}  6.148523 {space 3} {res}  .6008848 {space 3} {res} .08385787  
{txt}        35{c |} {space 3} {res} 5.6023051 {space 3} {res} .60044458 {space 3} {res} .08436525  
{txt}        36{c |} {space 3} {res} 5.1046118 {space 3} {res} .60041587 {space 3} {res} .08481504  *
{txt}        37{c |} {space 3} {res} 4.6511321 {space 3} {res} .60059203 {space 3} {res} .08522904  
{txt}        38{c |} {space 3} {res} 4.2379384 {space 3} {res} .60113841 {space 3} {res}  .0856273  
{txt}        39{c |} {space 3} {res} 3.8614516 {space 3} {res} .60188192 {space 3} {res} .08600609  
{txt}        40{c |} {space 3} {res} 3.5184109 {space 3} {res} .60288747 {space 3} {res} .08632774  
{txt}        41{c |} {space 3} {res}  3.205845 {space 3} {res} .60392497 {space 3} {res} .08660488  
{txt}        42{c |} {space 3} {res} 2.9210465 {space 3} {res}  .6050265 {space 3} {res} .08685842  
{txt}        43{c |} {space 3} {res} 2.6615488 {space 3} {res} .60624418 {space 3} {res} .08716865  
{txt}        44{c |} {space 3} {res} 2.4251041 {space 3} {res}  .6074794 {space 3} {res} .08746616  
{txt}        45{c |} {space 3} {res} 2.2096646 {space 3} {res} .60862306 {space 3} {res} .08776611  
{txt}        46{c |} {space 3} {res} 2.0133641 {space 3} {res} .60965399 {space 3} {res} .08807148  
{txt}        47{c |} {space 3} {res} 1.8345024 {space 3} {res} .61037704 {space 3} {res} .08839329  
{txt}        48{c |} {space 3} {res} 1.6715302 {space 3} {res} .61106903 {space 3} {res} .08868897  
{txt}        49{c |} {space 3} {res} 1.5230361 {space 3} {res} .61154186 {space 3} {res} .08880905  
{txt}        50{c |} {space 3} {res} 1.3877338 {space 3} {res} .61195575 {space 3} {res} .08887515  
{txt}        51{c |} {space 3} {res} 1.2644513 {space 3} {res} .61236905 {space 3} {res} .08893668  
{txt}        52{c |} {space 3} {res} 1.1521209 {space 3} {res} .61274195 {space 3} {res} .08898462  
{txt}        53{c |} {space 3} {res} 1.0497697 {space 3} {res} .61310732 {space 3} {res} .08902937  
{txt}        54{c |} {space 3} {res} .95651105 {space 3} {res}  .6134611 {space 3} {res} .08907095  
{txt}        55{c |} {space 3} {res} .87153724 {space 3} {res} .61380075 {space 3} {res} .08910953  
{txt}        56{c |} {space 3} {res} .79411228 {space 3} {res} .61412462 {space 3} {res} .08914526  
{txt}        57{c |} {space 3} {res} .72356553 {space 3} {res} .61443164 {space 3} {res} .08917832  
{txt}        58{c |} {space 3} {res} .65928596 {space 3} {res}  .6147213 {space 3} {res} .08920887  
{txt}        59{c |} {space 3} {res} .60071681 {space 3} {res} .61499345 {space 3} {res} .08923706  
{txt}        60{c |} {space 3} {res} .54735079 {space 3} {res} .61524825 {space 3} {res} .08926305  
{txt}        61{c |} {space 3} {res} .49872565 {space 3} {res} .61548609 {space 3} {res} .08928698  
{txt}        62{c |} {space 3} {res} .45442024 {space 3} {res} .61570751 {space 3} {res} .08930901  
{txt}        63{c |} {space 3} {res}  .4140508 {space 3} {res} .61591316 {space 3} {res} .08932926  
{txt}        64{c |} {space 3} {res} .37726767 {space 3} {res} .61610379 {space 3} {res} .08934786  
{txt}        65{c |} {space 3} {res} .34375225 {space 3} {res} .61628018 {space 3} {res} .08936494  
{txt}        66{c |} {space 3} {res} .31321425 {space 3} {res} .61644313 {space 3} {res} .08938061  
{txt}        67{c |} {space 3} {res} .28538915 {space 3} {res} .61659347 {space 3} {res} .08939498  
{txt}        68{c |} {space 3} {res} .26003597 {space 3} {res} .61670998 {space 3} {res} .08940428  
{txt}        69{c |} {space 3} {res} .23693509 {space 3} {res}  .6167799 {space 3} {res} .08940627  
{txt}        70{c |} {space 3} {res} .21588643 {space 3} {res} .61684478 {space 3} {res} .08940825  
{txt}        71{c |} {space 3} {res} .19670767 {space 3} {res} .61690488 {space 3} {res} .08941019  
{txt}        72{c |} {space 3} {res} .17923271 {space 3} {res} .61696045 {space 3} {res} .08941206  
{txt}        73{c |} {space 3} {res} .16331017 {space 3} {res} .61701175 {space 3} {res} .08941386  
{txt}        74{c |} {space 3} {res} .14880214 {space 3} {res} .61705906 {space 3} {res} .08941558  
{txt}        75{c |} {space 3} {res} .13558297 {space 3} {res} .61710263 {space 3} {res} .08941721  
{txt}        76{c |} {space 3} {res} .12353815 {space 3} {res} .61714272 {space 3} {res} .08941875  
{txt}        77{c |} {space 3} {res} .11256336 {space 3} {res} .61717957 {space 3} {res} .08942019  
{txt}        78{c |} {space 3} {res} .10256354 {space 3} {res}  .6172134 {space 3} {res} .08942154  
{txt}        79{c |} {space 3} {res} .09345208 {space 3} {res} .61724445 {space 3} {res}  .0894228  
{txt}        80{c |} {space 3} {res} .08515006 {space 3} {res} .61727293 {space 3} {res} .08942398  
{txt}        81{c |} {space 3} {res} .07758556 {space 3} {res} .61729903 {space 3} {res} .08942507  
{txt}        82{c |} {space 3} {res} .07069307 {space 3} {res} .61732294 {space 3} {res} .08942608  
{txt}        83{c |} {space 3} {res}  .0644129 {space 3} {res} .61734483 {space 3} {res} .08942702  
{txt}        84{c |} {space 3} {res} .05869063 {space 3} {res} .61736486 {space 3} {res} .08942788  
{txt}        85{c |} {space 3} {res} .05347672 {space 3} {res} .61738318 {space 3} {res} .08942868  
{txt}        86{c |} {space 3} {res} .04872599 {space 3} {res} .61739993 {space 3} {res} .08942942  
{txt}        87{c |} {space 3} {res} .04439731 {space 3} {res} .61741525 {space 3} {res}  .0894301  
{txt}        88{c |} {space 3} {res} .04045318 {space 3} {res} .61742925 {space 3} {res} .08943072  
{txt}        89{c |} {space 3} {res} .03685943 {space 3} {res} .61744204 {space 3} {res} .08943129  
{txt}        90{c |} {space 3} {res} .03358494 {space 3} {res} .61745372 {space 3} {res} .08943182  
{txt}        91{c |} {space 3} {res} .03060134 {space 3} {res} .61746438 {space 3} {res}  .0894323  
{txt}        92{c |} {space 3} {res}  .0278828 {space 3} {res} .61747412 {space 3} {res} .08943274  
{txt}        93{c |} {space 3} {res} .02540577 {space 3} {res} .61748301 {space 3} {res} .08943314  
{txt}        94{c |} {space 3} {res} .02314879 {space 3} {res} .61749113 {space 3} {res} .08943352  
{txt}        95{c |} {space 3} {res} .02109232 {space 3} {res} .61749853 {space 3} {res} .08943385  
{txt}        96{c |} {space 3} {res} .01921854 {space 3} {res} .61750529 {space 3} {res} .08943416  
{txt}        97{c |} {space 3} {res} .01751121 {space 3} {res} .61751145 {space 3} {res} .08943445  
{txt}        98{c |} {space 3} {res} .01595557 {space 3} {res} .61751707 {space 3} {res} .08943471  
{txt}        99{c |} {space 3} {res} .01453812 {space 3} {res}  .6175222 {space 3} {res} .08943495  
{txt}       100{c |} {space 3} {res} .01324659 {space 3} {res} .61752688 {space 3} {res} .08943516  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=0.61 12:06:36

{com}. 
. ********************************************************************************
. *** plotting                                                                                             ***
. ********************************************************************************
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 12:06:36

{com}. 
. cvlasso $model, plotcv

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 163.62492 {space 3} {res} 1.3219656 {space 3} {res} .21641704  
{txt}         2{c |} {space 3} {res} 149.08894 {space 3} {res} 1.2504453 {space 3} {res} .21215725  
{txt}         3{c |} {space 3} {res} 135.84429 {space 3} {res} 1.1456834 {space 3} {res} .19338515  
{txt}         4{c |} {space 3} {res} 123.77625 {space 3} {res} 1.0587271 {space 3} {res} .17771036  
{txt}         5{c |} {space 3} {res} 112.78031 {space 3} {res} .98655161 {space 3} {res} .16464203  
{txt}         6{c |} {space 3} {res} 102.76122 {space 3} {res} .92664585 {space 3} {res} .15376657  
{txt}         7{c |} {space 3} {res} 93.632197 {space 3} {res} .87683987 {space 3} {res} .14472766  
{txt}         8{c |} {space 3} {res} 85.314171 {space 3} {res}  .8353387 {space 3} {res} .13723157  
{txt}         9{c |} {space 3} {res} 77.735095 {space 3} {res} .79965836 {space 3} {res} .13179464  
{txt}        10{c |} {space 3} {res} 70.829323 {space 3} {res} .76448705 {space 3} {res} .12609882  
{txt}        11{c |} {space 3} {res} 64.537041 {space 3} {res}  .7288497 {space 3} {res} .12041485  
{txt}        12{c |} {space 3} {res} 58.803749 {space 3} {res} .69441219 {space 3} {res} .11653913  
{txt}        13{c |} {space 3} {res} 53.579786 {space 3} {res} .66357623 {space 3} {res} .11382436  
{txt}        14{c |} {space 3} {res} 48.819905 {space 3} {res} .63893822 {space 3} {res}  .1118766  ^
{txt}        15{c |} {space 3} {res} 44.482879 {space 3} {res} .61892067 {space 3} {res} .11044377  
{txt}        16{c |} {space 3} {res} 40.531143 {space 3} {res} .60245055 {space 3} {res} .10937358  
{txt}        17{c |} {space 3} {res} 36.930468 {space 3} {res} .58891237 {space 3} {res} .10858583  
{txt}        18{c |} {space 3} {res} 33.649667 {space 3} {res} .57809378 {space 3} {res} .10801815  
{txt}        19{c |} {space 3} {res} 30.660323 {space 3} {res} .57021623 {space 3} {res} .10755021  
{txt}        20{c |} {space 3} {res} 27.936545 {space 3} {res} .56464865 {space 3} {res} .10708935  
{txt}        21{c |} {space 3} {res} 25.454739 {space 3} {res} .56040224 {space 3} {res} .10675732  
{txt}        22{c |} {space 3} {res}  23.19341 {space 3} {res} .55678247 {space 3} {res} .10659657  
{txt}        23{c |} {space 3} {res} 21.132972 {space 3} {res} .55381968 {space 3} {res} .10652831  
{txt}        24{c |} {space 3} {res} 19.255577 {space 3} {res} .55163702 {space 3} {res} .10663957  
{txt}        25{c |} {space 3} {res} 17.544964 {space 3} {res} .55010718 {space 3} {res} .10682207  
{txt}        26{c |} {space 3} {res} 15.986318 {space 3} {res} .54899958 {space 3} {res} .10703172  
{txt}        27{c |} {space 3} {res} 14.566138 {space 3} {res} .54871962 {space 3} {res} .10718202  
{txt}        28{c |} {space 3} {res} 13.272122 {space 3} {res}   .549209 {space 3} {res} .10743423  
{txt}        29{c |} {space 3} {res} 12.093063 {space 3} {res} .54975423 {space 3} {res} .10779974  
{txt}        30{c |} {space 3} {res} 11.018749 {space 3} {res} .55005438 {space 3} {res} .10817614  
{txt}        31{c |} {space 3} {res} 10.039874 {space 3} {res} .55023736 {space 3} {res} .10843914  
{txt}        32{c |} {space 3} {res} 9.1479589 {space 3} {res} .54912655 {space 3} {res} .10822123  
{txt}        33{c |} {space 3} {res} 8.3352794 {space 3} {res} .54682433 {space 3} {res} .10786035  
{txt}        34{c |} {space 3} {res} 7.5947962 {space 3} {res} .54497257 {space 3} {res}  .1075363  
{txt}        35{c |} {space 3} {res} 6.9200954 {space 3} {res} .54369756 {space 3} {res} .10729336  *
{txt}        36{c |} {space 3} {res} 6.3053332 {space 3} {res} .54426382 {space 3} {res} .10743486  
{txt}        37{c |} {space 3} {res} 5.7451848 {space 3} {res} .54522685 {space 3} {res} .10763559  
{txt}        38{c |} {space 3} {res} 5.2347984 {space 3} {res} .54611057 {space 3} {res}  .1077991  
{txt}        39{c |} {space 3} {res} 4.7697533 {space 3} {res} .54702126 {space 3} {res} .10795483  
{txt}        40{c |} {space 3} {res} 4.3460216 {space 3} {res} .54795052 {space 3} {res} .10809905  
{txt}        41{c |} {space 3} {res}  3.959933 {space 3} {res} .54875276 {space 3} {res} .10827091  
{txt}        42{c |} {space 3} {res} 3.6081435 {space 3} {res} .54935586 {space 3} {res} .10844242  
{txt}        43{c |} {space 3} {res}  3.287606 {space 3} {res} .54921627 {space 3} {res} .10854636  
{txt}        44{c |} {space 3} {res} 2.9955441 {space 3} {res} .54861433 {space 3} {res} .10864162  
{txt}        45{c |} {space 3} {res} 2.7294282 {space 3} {res} .54815409 {space 3} {res} .10873919  
{txt}        46{c |} {space 3} {res} 2.4869533 {space 3} {res} .54778113 {space 3} {res} .10884528  
{txt}        47{c |} {space 3} {res} 2.2660193 {space 3} {res} .54750013 {space 3} {res} .10894959  
{txt}        48{c |} {space 3} {res} 2.0647124 {space 3} {res}  .5472951 {space 3} {res} .10905019  
{txt}        49{c |} {space 3} {res}  1.881289 {space 3} {res} .54680287 {space 3} {res}  .1091099  
{txt}        50{c |} {space 3} {res} 1.7141605 {space 3} {res} .54624181 {space 3} {res} .10915542  
{txt}        51{c |} {space 3} {res} 1.5618792 {space 3} {res} .54591216 {space 3} {res} .10924638  
{txt}        52{c |} {space 3} {res} 1.4231261 {space 3} {res} .54571154 {space 3} {res} .10935643  
{txt}        53{c |} {space 3} {res} 1.2966995 {space 3} {res} .54555556 {space 3} {res} .10946285  
{txt}        54{c |} {space 3} {res} 1.1815043 {space 3} {res} .54543569 {space 3} {res} .10956485  
{txt}        55{c |} {space 3} {res} 1.0765427 {space 3} {res} .54534495 {space 3} {res} .10966193  
{txt}        56{c |} {space 3} {res} .98090565 {space 3} {res} .54527762 {space 3} {res} .10975377  
{txt}        57{c |} {space 3} {res} .89376469 {space 3} {res} .54522901 {space 3} {res} .10984025  
{txt}        58{c |} {space 3} {res}  .8143651 {space 3} {res} .54519529 {space 3} {res} .10992134  
{txt}        59{c |} {space 3} {res} .74201915 {space 3} {res} .54517334 {space 3} {res} .10999711  
{txt}        60{c |} {space 3} {res} .67610021 {space 3} {res} .54516064 {space 3} {res} .11006771  
{txt}        61{c |} {space 3} {res} .61603733 {space 3} {res} .54515511 {space 3} {res} .11013333  
{txt}        62{c |} {space 3} {res} .56131027 {space 3} {res}  .5451551 {space 3} {res} .11019417  
{txt}        63{c |} {space 3} {res} .51144502 {space 3} {res} .54515927 {space 3} {res} .11025048  
{txt}        64{c |} {space 3} {res} .46600965 {space 3} {res} .54516652 {space 3} {res} .11030252  
{txt}        65{c |} {space 3} {res} .42461064 {space 3} {res} .54517601 {space 3} {res} .11035052  
{txt}        66{c |} {space 3} {res}  .3868894 {space 3} {res} .54518704 {space 3} {res} .11039476  
{txt}        67{c |} {space 3} {res} .35251921 {space 3} {res} .54519907 {space 3} {res} .11043547  
{txt}        68{c |} {space 3} {res} .32120238 {space 3} {res} .54521168 {space 3} {res}  .1104729  
{txt}        69{c |} {space 3} {res} .29266764 {space 3} {res} .54522453 {space 3} {res} .11050729  
{txt}        70{c |} {space 3} {res} .26666786 {space 3} {res} .54523737 {space 3} {res} .11053885  
{txt}        71{c |} {space 3} {res} .24297782 {space 3} {res} .54525002 {space 3} {res}  .1105678  
{txt}        72{c |} {space 3} {res} .22139234 {space 3} {res} .54526232 {space 3} {res} .11059433  
{txt}        73{c |} {space 3} {res} .20172445 {space 3} {res} .54527418 {space 3} {res} .11061864  
{txt}        74{c |} {space 3} {res} .18380381 {space 3} {res} .54528553 {space 3} {res}  .1106409  
{txt}        75{c |} {space 3} {res} .16747519 {space 3} {res} .54529631 {space 3} {res} .11066127  
{txt}        76{c |} {space 3} {res} .15259715 {space 3} {res} .54530651 {space 3} {res} .11067991  
{txt}        77{c |} {space 3} {res} .13904084 {space 3} {res} .54531611 {space 3} {res} .11069695  
{txt}        78{c |} {space 3} {res} .12668884 {space 3} {res} .54532511 {space 3} {res} .11071253  
{txt}        79{c |} {space 3} {res} .11543415 {space 3} {res} .54533806 {space 3} {res} .11072689  
{txt}        80{c |} {space 3} {res}  .1051793 {space 3} {res} .54535161 {space 3} {res} .11074006  
{txt}        81{c |} {space 3} {res} .09583546 {space 3} {res} .54536409 {space 3} {res} .11075208  
{txt}        82{c |} {space 3} {res}  .0873217 {space 3} {res} .54537559 {space 3} {res} .11076306  
{txt}        83{c |} {space 3} {res} .07956428 {space 3} {res} .54538615 {space 3} {res} .11077309  
{txt}        84{c |} {space 3} {res} .07249601 {space 3} {res} .54539586 {space 3} {res} .11078224  
{txt}        85{c |} {space 3} {res} .06605566 {space 3} {res} .54540476 {space 3} {res}  .1107906  
{txt}        86{c |} {space 3} {res} .06018746 {space 3} {res} .54541294 {space 3} {res} .11079822  
{txt}        87{c |} {space 3} {res} .05484057 {space 3} {res} .54542043 {space 3} {res} .11080518  
{txt}        88{c |} {space 3} {res} .04996869 {space 3} {res} .54542729 {space 3} {res} .11081153  
{txt}        89{c |} {space 3} {res} .04552961 {space 3} {res} .54543357 {space 3} {res} .11081732  
{txt}        90{c |} {space 3} {res} .04148488 {space 3} {res} .54543933 {space 3} {res}  .1108226  
{txt}        91{c |} {space 3} {res} .03779948 {space 3} {res} .54544459 {space 3} {res} .11082741  
{txt}        92{c |} {space 3} {res} .03444148 {space 3} {res}  .5454494 {space 3} {res} .11083181  
{txt}        93{c |} {space 3} {res} .03138179 {space 3} {res}  .5454538 {space 3} {res} .11083581  
{txt}        94{c |} {space 3} {res} .02859392 {space 3} {res} .54545782 {space 3} {res} .11083946  
{txt}        95{c |} {space 3} {res} .02605372 {space 3} {res}  .5454615 {space 3} {res} .11084279  
{txt}        96{c |} {space 3} {res} .02373917 {space 3} {res} .54546485 {space 3} {res} .11084583  
{txt}        97{c |} {space 3} {res} .02163025 {space 3} {res} .54546792 {space 3} {res}  .1108486  
{txt}        98{c |} {space 3} {res} .01970868 {space 3} {res} .54547072 {space 3} {res} .11085112  
{txt}        99{c |} {space 3} {res} .01795782 {space 3} {res} .54547327 {space 3} {res} .11085342  
{txt}       100{c |} {space 3} {res} .01636249 {space 3} {res}  .5454756 {space 3} {res} .11085552  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
{res}{txt}r; t=5.49 12:06:42

{com}. 
. ********************************************************************************
. *** time-series example with rolling cv                                      ***
. ********************************************************************************
. 
. webuse air2, clear
{txt}(TIMESLAB: Airline passengers)
r; t=0.44 12:06:42

{com}.  
. cvlasso air L(1/12).air, rolling origin(130)
{txt}Rolling forecasting cross-validation with 1-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (131), 13-131 (132), 13-132 (133), 13-133 (134), 13-134 (135), 13-135 (136), 13-136 (137), 13-137 (138), 13-138 (139), 13-139 (140), 13-140 (141), 13-141 (142), 13-142 (143), 13-143 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 30083.535 {space 3} {res} 33237.193 {space 3} {res} 8731.4325  
{txt}         2{c |} {space 3} {res} 27410.996 {space 3} {res} 27799.242 {space 3} {res} 7290.3087  
{txt}         3{c |} {space 3} {res} 24975.879 {space 3} {res} 23267.301 {space 3} {res} 6092.3376  
{txt}         4{c |} {space 3} {res} 22757.091 {space 3} {res} 19493.102 {space 3} {res}  5095.861  
{txt}         5{c |} {space 3} {res} 20735.414 {space 3} {res} 16349.032 {space 3} {res} 4266.8189  
{txt}         6{c |} {space 3} {res} 18893.337 {space 3} {res} 13729.055 {space 3} {res} 3576.9191  
{txt}         7{c |} {space 3} {res} 17214.905 {space 3} {res} 11545.052 {space 3} {res} 3002.6587  
{txt}         8{c |} {space 3} {res}  15685.58 {space 3} {res} 9723.7885 {space 3} {res} 2524.5123  
{txt}         9{c |} {space 3} {res} 14292.116 {space 3} {res} 8204.3942 {space 3} {res} 2126.2578  
{txt}        10{c |} {space 3} {res} 13022.444 {space 3} {res} 6936.2699 {space 3} {res} 1794.4166  
{txt}        11{c |} {space 3} {res} 11865.566 {space 3} {res} 5877.3493 {space 3} {res} 1517.7888  
{txt}        12{c |} {space 3} {res} 10811.462 {space 3} {res} 4992.6553 {space 3} {res} 1287.0672  
{txt}        13{c |} {space 3} {res} 9851.0014 {space 3} {res} 4253.1013 {space 3} {res} 1094.5174  
{txt}        14{c |} {space 3} {res} 8975.8656 {space 3} {res}  3635.824 {space 3} {res} 936.22874  
{txt}        15{c |} {space 3} {res} 8178.4744 {space 3} {res} 3111.7137 {space 3} {res} 812.75242  
{txt}        16{c |} {space 3} {res} 7451.9213 {space 3} {res} 2669.6887 {space 3} {res} 708.75189  
{txt}        17{c |} {space 3} {res} 6789.9131 {space 3} {res} 2300.5206 {space 3} {res} 621.98344  
{txt}        18{c |} {space 3} {res}  6186.716 {space 3} {res} 1992.0343 {space 3} {res} 549.37699  
{txt}        19{c |} {space 3} {res} 5637.1052 {space 3} {res} 1734.1043 {space 3} {res} 488.40062  
{txt}        20{c |} {space 3} {res} 5136.3203 {space 3} {res} 1518.3087 {space 3} {res} 436.97343  
{txt}        21{c |} {space 3} {res} 4680.0237 {space 3} {res} 1337.6412 {space 3} {res} 393.39186  
{txt}        22{c |} {space 3} {res} 4264.2633 {space 3} {res} 1186.2716 {space 3} {res} 356.26673  
{txt}        23{c |} {space 3} {res} 3885.4379 {space 3} {res} 1059.3481 {space 3} {res} 324.46942  
{txt}        24{c |} {space 3} {res} 3540.2663 {space 3} {res}  952.8315 {space 3} {res} 297.08581  
{txt}        25{c |} {space 3} {res} 3225.7588 {space 3} {res} 863.35854 {space 3} {res}  273.3769  
{txt}        26{c |} {space 3} {res} 2939.1913 {space 3} {res}   788.491 {space 3} {res} 252.67635  
{txt}        27{c |} {space 3} {res} 2678.0817 {space 3} {res} 725.70704 {space 3} {res} 234.57369  
{txt}        28{c |} {space 3} {res} 2440.1683 {space 3} {res} 670.22718 {space 3} {res} 218.23327  
{txt}        29{c |} {space 3} {res} 2223.3904 {space 3} {res} 622.52635 {space 3} {res} 203.38451  
{txt}        30{c |} {space 3} {res} 2025.8706 {space 3} {res} 581.16825 {space 3} {res} 190.03867  
{txt}        31{c |} {space 3} {res} 1845.8978 {space 3} {res}  546.1645 {space 3} {res} 178.31137  
{txt}        32{c |} {space 3} {res} 1681.9133 {space 3} {res} 516.49556 {space 3} {res} 168.00213  
{txt}        33{c |} {space 3} {res} 1532.4968 {space 3} {res} 491.30969 {space 3} {res} 158.93797  
{txt}        34{c |} {space 3} {res}  1396.354 {space 3} {res} 469.89498 {space 3} {res} 150.96867  
{txt}        35{c |} {space 3} {res} 1272.3058 {space 3} {res} 451.65601 {space 3} {res}  143.9631  ^
{txt}        36{c |} {space 3} {res} 1159.2776 {space 3} {res} 436.09447 {space 3} {res} 137.80621  
{txt}        37{c |} {space 3} {res} 1056.2906 {space 3} {res} 422.79303 {space 3} {res} 132.39667  
{txt}        38{c |} {space 3} {res} 962.45264 {space 3} {res} 411.40189 {space 3} {res} 127.64501  
{txt}        39{c |} {space 3} {res}   876.951 {space 3} {res} 401.62764 {space 3} {res} 123.47207  
{txt}        40{c |} {space 3} {res} 799.04509 {space 3} {res} 393.22392 {space 3} {res} 119.80779  
{txt}        41{c |} {space 3} {res} 728.06013 {space 3} {res} 385.98373 {space 3} {res} 116.59019  
{txt}        42{c |} {space 3} {res} 663.38127 {space 3} {res}  379.7329 {space 3} {res} 113.76442  
{txt}        43{c |} {space 3} {res} 604.44831 {space 3} {res} 374.32476 {space 3} {res} 111.28209  
{txt}        44{c |} {space 3} {res} 550.75079 {space 3} {res} 369.63567 {space 3} {res} 109.10052  
{txt}        45{c |} {space 3} {res} 501.82361 {space 3} {res} 365.56123 {space 3} {res} 107.18216  
{txt}        46{c |} {space 3} {res} 457.24298 {space 3} {res}  362.0132 {space 3} {res} 105.49406  
{txt}        47{c |} {space 3} {res} 416.62277 {space 3} {res} 358.91691 {space 3} {res} 104.00732  
{txt}        48{c |} {space 3} {res} 379.61115 {space 3} {res} 356.20904 {space 3} {res} 102.69665  
{txt}        49{c |} {space 3} {res} 345.88755 {space 3} {res} 353.83583 {space 3} {res} 101.53998  
{txt}        50{c |} {space 3} {res} 315.15985 {space 3} {res}  352.3553 {space 3} {res} 100.65556  *
{txt}        51{c |} {space 3} {res} 287.16192 {space 3} {res} 356.42305 {space 3} {res} 101.19582  
{txt}        52{c |} {space 3} {res} 261.65124 {space 3} {res} 363.33054 {space 3} {res} 102.75269  
{txt}        53{c |} {space 3} {res} 238.40687 {space 3} {res} 370.44865 {space 3} {res} 105.00085  
{txt}        54{c |} {space 3} {res} 217.22746 {space 3} {res} 372.21202 {space 3} {res} 106.53333  
{txt}        55{c |} {space 3} {res} 197.92957 {space 3} {res} 373.58108 {space 3} {res} 108.17032  
{txt}        56{c |} {space 3} {res} 180.34605 {space 3} {res} 375.89938 {space 3} {res} 109.80358  
{txt}        57{c |} {space 3} {res} 164.32461 {space 3} {res} 378.99098 {space 3} {res} 111.37688  
{txt}        58{c |} {space 3} {res} 149.72646 {space 3} {res} 380.49347 {space 3} {res} 112.55753  
{txt}        59{c |} {space 3} {res} 136.42518 {space 3} {res} 381.08165 {space 3} {res} 113.73224  
{txt}        60{c |} {space 3} {res} 124.30554 {space 3} {res} 381.60207 {space 3} {res} 114.93784  
{txt}        61{c |} {space 3} {res} 113.26258 {space 3} {res} 380.71469 {space 3} {res}  115.6034  
{txt}        62{c |} {space 3} {res} 103.20064 {space 3} {res} 379.53228 {space 3} {res} 116.00241  
{txt}        63{c |} {space 3} {res} 94.032582 {space 3} {res} 380.74666 {space 3} {res} 117.01678  
{txt}        64{c |} {space 3} {res} 85.678986 {space 3} {res} 382.39512 {space 3} {res} 117.92244  
{txt}        65{c |} {space 3} {res} 78.067501 {space 3} {res} 382.00813 {space 3} {res} 118.30133  
{txt}        66{c |} {space 3} {res}   71.1322 {space 3} {res} 379.53614 {space 3} {res} 118.33073  
{txt}        67{c |} {space 3} {res} 64.813011 {space 3} {res} 377.47621 {space 3} {res} 118.59801  
{txt}        68{c |} {space 3} {res} 59.055202 {space 3} {res} 376.71111 {space 3} {res} 119.05724  
{txt}        69{c |} {space 3} {res}   53.8089 {space 3} {res} 376.19828 {space 3} {res} 119.49392  
{txt}        70{c |} {space 3} {res} 49.028666 {space 3} {res} 375.22278 {space 3} {res} 119.97715  
{txt}        71{c |} {space 3} {res} 44.673094 {space 3} {res} 373.26668 {space 3} {res} 120.18322  
{txt}        72{c |} {space 3} {res}  40.70446 {space 3} {res} 372.49455 {space 3} {res} 120.43289  
{txt}        73{c |} {space 3} {res} 37.088388 {space 3} {res} 372.59088 {space 3} {res} 120.82114  
{txt}        74{c |} {space 3} {res} 33.793558 {space 3} {res} 374.04884 {space 3} {res} 121.19229  
{txt}        75{c |} {space 3} {res} 30.791431 {space 3} {res}  377.5105 {space 3} {res} 121.17767  
{txt}        76{c |} {space 3} {res} 28.056005 {space 3} {res} 381.87875 {space 3} {res} 121.00114  
{txt}        77{c |} {space 3} {res} 25.563587 {space 3} {res} 385.86197 {space 3} {res} 120.80072  
{txt}        78{c |} {space 3} {res} 23.292588 {space 3} {res} 389.16575 {space 3} {res} 120.36636  
{txt}        79{c |} {space 3} {res} 21.223339 {space 3} {res} 392.38507 {space 3} {res} 120.08113  
{txt}        80{c |} {space 3} {res} 19.337916 {space 3} {res} 396.88113 {space 3} {res}  120.4689  
{txt}        81{c |} {space 3} {res} 17.619989 {space 3} {res} 402.63139 {space 3} {res} 121.19743  
{txt}        82{c |} {space 3} {res} 16.054678 {space 3} {res} 412.30702 {space 3} {res} 121.83665  
{txt}        83{c |} {space 3} {res} 14.628424 {space 3} {res} 421.09094 {space 3} {res} 121.51485  
{txt}        84{c |} {space 3} {res} 13.328875 {space 3} {res} 426.86241 {space 3} {res}  120.2055  
{txt}        85{c |} {space 3} {res} 12.144775 {space 3} {res} 431.12421 {space 3} {res} 119.04316  
{txt}        86{c |} {space 3} {res} 11.065867 {space 3} {res} 433.74587 {space 3} {res} 118.05604  
{txt}        87{c |} {space 3} {res} 10.082806 {space 3} {res} 436.53986 {space 3} {res} 117.36929  
{txt}        88{c |} {space 3} {res} 9.1870769 {space 3} {res} 439.42206 {space 3} {res} 116.91838  
{txt}        89{c |} {space 3} {res} 8.3709223 {space 3} {res} 442.32753 {space 3} {res} 116.65087  
{txt}        90{c |} {space 3} {res} 7.6272726 {space 3} {res} 445.20676 {space 3} {res}  116.5244  
{txt}        91{c |} {space 3} {res} 6.9496867 {space 3} {res} 448.02273 {space 3} {res} 116.50501  
{txt}        92{c |} {space 3} {res} 6.3322957 {space 3} {res} 450.74836 {space 3} {res} 116.56561  
{txt}        93{c |} {space 3} {res}  5.769752 {space 3} {res} 453.36455 {space 3} {res} 116.68474  
{txt}        94{c |} {space 3} {res} 5.2571831 {space 3} {res} 455.85849 {space 3} {res} 116.84547  
{txt}        95{c |} {space 3} {res} 4.7901495 {space 3} {res} 458.22233 {space 3} {res} 117.03456  
{txt}        96{c |} {space 3} {res} 4.3646058 {space 3} {res} 460.45211 {space 3} {res} 117.24169  
{txt}        97{c |} {space 3} {res} 3.9768663 {space 3} {res} 462.54684 {space 3} {res} 117.45892  
{txt}        98{c |} {space 3} {res} 3.6235724 {space 3} {res} 464.50782 {space 3} {res} 117.68017  
{txt}        99{c |} {space 3} {res} 3.3016642 {space 3} {res} 466.33804 {space 3} {res} 117.90088  
{txt}       100{c |} {space 3} {res} 3.0083535 {space 3} {res} 468.04174 {space 3} {res} 118.11764  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=20.79 12:07:03

{com}. // we should have 144-130=14 folds
. assert 14==`e(nfolds)'
{txt}r; t=0.00 12:07:03

{com}. 
. cvlasso air L(1/12).air, rolling origin(130) h(2)
{txt}Rolling forecasting cross-validation with 2-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (132), 13-131 (133), 13-132 (134), 13-133 (135), 13-134 (136), 13-135 (137), 13-136 (138), 13-137 (139), 13-138 (140), 13-139 (141), 13-140 (142), 13-141 (143), 13-142 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 30083.535 {space 3} {res} 34952.233 {space 3} {res} 8972.5481  
{txt}         2{c |} {space 3} {res} 27410.996 {space 3} {res} 29219.469 {space 3} {res} 7495.1704  
{txt}         3{c |} {space 3} {res} 24975.879 {space 3} {res} 24447.167 {space 3} {res} 6266.3552  
{txt}         4{c |} {space 3} {res} 22757.091 {space 3} {res} 20473.399 {space 3} {res} 5244.0824  
{txt}         5{c |} {space 3} {res} 20735.414 {space 3} {res} 17163.629 {space 3} {res} 4393.4479  
{txt}         6{c |} {space 3} {res} 18893.337 {space 3} {res}  14406.07 {space 3} {res}  3685.457  
{txt}         7{c |} {space 3} {res} 17214.905 {space 3} {res} 12107.831 {space 3} {res} 3096.0221  
{txt}         8{c |} {space 3} {res}  15685.58 {space 3} {res} 10191.716 {space 3} {res} 2605.1314  
{txt}         9{c |} {space 3} {res} 14292.116 {space 3} {res} 8593.5634 {space 3} {res} 2196.1576  
{txt}        10{c |} {space 3} {res} 13022.444 {space 3} {res}  7260.043 {space 3} {res} 1855.2848  
{txt}        11{c |} {space 3} {res} 11865.566 {space 3} {res} 6146.8207 {space 3} {res} 1571.0323  
{txt}        12{c |} {space 3} {res} 10811.462 {space 3} {res} 5217.0365 {space 3} {res} 1333.8591  
{txt}        13{c |} {space 3} {res} 9851.0014 {space 3} {res} 4440.0404 {space 3} {res}  1135.836  
{txt}        14{c |} {space 3} {res} 8975.8656 {space 3} {res} 3792.7368 {space 3} {res} 974.00243  
{txt}        15{c |} {space 3} {res} 8178.4744 {space 3} {res} 3245.1003 {space 3} {res} 846.71514  
{txt}        16{c |} {space 3} {res} 7451.9213 {space 3} {res} 2784.0987 {space 3} {res}  739.5864  
{txt}        17{c |} {space 3} {res} 6789.9131 {space 3} {res} 2399.2025 {space 3} {res} 650.14159  
{txt}        18{c |} {space 3} {res}  6186.716 {space 3} {res} 2077.6828 {space 3} {res} 575.22206  
{txt}        19{c |} {space 3} {res} 5637.1052 {space 3} {res} 1808.9545 {space 3} {res} 512.22553  
{txt}        20{c |} {space 3} {res} 5136.3203 {space 3} {res} 1584.2142 {space 3} {res} 459.01598  
{txt}        21{c |} {space 3} {res} 4680.0237 {space 3} {res} 1396.1389 {space 3} {res} 413.84709  
{txt}        22{c |} {space 3} {res} 4264.2633 {space 3} {res} 1238.6362 {space 3} {res} 375.29686  
{txt}        23{c |} {space 3} {res} 3885.4379 {space 3} {res} 1106.6361 {space 3} {res} 342.21155  
{txt}        24{c |} {space 3} {res} 3540.2663 {space 3} {res} 995.91868 {space 3} {res} 313.65775  
{txt}        25{c |} {space 3} {res} 3225.7588 {space 3} {res} 902.97087 {space 3} {res} 288.88156  
{txt}        26{c |} {space 3} {res} 2939.1913 {space 3} {res} 825.34561 {space 3} {res} 267.17892  
{txt}        27{c |} {space 3} {res} 2678.0817 {space 3} {res} 760.38714 {space 3} {res} 248.10453  
{txt}        28{c |} {space 3} {res} 2440.1683 {space 3} {res} 703.31872 {space 3} {res} 230.76798  
{txt}        29{c |} {space 3} {res} 2223.3904 {space 3} {res} 654.06491 {space 3} {res} 214.98796  
{txt}        30{c |} {space 3} {res} 2025.8706 {space 3} {res} 611.52854 {space 3} {res} 200.84841  
{txt}        31{c |} {space 3} {res} 1845.8978 {space 3} {res}  575.5412 {space 3} {res} 188.40654  
{txt}        32{c |} {space 3} {res} 1681.9133 {space 3} {res} 545.05078 {space 3} {res} 177.45417  
{txt}        33{c |} {space 3} {res} 1532.4968 {space 3} {res} 519.17845 {space 3} {res} 167.81145  
{txt}        34{c |} {space 3} {res}  1396.354 {space 3} {res} 497.18977 {space 3} {res} 159.32199  
{txt}        35{c |} {space 3} {res} 1272.3058 {space 3} {res} 478.47059 {space 3} {res} 151.84907  ^
{txt}        36{c |} {space 3} {res} 1159.2776 {space 3} {res}   462.507 {space 3} {res} 145.27259  
{txt}        37{c |} {space 3} {res} 1056.2906 {space 3} {res}  448.8687 {space 3} {res} 139.48664  
{txt}        38{c |} {space 3} {res} 962.45264 {space 3} {res}  437.1951 {space 3} {res} 134.39758  
{txt}        39{c |} {space 3} {res}   876.951 {space 3} {res}  427.1838 {space 3} {res} 129.92244  
{txt}        40{c |} {space 3} {res} 799.04509 {space 3} {res} 418.58096 {space 3} {res}  125.9877  
{txt}        41{c |} {space 3} {res} 728.06013 {space 3} {res} 411.17333 {space 3} {res} 122.52817  
{txt}        42{c |} {space 3} {res} 663.38127 {space 3} {res} 404.78156 {space 3} {res} 119.48615  
{txt}        43{c |} {space 3} {res} 604.44831 {space 3} {res} 399.25467 {space 3} {res} 116.81057  
{txt}        44{c |} {space 3} {res} 550.75079 {space 3} {res} 394.46537 {space 3} {res} 114.45638  
{txt}        45{c |} {space 3} {res} 501.82361 {space 3} {res} 390.30629 {space 3} {res} 112.38385  
{txt}        46{c |} {space 3} {res} 457.24298 {space 3} {res} 386.68666 {space 3} {res} 110.55804  
{txt}        47{c |} {space 3} {res} 416.62277 {space 3} {res} 383.52972 {space 3} {res}  108.9483  
{txt}        48{c |} {space 3} {res} 379.61115 {space 3} {res} 380.77038 {space 3} {res} 107.52773  
{txt}        49{c |} {space 3} {res} 345.88755 {space 3} {res} 378.35345 {space 3} {res} 106.27284  
{txt}        50{c |} {space 3} {res} 315.15985 {space 3} {res} 377.24088 {space 3} {res} 105.38259  *
{txt}        51{c |} {space 3} {res} 287.16192 {space 3} {res} 382.01408 {space 3} {res} 105.95963  
{txt}        52{c |} {space 3} {res} 261.65124 {space 3} {res} 389.65489 {space 3} {res}  107.7111  
{txt}        53{c |} {space 3} {res} 238.40687 {space 3} {res} 396.94246 {space 3} {res} 110.12192  
{txt}        54{c |} {space 3} {res} 217.22746 {space 3} {res} 398.32045 {space 3} {res}  111.7516  
{txt}        55{c |} {space 3} {res} 197.92957 {space 3} {res} 399.72318 {space 3} {res} 113.59134  
{txt}        56{c |} {space 3} {res} 180.34605 {space 3} {res} 401.75368 {space 3} {res} 115.49682  
{txt}        57{c |} {space 3} {res} 164.32461 {space 3} {res} 404.46026 {space 3} {res}  117.3465  
{txt}        58{c |} {space 3} {res} 149.72646 {space 3} {res} 405.28304 {space 3} {res} 118.73463  
{txt}        59{c |} {space 3} {res} 136.42518 {space 3} {res}  405.2511 {space 3} {res}  120.1721  
{txt}        60{c |} {space 3} {res} 124.30554 {space 3} {res}  405.2761 {space 3} {res} 121.62263  
{txt}        61{c |} {space 3} {res} 113.26258 {space 3} {res} 403.59011 {space 3} {res} 122.41581  
{txt}        62{c |} {space 3} {res} 103.20064 {space 3} {res} 401.82587 {space 3} {res} 122.98928  
{txt}        63{c |} {space 3} {res} 94.032582 {space 3} {res} 402.94599 {space 3} {res} 124.26148  
{txt}        64{c |} {space 3} {res} 85.678986 {space 3} {res} 404.20592 {space 3} {res} 125.21789  
{txt}        65{c |} {space 3} {res} 78.067501 {space 3} {res} 403.68408 {space 3} {res} 125.62712  
{txt}        66{c |} {space 3} {res}   71.1322 {space 3} {res} 400.91215 {space 3} {res}   125.645  
{txt}        67{c |} {space 3} {res} 64.813011 {space 3} {res}  398.9517 {space 3} {res} 126.02457  
{txt}        68{c |} {space 3} {res} 59.055202 {space 3} {res} 397.76927 {space 3} {res} 126.60418  
{txt}        69{c |} {space 3} {res}   53.8089 {space 3} {res} 396.84309 {space 3} {res} 127.16789  
{txt}        70{c |} {space 3} {res} 49.028666 {space 3} {res} 395.36465 {space 3} {res} 127.77929  
{txt}        71{c |} {space 3} {res} 44.673094 {space 3} {res} 392.86311 {space 3} {res} 128.06787  
{txt}        72{c |} {space 3} {res}  40.70446 {space 3} {res} 391.49787 {space 3} {res} 128.48992  
{txt}        73{c |} {space 3} {res} 37.088388 {space 3} {res} 391.07007 {space 3} {res} 129.00451  
{txt}        74{c |} {space 3} {res} 33.793558 {space 3} {res} 392.16177 {space 3} {res} 129.49754  
{txt}        75{c |} {space 3} {res} 30.791431 {space 3} {res} 395.08297 {space 3} {res} 129.54637  
{txt}        76{c |} {space 3} {res} 28.056005 {space 3} {res} 398.32513 {space 3} {res} 129.52706  
{txt}        77{c |} {space 3} {res} 25.563587 {space 3} {res} 401.15399 {space 3} {res} 129.44648  
{txt}        78{c |} {space 3} {res} 23.292588 {space 3} {res} 403.24593 {space 3} {res} 129.10851  
{txt}        79{c |} {space 3} {res} 21.223339 {space 3} {res} 405.54289 {space 3} {res} 128.94792  
{txt}        80{c |} {space 3} {res} 19.337916 {space 3} {res} 409.33005 {space 3} {res} 129.52204  
{txt}        81{c |} {space 3} {res} 17.619989 {space 3} {res} 414.58055 {space 3} {res} 130.50225  
{txt}        82{c |} {space 3} {res} 16.054678 {space 3} {res} 423.29174 {space 3} {res} 131.10197  
{txt}        83{c |} {space 3} {res} 14.628424 {space 3} {res} 431.51624 {space 3} {res} 130.67818  
{txt}        84{c |} {space 3} {res} 13.328875 {space 3} {res} 436.86415 {space 3} {res} 129.31034  
{txt}        85{c |} {space 3} {res} 12.144775 {space 3} {res} 440.37741 {space 3} {res} 128.09369  
{txt}        86{c |} {space 3} {res} 11.065867 {space 3} {res} 442.49849 {space 3} {res} 127.09852  
{txt}        87{c |} {space 3} {res} 10.082806 {space 3} {res} 444.85132 {space 3} {res} 126.41494  
{txt}        88{c |} {space 3} {res} 9.1870769 {space 3} {res} 447.34397 {space 3} {res} 125.97551  
{txt}        89{c |} {space 3} {res} 8.3709223 {space 3} {res}  449.9048 {space 3} {res} 125.72547  
{txt}        90{c |} {space 3} {res} 7.6272726 {space 3} {res} 452.47857 {space 3} {res} 125.62067  
{txt}        91{c |} {space 3} {res} 6.9496867 {space 3} {res} 455.02332 {space 3} {res} 125.62572  
{txt}        92{c |} {space 3} {res} 6.3322957 {space 3} {res} 457.50773 {space 3} {res} 125.71243  
{txt}        93{c |} {space 3} {res}  5.769752 {space 3} {res} 459.90901 {space 3} {res} 125.85849  
{txt}        94{c |} {space 3} {res} 5.2571831 {space 3} {res} 462.21121 {space 3} {res} 126.04634  
{txt}        95{c |} {space 3} {res} 4.7901495 {space 3} {res} 464.40372 {space 3} {res} 126.26225  
{txt}        96{c |} {space 3} {res} 4.3646058 {space 3} {res} 466.48019 {space 3} {res} 126.49555  
{txt}        97{c |} {space 3} {res} 3.9768663 {space 3} {res} 468.43756 {space 3} {res} 126.73804  
{txt}        98{c |} {space 3} {res} 3.6235724 {space 3} {res} 470.27531 {space 3} {res} 126.98348  
{txt}        99{c |} {space 3} {res} 3.3016642 {space 3} {res} 471.99485 {space 3} {res} 127.22718  
{txt}       100{c |} {space 3} {res} 3.0083535 {space 3} {res} 473.59904 {space 3} {res} 127.46568  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=19.43 12:07:22

{com}. // we should have 144-130-1=14 folds
. assert 13==`e(nfolds)'
{txt}r; t=0.00 12:07:22

{com}. 
. cvlasso air L(1/12).air, rolling origin(130) fixedwin
{txt}Rolling forecasting cross-validation with 1-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (131), 14-131 (132), 15-132 (133), 16-133 (134), 17-134 (135), 18-135 (136), 19-136 (137), 20-137 (138), 21-138 (139), 22-139 (140), 23-140 (141), 24-141 (142), 25-142 (143), 26-143 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 30083.535 {space 3} {res} 29342.536 {space 3} {res} 7604.6329  
{txt}         2{c |} {space 3} {res} 27410.996 {space 3} {res} 24556.677 {space 3} {res} 6355.4314  
{txt}         3{c |} {space 3} {res} 24975.879 {space 3} {res}  20570.95 {space 3} {res} 5316.2899  
{txt}         4{c |} {space 3} {res} 22757.091 {space 3} {res} 17250.611 {space 3} {res} 4451.7039  
{txt}         5{c |} {space 3} {res} 20735.414 {space 3} {res} 14483.694 {space 3} {res} 3732.1806  
{txt}         6{c |} {space 3} {res} 18893.337 {space 3} {res} 12177.154 {space 3} {res} 3133.2195  
{txt}         7{c |} {space 3} {res} 17214.905 {space 3} {res} 10253.662 {space 3} {res}  2634.466  
{txt}         8{c |} {space 3} {res}  15685.58 {space 3} {res} 8648.9434 {space 3} {res} 2219.0087  
{txt}         9{c |} {space 3} {res} 14292.116 {space 3} {res} 7309.5692 {space 3} {res} 1872.7961  
{txt}        10{c |} {space 3} {res} 13022.444 {space 3} {res} 6191.1202 {space 3} {res} 1584.1517  
{txt}        11{c |} {space 3} {res} 11865.566 {space 3} {res} 5256.6626 {space 3} {res} 1343.3724  
{txt}        12{c |} {space 3} {res} 10811.462 {space 3} {res} 4475.4822 {space 3} {res} 1142.3943  
{txt}        13{c |} {space 3} {res} 9851.0014 {space 3} {res} 3822.0328 {space 3} {res} 974.51561  
{txt}        14{c |} {space 3} {res} 8975.8656 {space 3} {res} 3272.4349 {space 3} {res} 844.16278  
{txt}        15{c |} {space 3} {res} 8178.4744 {space 3} {res} 2805.5335 {space 3} {res} 735.84716  
{txt}        16{c |} {space 3} {res} 7451.9213 {space 3} {res} 2415.5597 {space 3} {res}  645.3886  
{txt}        17{c |} {space 3} {res} 6789.9131 {space 3} {res} 2089.5994 {space 3} {res} 569.63807  
{txt}        18{c |} {space 3} {res}  6186.716 {space 3} {res} 1816.9795 {space 3} {res} 505.97842  
{txt}        19{c |} {space 3} {res} 5637.1052 {space 3} {res} 1588.8216 {space 3} {res} 452.25745  
{txt}        20{c |} {space 3} {res} 5136.3203 {space 3} {res} 1397.7387 {space 3} {res}  406.7116  
{txt}        21{c |} {space 3} {res} 4680.0237 {space 3} {res}  1237.584 {space 3} {res} 367.90116  
{txt}        22{c |} {space 3} {res} 4264.2633 {space 3} {res} 1103.2409 {space 3} {res} 334.65486  
{txt}        23{c |} {space 3} {res} 3885.4379 {space 3} {res} 990.44955 {space 3} {res} 306.02247  
{txt}        24{c |} {space 3} {res} 3540.2663 {space 3} {res}  895.6626 {space 3} {res} 281.23456  
{txt}        25{c |} {space 3} {res} 3225.7588 {space 3} {res} 816.25649 {space 3} {res} 259.59417  
{txt}        26{c |} {space 3} {res} 2939.1913 {space 3} {res} 750.07662 {space 3} {res} 240.58066  
{txt}        27{c |} {space 3} {res} 2678.0817 {space 3} {res} 693.47635 {space 3} {res} 223.73861  
{txt}        28{c |} {space 3} {res} 2440.1683 {space 3} {res} 643.46868 {space 3} {res} 208.49267  
{txt}        29{c |} {space 3} {res} 2223.3904 {space 3} {res} 599.28829 {space 3} {res}  194.5465  
{txt}        30{c |} {space 3} {res} 2025.8706 {space 3} {res} 561.87629 {space 3} {res} 182.29443  
{txt}        31{c |} {space 3} {res} 1845.8978 {space 3} {res}  530.1486 {space 3} {res} 171.52546  
{txt}        32{c |} {space 3} {res} 1681.9133 {space 3} {res} 503.19944 {space 3} {res} 162.05771  
{txt}        33{c |} {space 3} {res} 1532.4968 {space 3} {res} 480.27153 {space 3} {res} 153.73349  
{txt}        34{c |} {space 3} {res}  1396.354 {space 3} {res} 460.73137 {space 3} {res} 146.41531  
{txt}        35{c |} {space 3} {res} 1272.3058 {space 3} {res} 444.04865 {space 3} {res} 139.98272  ^
{txt}        36{c |} {space 3} {res} 1159.2776 {space 3} {res}  429.7791 {space 3} {res} 134.32978  
{txt}        37{c |} {space 3} {res} 1056.2906 {space 3} {res} 417.55025 {space 3} {res} 129.36305  
{txt}        38{c |} {space 3} {res} 962.45264 {space 3} {res} 407.04956 {space 3} {res} 124.99996  
{txt}        39{c |} {space 3} {res}   876.951 {space 3} {res} 398.01456 {space 3} {res} 121.16748  
{txt}        40{c |} {space 3} {res} 799.04509 {space 3} {res} 390.22455 {space 3} {res} 117.80101  
{txt}        41{c |} {space 3} {res} 728.06013 {space 3} {res} 383.49384 {space 3} {res} 114.84345  
{txt}        42{c |} {space 3} {res} 663.38127 {space 3} {res} 377.66597 {space 3} {res}  112.2444  
{txt}        43{c |} {space 3} {res} 604.44831 {space 3} {res} 372.60897 {space 3} {res} 109.95941  
{txt}        44{c |} {space 3} {res} 550.75079 {space 3} {res} 368.21137 {space 3} {res} 107.94939  
{txt}        45{c |} {space 3} {res} 501.82361 {space 3} {res} 364.37892 {space 3} {res} 106.17998  
{txt}        46{c |} {space 3} {res} 457.24298 {space 3} {res} 361.03178 {space 3} {res} 104.62109  
{txt}        47{c |} {space 3} {res} 416.62277 {space 3} {res} 358.10226 {space 3} {res} 103.24635  
{txt}        48{c |} {space 3} {res} 379.61115 {space 3} {res} 355.53282 {space 3} {res} 102.03273  
{txt}        49{c |} {space 3} {res} 345.88755 {space 3} {res} 353.27454 {space 3} {res} 100.96014  *
{txt}        50{c |} {space 3} {res} 315.15985 {space 3} {res} 353.56351 {space 3} {res} 100.54566  
{txt}        51{c |} {space 3} {res} 287.16192 {space 3} {res} 358.15619 {space 3} {res} 101.22159  
{txt}        52{c |} {space 3} {res} 261.65124 {space 3} {res} 365.35705 {space 3} {res} 102.96975  
{txt}        53{c |} {space 3} {res} 238.40687 {space 3} {res} 369.66508 {space 3} {res} 104.79961  
{txt}        54{c |} {space 3} {res} 217.22746 {space 3} {res} 370.95016 {space 3} {res} 106.38565  
{txt}        55{c |} {space 3} {res} 197.92957 {space 3} {res} 372.74966 {space 3} {res} 108.15476  
{txt}        56{c |} {space 3} {res} 180.34605 {space 3} {res} 375.87984 {space 3} {res} 109.75375  
{txt}        57{c |} {space 3} {res} 164.32461 {space 3} {res} 378.13286 {space 3} {res} 111.19205  
{txt}        58{c |} {space 3} {res} 149.72646 {space 3} {res} 379.31752 {space 3} {res} 112.39925  
{txt}        59{c |} {space 3} {res} 136.42518 {space 3} {res} 379.96884 {space 3} {res} 113.65128  
{txt}        60{c |} {space 3} {res} 124.30554 {space 3} {res} 379.47216 {space 3} {res} 114.64207  
{txt}        61{c |} {space 3} {res} 113.26258 {space 3} {res}  378.6107 {space 3} {res}  115.2831  
{txt}        62{c |} {space 3} {res} 103.20064 {space 3} {res} 379.47067 {space 3} {res} 116.07434  
{txt}        63{c |} {space 3} {res} 94.032582 {space 3} {res} 380.87369 {space 3} {res} 116.91882  
{txt}        64{c |} {space 3} {res} 85.678986 {space 3} {res} 382.03715 {space 3} {res} 117.67983  
{txt}        65{c |} {space 3} {res} 78.067501 {space 3} {res} 380.53668 {space 3} {res} 118.00548  
{txt}        66{c |} {space 3} {res}   71.1322 {space 3} {res}   377.904 {space 3} {res}  117.9601  
{txt}        67{c |} {space 3} {res} 64.813011 {space 3} {res} 376.68599 {space 3} {res} 118.51554  
{txt}        68{c |} {space 3} {res} 59.055202 {space 3} {res} 376.04184 {space 3} {res}  118.9979  
{txt}        69{c |} {space 3} {res}   53.8089 {space 3} {res} 375.66725 {space 3} {res} 119.47501  
{txt}        70{c |} {space 3} {res} 49.028666 {space 3} {res} 374.18355 {space 3} {res} 120.01102  
{txt}        71{c |} {space 3} {res} 44.673094 {space 3} {res} 372.68743 {space 3} {res} 120.23184  
{txt}        72{c |} {space 3} {res}  40.70446 {space 3} {res} 372.63601 {space 3} {res} 120.62715  
{txt}        73{c |} {space 3} {res} 37.088388 {space 3} {res} 372.96002 {space 3} {res} 120.98856  
{txt}        74{c |} {space 3} {res} 33.793558 {space 3} {res} 375.67225 {space 3} {res}  121.2765  
{txt}        75{c |} {space 3} {res} 30.791431 {space 3} {res} 379.83266 {space 3} {res} 121.13771  
{txt}        76{c |} {space 3} {res} 28.056005 {space 3} {res} 383.96921 {space 3} {res} 121.02467  
{txt}        77{c |} {space 3} {res} 25.563587 {space 3} {res} 387.82565 {space 3} {res} 120.59418  
{txt}        78{c |} {space 3} {res} 23.292588 {space 3} {res} 391.20473 {space 3} {res} 120.20296  
{txt}        79{c |} {space 3} {res} 21.223339 {space 3} {res} 395.06233 {space 3} {res} 120.19574  
{txt}        80{c |} {space 3} {res} 19.337916 {space 3} {res} 400.12432 {space 3} {res} 120.81217  
{txt}        81{c |} {space 3} {res} 17.619989 {space 3} {res}  408.9831 {space 3} {res} 121.88139  
{txt}        82{c |} {space 3} {res} 16.054678 {space 3} {res} 419.70456 {space 3} {res} 122.19761  
{txt}        83{c |} {space 3} {res} 14.628424 {space 3} {res} 427.29041 {space 3} {res} 121.84983  
{txt}        84{c |} {space 3} {res} 13.328875 {space 3} {res} 432.32449 {space 3} {res} 120.51138  
{txt}        85{c |} {space 3} {res} 12.144775 {space 3} {res} 434.70003 {space 3} {res} 119.27437  
{txt}        86{c |} {space 3} {res} 11.065867 {space 3} {res} 437.29344 {space 3} {res}  118.3797  
{txt}        87{c |} {space 3} {res} 10.082806 {space 3} {res} 440.01255 {space 3} {res} 117.75625  
{txt}        88{c |} {space 3} {res} 9.1870769 {space 3} {res} 442.78574 {space 3} {res} 117.34583  
{txt}        89{c |} {space 3} {res} 8.3709223 {space 3} {res} 445.55799 {space 3} {res} 117.10114  
{txt}        90{c |} {space 3} {res} 7.6272726 {space 3} {res} 448.28774 {space 3} {res} 116.98402  
{txt}        91{c |} {space 3} {res} 6.9496867 {space 3} {res} 450.94415 {space 3} {res} 116.96386  
{txt}        92{c |} {space 3} {res} 6.3322957 {space 3} {res} 453.50503 {space 3} {res} 117.01624  
{txt}        93{c |} {space 3} {res}  5.769752 {space 3} {res}   455.955 {space 3} {res} 117.12177  
{txt}        94{c |} {space 3} {res} 5.2571831 {space 3} {res} 458.28413 {space 3} {res} 117.26519  
{txt}        95{c |} {space 3} {res} 4.7901495 {space 3} {res} 460.48672 {space 3} {res} 117.43449  
{txt}        96{c |} {space 3} {res} 4.3646058 {space 3} {res} 462.56036 {space 3} {res} 117.62036  
{txt}        97{c |} {space 3} {res} 3.9768663 {space 3} {res} 464.50518 {space 3} {res} 117.81559  
{txt}        98{c |} {space 3} {res} 3.6235724 {space 3} {res} 466.32322 {space 3} {res} 118.01467  
{txt}        99{c |} {space 3} {res} 3.3016642 {space 3} {res} 468.01793 {space 3} {res} 118.21343  
{txt}       100{c |} {space 3} {res} 3.0083535 {space 3} {res} 469.59378 {space 3} {res} 118.40879  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=20.52 12:07:43

{com}. assert 14==`e(nfolds)'
{txt}r; t=0.00 12:07:43

{com}. 
. ********************************************************************************
. *** panel example
. ********************************************************************************
. 
. use "http://fmwww.bc.edu/ec-p/data/macro/abdata.dta", clear
{txt}(Layard & Nickell, Unemployment in Britain, Economica 53, 1986 from Ox dist)
r; t=1.10 12:07:44

{com}. 
. // FE and noftools options
. cvlasso ys l(0/3).k l(0/3).n, fe seed(123)

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 46.945458 {space 3} {res} .00843492 {space 3} {res} .00058496  
{txt}         2{c |} {space 3} {res} 42.774952 {space 3} {res} .00813196 {space 3} {res}  .0005897  
{txt}         3{c |} {space 3} {res} 38.974944 {space 3} {res} .00773276 {space 3} {res} .00056315  
{txt}         4{c |} {space 3} {res} 35.512517 {space 3} {res} .00737473 {space 3} {res} .00053581  
{txt}         5{c |} {space 3} {res} 32.357683 {space 3} {res} .00706573 {space 3} {res}  .0005092  
{txt}         6{c |} {space 3} {res} 29.483116 {space 3} {res}  .0068078 {space 3} {res}  .0004852  
{txt}         7{c |} {space 3} {res} 26.863917 {space 3} {res} .00659238 {space 3} {res}  .0004636  
{txt}         8{c |} {space 3} {res}   24.4774 {space 3} {res} .00641237 {space 3} {res} .00044421  
{txt}         9{c |} {space 3} {res} 22.302896 {space 3} {res} .00626186 {space 3} {res} .00042685  
{txt}        10{c |} {space 3} {res} 20.321568 {space 3} {res} .00613594 {space 3} {res} .00041134  
{txt}        11{c |} {space 3} {res} 18.516256 {space 3} {res} .00603053 {space 3} {res} .00039754  
{txt}        12{c |} {space 3} {res} 16.871323 {space 3} {res}  .0059422 {space 3} {res} .00038527  
{txt}        13{c |} {space 3} {res} 15.372521 {space 3} {res} .00586815 {space 3} {res} .00037439  
{txt}        14{c |} {space 3} {res} 14.006868 {space 3} {res} .00580767 {space 3} {res} .00036394  
{txt}        15{c |} {space 3} {res} 12.762537 {space 3} {res} .00575894 {space 3} {res} .00035376  
{txt}        16{c |} {space 3} {res} 11.628748 {space 3} {res} .00571635 {space 3} {res} .00034367  
{txt}        17{c |} {space 3} {res} 10.595682 {space 3} {res} .00567365 {space 3} {res} .00033312  
{txt}        18{c |} {space 3} {res} 9.6543911 {space 3} {res} .00563169 {space 3} {res} .00032285  
{txt}        19{c |} {space 3} {res} 8.7967216 {space 3} {res} .00558916 {space 3} {res} .00031273  ^
{txt}        20{c |} {space 3} {res} 8.0152451 {space 3} {res} .00555189 {space 3} {res} .00030398  
{txt}        21{c |} {space 3} {res} 7.3031928 {space 3} {res} .00551614 {space 3} {res} .00029582  
{txt}        22{c |} {space 3} {res} 6.6543973 {space 3} {res}  .0054842 {space 3} {res} .00028853  
{txt}        23{c |} {space 3} {res}  6.063239 {space 3} {res} .00545554 {space 3} {res} .00028109  
{txt}        24{c |} {space 3} {res} 5.5245976 {space 3} {res} .00543376 {space 3} {res} .00027373  
{txt}        25{c |} {space 3} {res} 5.0338075 {space 3} {res} .00541646 {space 3} {res} .00026706  
{txt}        26{c |} {space 3} {res} 4.5866179 {space 3} {res} .00540234 {space 3} {res} .00026121  
{txt}        27{c |} {space 3} {res} 4.1791554 {space 3} {res} .00539083 {space 3} {res} .00025608  
{txt}        28{c |} {space 3} {res} 3.8078908 {space 3} {res} .00538147 {space 3} {res} .00025161  
{txt}        29{c |} {space 3} {res} 3.4696083 {space 3} {res} .00537447 {space 3} {res} .00024786  
{txt}        30{c |} {space 3} {res} 3.1613778 {space 3} {res} .00536953 {space 3} {res} .00024474  
{txt}        31{c |} {space 3} {res} 2.8805297 {space 3} {res} .00536569 {space 3} {res} .00024204  
{txt}        32{c |} {space 3} {res} 2.6246314 {space 3} {res} .00536274 {space 3} {res}  .0002397  
{txt}        33{c |} {space 3} {res} 2.3914664 {space 3} {res} .00536129 {space 3} {res} .00023773  
{txt}        34{c |} {space 3} {res} 2.1790151 {space 3} {res}  .0053607 {space 3} {res} .00023603  
{txt}        35{c |} {space 3} {res} 1.9854374 {space 3} {res} .00536049 {space 3} {res} .00023456  *
{txt}        36{c |} {space 3} {res} 1.8090566 {space 3} {res}  .0053616 {space 3} {res} .00023354  
{txt}        37{c |} {space 3} {res}  1.648345 {space 3} {res} .00536378 {space 3} {res} .00023229  
{txt}        38{c |} {space 3} {res} 1.5019106 {space 3} {res} .00536851 {space 3} {res} .00023011  
{txt}        39{c |} {space 3} {res}  1.368485 {space 3} {res}  .0053741 {space 3} {res} .00022843  
{txt}        40{c |} {space 3} {res} 1.2469126 {space 3} {res} .00537969 {space 3} {res} .00022697  
{txt}        41{c |} {space 3} {res} 1.1361403 {space 3} {res} .00538588 {space 3} {res} .00022581  
{txt}        42{c |} {space 3} {res} 1.0352087 {space 3} {res} .00539219 {space 3} {res} .00022482  
{txt}        43{c |} {space 3} {res} .94324363 {space 3} {res} .00539811 {space 3} {res} .00022394  
{txt}        44{c |} {space 3} {res} .85944846 {space 3} {res} .00540365 {space 3} {res} .00022315  
{txt}        45{c |} {space 3} {res} .78309743 {space 3} {res} .00540967 {space 3} {res} .00022263  
{txt}        46{c |} {space 3} {res} .71352921 {space 3} {res}  .0054163 {space 3} {res} .00022214  
{txt}        47{c |} {space 3} {res} .65014124 {space 3} {res} .00542284 {space 3} {res} .00022161  
{txt}        48{c |} {space 3} {res} .59238449 {space 3} {res} .00542904 {space 3} {res} .00022113  
{txt}        49{c |} {space 3} {res} .53975868 {space 3} {res} .00543495 {space 3} {res} .00022071  
{txt}        50{c |} {space 3} {res} .49180801 {space 3} {res} .00544044 {space 3} {res} .00022032  
{txt}        51{c |} {space 3} {res} .44811714 {space 3} {res} .00544564 {space 3} {res} .00021997  
{txt}        52{c |} {space 3} {res} .40830765 {space 3} {res} .00545055 {space 3} {res} .00021963  
{txt}        53{c |} {space 3} {res} .37203472 {space 3} {res}   .005455 {space 3} {res} .00021921  
{txt}        54{c |} {space 3} {res} .33898418 {space 3} {res} .00545904 {space 3} {res} .00021881  
{txt}        55{c |} {space 3} {res} .30886976 {space 3} {res}  .0054628 {space 3} {res} .00021846  
{txt}        56{c |} {space 3} {res} .28143062 {space 3} {res}  .0054662 {space 3} {res} .00021811  
{txt}        57{c |} {space 3} {res}  .2564291 {space 3} {res} .00546937 {space 3} {res} .00021779  
{txt}        58{c |} {space 3} {res} .23364865 {space 3} {res} .00547234 {space 3} {res} .00021749  
{txt}        59{c |} {space 3} {res} .21289195 {space 3} {res} .00547504 {space 3} {res} .00021723  
{txt}        60{c |} {space 3} {res} .19397921 {space 3} {res} .00547749 {space 3} {res}   .000217  
{txt}        61{c |} {space 3} {res} .17674663 {space 3} {res} .00547977 {space 3} {res}  .0002168  
{txt}        62{c |} {space 3} {res} .16104495 {space 3} {res} .00548186 {space 3} {res} .00021661  
{txt}        63{c |} {space 3} {res} .14673816 {space 3} {res} .00548379 {space 3} {res} .00021644  
{txt}        64{c |} {space 3} {res} .13370235 {space 3} {res} .00548544 {space 3} {res} .00021626  
{txt}        65{c |} {space 3} {res}  .1218246 {space 3} {res} .00548693 {space 3} {res} .00021611  
{txt}        66{c |} {space 3} {res} .11100204 {space 3} {res}  .0054883 {space 3} {res} .00021597  
{txt}        67{c |} {space 3} {res} .10114092 {space 3} {res} .00548956 {space 3} {res} .00021584  
{txt}        68{c |} {space 3} {res} .09215584 {space 3} {res}  .0054907 {space 3} {res} .00021572  
{txt}        69{c |} {space 3} {res} .08396897 {space 3} {res} .00549175 {space 3} {res} .00021561  
{txt}        70{c |} {space 3} {res}  .0765094 {space 3} {res} .00549272 {space 3} {res} .00021552  
{txt}        71{c |} {space 3} {res} .06971251 {space 3} {res}  .0054936 {space 3} {res} .00021543  
{txt}        72{c |} {space 3} {res} .06351945 {space 3} {res}  .0054944 {space 3} {res} .00021535  
{txt}        73{c |} {space 3} {res} .05787655 {space 3} {res} .00549514 {space 3} {res} .00021528  
{txt}        74{c |} {space 3} {res} .05273496 {space 3} {res} .00549581 {space 3} {res} .00021521  
{txt}        75{c |} {space 3} {res} .04805013 {space 3} {res} .00549642 {space 3} {res} .00021515  
{txt}        76{c |} {space 3} {res} .04378149 {space 3} {res} .00549698 {space 3} {res}  .0002151  
{txt}        77{c |} {space 3} {res} .03989206 {space 3} {res}  .0054975 {space 3} {res} .00021505  
{txt}        78{c |} {space 3} {res} .03634816 {space 3} {res} .00549796 {space 3} {res}   .000215  
{txt}        79{c |} {space 3} {res} .03311909 {space 3} {res} .00549839 {space 3} {res} .00021496  
{txt}        80{c |} {space 3} {res} .03017688 {space 3} {res} .00549878 {space 3} {res} .00021493  
{txt}        81{c |} {space 3} {res} .02749605 {space 3} {res} .00549914 {space 3} {res} .00021489  
{txt}        82{c |} {space 3} {res} .02505338 {space 3} {res} .00549946 {space 3} {res} .00021486  
{txt}        83{c |} {space 3} {res} .02282771 {space 3} {res} .00549976 {space 3} {res} .00021483  
{txt}        84{c |} {space 3} {res} .02079976 {space 3} {res} .00550003 {space 3} {res} .00021481  
{txt}        85{c |} {space 3} {res} .01895196 {space 3} {res} .00550027 {space 3} {res} .00021478  
{txt}        86{c |} {space 3} {res} .01726832 {space 3} {res}  .0055005 {space 3} {res} .00021476  
{txt}        87{c |} {space 3} {res} .01573425 {space 3} {res}  .0055007 {space 3} {res} .00021474  
{txt}        88{c |} {space 3} {res} .01433646 {space 3} {res} .00550089 {space 3} {res} .00021472  
{txt}        89{c |} {space 3} {res} .01306285 {space 3} {res} .00550106 {space 3} {res} .00021471  
{txt}        90{c |} {space 3} {res} .01190238 {space 3} {res} .00550121 {space 3} {res} .00021469  
{txt}        91{c |} {space 3} {res} .01084501 {space 3} {res} .00550136 {space 3} {res} .00021468  
{txt}        92{c |} {space 3} {res} .00988157 {space 3} {res} .00550148 {space 3} {res} .00021467  
{txt}        93{c |} {space 3} {res} .00900372 {space 3} {res}  .0055016 {space 3} {res} .00021466  
{txt}        94{c |} {space 3} {res} .00820385 {space 3} {res} .00550171 {space 3} {res} .00021465  
{txt}        95{c |} {space 3} {res} .00747504 {space 3} {res} .00550181 {space 3} {res} .00021464  
{txt}        96{c |} {space 3} {res} .00681098 {space 3} {res}  .0055019 {space 3} {res} .00021463  
{txt}        97{c |} {space 3} {res} .00620591 {space 3} {res} .00550198 {space 3} {res} .00021462  
{txt}        98{c |} {space 3} {res}  .0056546 {space 3} {res} .00550205 {space 3} {res} .00021461  
{txt}        99{c |} {space 3} {res} .00515226 {space 3} {res} .00550212 {space 3} {res} .00021461  
{txt}       100{c |} {space 3} {res} .00469455 {space 3} {res} .00550218 {space 3} {res}  .0002146  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=1.83 12:07:46

{com}. savedresults save ftools e()
{txt}r; t=0.01 12:07:46

{com}. cap noi assert "`e(noftools)'"==""  // will be error if ftools not installed
{txt}r; t=0.00 12:07:46

{com}. cvlasso ys l(0/3).k l(0/3).n, fe seed(123) noftools

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 46.945458 {space 3} {res} .00843492 {space 3} {res} .00058496  
{txt}         2{c |} {space 3} {res} 42.774952 {space 3} {res} .00813196 {space 3} {res}  .0005897  
{txt}         3{c |} {space 3} {res} 38.974944 {space 3} {res} .00773276 {space 3} {res} .00056315  
{txt}         4{c |} {space 3} {res} 35.512517 {space 3} {res} .00737473 {space 3} {res} .00053581  
{txt}         5{c |} {space 3} {res} 32.357683 {space 3} {res} .00706573 {space 3} {res}  .0005092  
{txt}         6{c |} {space 3} {res} 29.483116 {space 3} {res}  .0068078 {space 3} {res}  .0004852  
{txt}         7{c |} {space 3} {res} 26.863917 {space 3} {res} .00659238 {space 3} {res}  .0004636  
{txt}         8{c |} {space 3} {res}   24.4774 {space 3} {res} .00641237 {space 3} {res} .00044421  
{txt}         9{c |} {space 3} {res} 22.302896 {space 3} {res} .00626186 {space 3} {res} .00042685  
{txt}        10{c |} {space 3} {res} 20.321568 {space 3} {res} .00613594 {space 3} {res} .00041134  
{txt}        11{c |} {space 3} {res} 18.516256 {space 3} {res} .00603053 {space 3} {res} .00039754  
{txt}        12{c |} {space 3} {res} 16.871323 {space 3} {res}  .0059422 {space 3} {res} .00038527  
{txt}        13{c |} {space 3} {res} 15.372521 {space 3} {res} .00586815 {space 3} {res} .00037439  
{txt}        14{c |} {space 3} {res} 14.006868 {space 3} {res} .00580767 {space 3} {res} .00036394  
{txt}        15{c |} {space 3} {res} 12.762537 {space 3} {res} .00575894 {space 3} {res} .00035376  
{txt}        16{c |} {space 3} {res} 11.628748 {space 3} {res} .00571635 {space 3} {res} .00034367  
{txt}        17{c |} {space 3} {res} 10.595682 {space 3} {res} .00567365 {space 3} {res} .00033312  
{txt}        18{c |} {space 3} {res} 9.6543911 {space 3} {res} .00563169 {space 3} {res} .00032285  
{txt}        19{c |} {space 3} {res} 8.7967216 {space 3} {res} .00558916 {space 3} {res} .00031273  ^
{txt}        20{c |} {space 3} {res} 8.0152451 {space 3} {res} .00555189 {space 3} {res} .00030398  
{txt}        21{c |} {space 3} {res} 7.3031928 {space 3} {res} .00551614 {space 3} {res} .00029582  
{txt}        22{c |} {space 3} {res} 6.6543973 {space 3} {res}  .0054842 {space 3} {res} .00028853  
{txt}        23{c |} {space 3} {res}  6.063239 {space 3} {res} .00545554 {space 3} {res} .00028109  
{txt}        24{c |} {space 3} {res} 5.5245976 {space 3} {res} .00543376 {space 3} {res} .00027373  
{txt}        25{c |} {space 3} {res} 5.0338075 {space 3} {res} .00541646 {space 3} {res} .00026706  
{txt}        26{c |} {space 3} {res} 4.5866179 {space 3} {res} .00540234 {space 3} {res} .00026121  
{txt}        27{c |} {space 3} {res} 4.1791554 {space 3} {res} .00539083 {space 3} {res} .00025608  
{txt}        28{c |} {space 3} {res} 3.8078908 {space 3} {res} .00538147 {space 3} {res} .00025161  
{txt}        29{c |} {space 3} {res} 3.4696083 {space 3} {res} .00537447 {space 3} {res} .00024786  
{txt}        30{c |} {space 3} {res} 3.1613778 {space 3} {res} .00536953 {space 3} {res} .00024474  
{txt}        31{c |} {space 3} {res} 2.8805297 {space 3} {res} .00536569 {space 3} {res} .00024204  
{txt}        32{c |} {space 3} {res} 2.6246314 {space 3} {res} .00536274 {space 3} {res}  .0002397  
{txt}        33{c |} {space 3} {res} 2.3914664 {space 3} {res} .00536129 {space 3} {res} .00023773  
{txt}        34{c |} {space 3} {res} 2.1790151 {space 3} {res}  .0053607 {space 3} {res} .00023603  
{txt}        35{c |} {space 3} {res} 1.9854374 {space 3} {res} .00536049 {space 3} {res} .00023456  *
{txt}        36{c |} {space 3} {res} 1.8090566 {space 3} {res}  .0053616 {space 3} {res} .00023354  
{txt}        37{c |} {space 3} {res}  1.648345 {space 3} {res} .00536378 {space 3} {res} .00023229  
{txt}        38{c |} {space 3} {res} 1.5019106 {space 3} {res} .00536851 {space 3} {res} .00023011  
{txt}        39{c |} {space 3} {res}  1.368485 {space 3} {res}  .0053741 {space 3} {res} .00022843  
{txt}        40{c |} {space 3} {res} 1.2469126 {space 3} {res} .00537969 {space 3} {res} .00022697  
{txt}        41{c |} {space 3} {res} 1.1361403 {space 3} {res} .00538588 {space 3} {res} .00022581  
{txt}        42{c |} {space 3} {res} 1.0352087 {space 3} {res} .00539219 {space 3} {res} .00022482  
{txt}        43{c |} {space 3} {res} .94324363 {space 3} {res} .00539811 {space 3} {res} .00022394  
{txt}        44{c |} {space 3} {res} .85944846 {space 3} {res} .00540365 {space 3} {res} .00022315  
{txt}        45{c |} {space 3} {res} .78309743 {space 3} {res} .00540967 {space 3} {res} .00022263  
{txt}        46{c |} {space 3} {res} .71352921 {space 3} {res}  .0054163 {space 3} {res} .00022214  
{txt}        47{c |} {space 3} {res} .65014124 {space 3} {res} .00542284 {space 3} {res} .00022161  
{txt}        48{c |} {space 3} {res} .59238449 {space 3} {res} .00542904 {space 3} {res} .00022113  
{txt}        49{c |} {space 3} {res} .53975868 {space 3} {res} .00543495 {space 3} {res} .00022071  
{txt}        50{c |} {space 3} {res} .49180801 {space 3} {res} .00544044 {space 3} {res} .00022032  
{txt}        51{c |} {space 3} {res} .44811714 {space 3} {res} .00544564 {space 3} {res} .00021997  
{txt}        52{c |} {space 3} {res} .40830765 {space 3} {res} .00545055 {space 3} {res} .00021963  
{txt}        53{c |} {space 3} {res} .37203472 {space 3} {res}   .005455 {space 3} {res} .00021921  
{txt}        54{c |} {space 3} {res} .33898418 {space 3} {res} .00545904 {space 3} {res} .00021881  
{txt}        55{c |} {space 3} {res} .30886976 {space 3} {res}  .0054628 {space 3} {res} .00021846  
{txt}        56{c |} {space 3} {res} .28143062 {space 3} {res}  .0054662 {space 3} {res} .00021811  
{txt}        57{c |} {space 3} {res}  .2564291 {space 3} {res} .00546937 {space 3} {res} .00021779  
{txt}        58{c |} {space 3} {res} .23364865 {space 3} {res} .00547234 {space 3} {res} .00021749  
{txt}        59{c |} {space 3} {res} .21289195 {space 3} {res} .00547504 {space 3} {res} .00021723  
{txt}        60{c |} {space 3} {res} .19397921 {space 3} {res} .00547749 {space 3} {res}   .000217  
{txt}        61{c |} {space 3} {res} .17674663 {space 3} {res} .00547977 {space 3} {res}  .0002168  
{txt}        62{c |} {space 3} {res} .16104495 {space 3} {res} .00548186 {space 3} {res} .00021661  
{txt}        63{c |} {space 3} {res} .14673816 {space 3} {res} .00548379 {space 3} {res} .00021644  
{txt}        64{c |} {space 3} {res} .13370235 {space 3} {res} .00548544 {space 3} {res} .00021626  
{txt}        65{c |} {space 3} {res}  .1218246 {space 3} {res} .00548693 {space 3} {res} .00021611  
{txt}        66{c |} {space 3} {res} .11100204 {space 3} {res}  .0054883 {space 3} {res} .00021597  
{txt}        67{c |} {space 3} {res} .10114092 {space 3} {res} .00548956 {space 3} {res} .00021584  
{txt}        68{c |} {space 3} {res} .09215584 {space 3} {res}  .0054907 {space 3} {res} .00021572  
{txt}        69{c |} {space 3} {res} .08396897 {space 3} {res} .00549175 {space 3} {res} .00021561  
{txt}        70{c |} {space 3} {res}  .0765094 {space 3} {res} .00549272 {space 3} {res} .00021552  
{txt}        71{c |} {space 3} {res} .06971251 {space 3} {res}  .0054936 {space 3} {res} .00021543  
{txt}        72{c |} {space 3} {res} .06351945 {space 3} {res}  .0054944 {space 3} {res} .00021535  
{txt}        73{c |} {space 3} {res} .05787655 {space 3} {res} .00549514 {space 3} {res} .00021528  
{txt}        74{c |} {space 3} {res} .05273496 {space 3} {res} .00549581 {space 3} {res} .00021521  
{txt}        75{c |} {space 3} {res} .04805013 {space 3} {res} .00549642 {space 3} {res} .00021515  
{txt}        76{c |} {space 3} {res} .04378149 {space 3} {res} .00549698 {space 3} {res}  .0002151  
{txt}        77{c |} {space 3} {res} .03989206 {space 3} {res}  .0054975 {space 3} {res} .00021505  
{txt}        78{c |} {space 3} {res} .03634816 {space 3} {res} .00549796 {space 3} {res}   .000215  
{txt}        79{c |} {space 3} {res} .03311909 {space 3} {res} .00549839 {space 3} {res} .00021496  
{txt}        80{c |} {space 3} {res} .03017688 {space 3} {res} .00549878 {space 3} {res} .00021493  
{txt}        81{c |} {space 3} {res} .02749605 {space 3} {res} .00549914 {space 3} {res} .00021489  
{txt}        82{c |} {space 3} {res} .02505338 {space 3} {res} .00549946 {space 3} {res} .00021486  
{txt}        83{c |} {space 3} {res} .02282771 {space 3} {res} .00549976 {space 3} {res} .00021483  
{txt}        84{c |} {space 3} {res} .02079976 {space 3} {res} .00550003 {space 3} {res} .00021481  
{txt}        85{c |} {space 3} {res} .01895196 {space 3} {res} .00550027 {space 3} {res} .00021478  
{txt}        86{c |} {space 3} {res} .01726832 {space 3} {res}  .0055005 {space 3} {res} .00021476  
{txt}        87{c |} {space 3} {res} .01573425 {space 3} {res}  .0055007 {space 3} {res} .00021474  
{txt}        88{c |} {space 3} {res} .01433646 {space 3} {res} .00550089 {space 3} {res} .00021472  
{txt}        89{c |} {space 3} {res} .01306285 {space 3} {res} .00550106 {space 3} {res} .00021471  
{txt}        90{c |} {space 3} {res} .01190238 {space 3} {res} .00550121 {space 3} {res} .00021469  
{txt}        91{c |} {space 3} {res} .01084501 {space 3} {res} .00550136 {space 3} {res} .00021468  
{txt}        92{c |} {space 3} {res} .00988157 {space 3} {res} .00550148 {space 3} {res} .00021467  
{txt}        93{c |} {space 3} {res} .00900372 {space 3} {res}  .0055016 {space 3} {res} .00021466  
{txt}        94{c |} {space 3} {res} .00820385 {space 3} {res} .00550171 {space 3} {res} .00021465  
{txt}        95{c |} {space 3} {res} .00747504 {space 3} {res} .00550181 {space 3} {res} .00021464  
{txt}        96{c |} {space 3} {res} .00681098 {space 3} {res}  .0055019 {space 3} {res} .00021463  
{txt}        97{c |} {space 3} {res} .00620591 {space 3} {res} .00550198 {space 3} {res} .00021462  
{txt}        98{c |} {space 3} {res}  .0056546 {space 3} {res} .00550205 {space 3} {res} .00021461  
{txt}        99{c |} {space 3} {res} .00515226 {space 3} {res} .00550212 {space 3} {res} .00021461  
{txt}       100{c |} {space 3} {res} .00469455 {space 3} {res} .00550218 {space 3} {res}  .0002146  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=1.00 12:07:47

{com}. assert "`e(noftools)'"=="noftools"
{txt}r; t=0.00 12:07:47

{com}. savedresults comp ftools e(), exclude(macros: lasso2opt)
{txt}r; t=0.00 12:07:47

{com}. 
. ********************************************************************************
. ***  check residuals with fe                                                                                             ***
. ********************************************************************************
.                 
. clear
{txt}r; t=0.00 12:07:47

{com}. use https://www.stata-press.com/data/r16/nlswork
{txt}(National Longitudinal Survey.  Young Women 14-26 years of age in 1968)
r; t=1.15 12:07:48

{com}. 
. replace ln_w = . if year == 80
{txt}(1,847 real changes made, 1,847 to missing)
r; t=0.00 12:07:48

{com}. 
. cvlasso ln_w grade age c.age#c.age ttl_exp c.ttl_exp#c.ttl_exp tenure ///
>                 c.tenure#c.tenure 2.race not_smsa south , fe   

{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 5773.8216 {space 3} {res} .12747476 {space 3} {res} .00310667  
{txt}         2{c |} {space 3} {res} 5260.8912 {space 3} {res} .12495484 {space 3} {res} .00310658  
{txt}         3{c |} {space 3} {res} 4793.5281 {space 3} {res}  .1226151 {space 3} {res} .00308031  
{txt}         4{c |} {space 3} {res} 4367.6843 {space 3} {res} .12066902 {space 3} {res}  .0030576  
{txt}         5{c |} {space 3} {res} 3979.6712 {space 3} {res} .11905008 {space 3} {res} .00303789  
{txt}         6{c |} {space 3} {res} 3626.1282 {space 3} {res} .11770302 {space 3} {res} .00302068  
{txt}         7{c |} {space 3} {res}  3303.993 {space 3} {res} .11658195 {space 3} {res}  .0030056  
{txt}         8{c |} {space 3} {res} 3010.4753 {space 3} {res} .11563267 {space 3} {res} .00299085  
{txt}         9{c |} {space 3} {res}  2743.033 {space 3} {res} .11475514 {space 3} {res} .00298609  
{txt}        10{c |} {space 3} {res} 2499.3495 {space 3} {res} .11399079 {space 3} {res} .00297407  
{txt}        11{c |} {space 3} {res} 2277.3142 {space 3} {res}  .1133521 {space 3} {res} .00296225  
{txt}        12{c |} {space 3} {res} 2075.0039 {space 3} {res} .11281987 {space 3} {res} .00295167  
{txt}        13{c |} {space 3} {res} 1890.6663 {space 3} {res} .11237619 {space 3} {res} .00294217  
{txt}        14{c |} {space 3} {res} 1722.7047 {space 3} {res}  .1120062 {space 3} {res} .00293363  
{txt}        15{c |} {space 3} {res} 1569.6643 {space 3} {res} .11169753 {space 3} {res} .00292595  
{txt}        16{c |} {space 3} {res} 1430.2197 {space 3} {res}  .1114399 {space 3} {res} .00291902  
{txt}        17{c |} {space 3} {res} 1303.1629 {space 3} {res} .11122477 {space 3} {res} .00291277  
{txt}        18{c |} {space 3} {res} 1187.3935 {space 3} {res} .11104503 {space 3} {res} .00290713  
{txt}        19{c |} {space 3} {res} 1081.9087 {space 3} {res} .11089477 {space 3} {res} .00290203  
{txt}        20{c |} {space 3} {res} 985.79495 {space 3} {res} .11076817 {space 3} {res} .00289733  
{txt}        21{c |} {space 3} {res} 898.21965 {space 3} {res} .11063817 {space 3} {res} .00289377  
{txt}        22{c |} {space 3} {res} 818.42429 {space 3} {res} .11048562 {space 3} {res} .00289185  
{txt}        23{c |} {space 3} {res} 745.71773 {space 3} {res} .11034593 {space 3} {res} .00288596  
{txt}        24{c |} {space 3} {res} 679.47022 {space 3} {res}  .1102292 {space 3} {res} .00288075  
{txt}        25{c |} {space 3} {res} 619.10796 {space 3} {res} .11013292 {space 3} {res} .00287628  
{txt}        26{c |} {space 3} {res} 564.10812 {space 3} {res} .11005019 {space 3} {res} .00287267  
{txt}        27{c |} {space 3} {res} 513.99431 {space 3} {res} .10997531 {space 3} {res} .00287032  
{txt}        28{c |} {space 3} {res} 468.33247 {space 3} {res} .10990371 {space 3} {res} .00286671  
{txt}        29{c |} {space 3} {res}  426.7271 {space 3} {res} .10982698 {space 3} {res} .00286418  
{txt}        30{c |} {space 3} {res} 388.81784 {space 3} {res} .10949265 {space 3} {res} .00286292  ^
{txt}        31{c |} {space 3} {res} 354.27634 {space 3} {res}  .1091882 {space 3} {res} .00285404  
{txt}        32{c |} {space 3} {res}  322.8034 {space 3} {res} .10893516 {space 3} {res} .00284613  
{txt}        33{c |} {space 3} {res} 294.12644 {space 3} {res} .10872482 {space 3} {res} .00283907  
{txt}        34{c |} {space 3} {res} 267.99706 {space 3} {res} .10854996 {space 3} {res} .00283277  
{txt}        35{c |} {space 3} {res} 244.18894 {space 3} {res} .10840457 {space 3} {res} .00282713  
{txt}        36{c |} {space 3} {res} 222.49586 {space 3} {res} .10828367 {space 3} {res} .00282207  
{txt}        37{c |} {space 3} {res} 202.72995 {space 3} {res} .10818262 {space 3} {res} .00281723  
{txt}        38{c |} {space 3} {res} 184.71998 {space 3} {res} .10806692 {space 3} {res} .00281075  
{txt}        39{c |} {space 3} {res} 168.30996 {space 3} {res} .10792077 {space 3} {res} .00281215  
{txt}        40{c |} {space 3} {res} 153.35777 {space 3} {res} .10779928 {space 3} {res} .00281411  
{txt}        41{c |} {space 3} {res} 139.73389 {space 3} {res} .10769941 {space 3} {res} .00281593  
{txt}        42{c |} {space 3} {res} 127.32031 {space 3} {res}  .1076174 {space 3} {res} .00281762  
{txt}        43{c |} {space 3} {res} 116.00953 {space 3} {res} .10755013 {space 3} {res} .00281919  
{txt}        44{c |} {space 3} {res} 105.70356 {space 3} {res} .10749503 {space 3} {res} .00282064  
{txt}        45{c |} {space 3} {res} 96.313148 {space 3} {res} .10744997 {space 3} {res} .00282198  
{txt}        46{c |} {space 3} {res} 87.756954 {space 3} {res} .10741331 {space 3} {res} .00282321  
{txt}        47{c |} {space 3} {res} 79.960868 {space 3} {res} .10738179 {space 3} {res} .00282419  
{txt}        48{c |} {space 3} {res} 72.857365 {space 3} {res} .10735093 {space 3} {res} .00282568  
{txt}        49{c |} {space 3} {res} 66.384917 {space 3} {res} .10730958 {space 3} {res} .00282779  
{txt}        50{c |} {space 3} {res} 60.487464 {space 3} {res} .10721176 {space 3} {res} .00282829  
{txt}        51{c |} {space 3} {res} 55.113925 {space 3} {res} .10712304 {space 3} {res} .00282708  
{txt}        52{c |} {space 3} {res} 50.217755 {space 3} {res}  .1070495 {space 3} {res} .00282591  
{txt}        53{c |} {space 3} {res} 45.756548 {space 3} {res} .10698882 {space 3} {res} .00282481  
{txt}        54{c |} {space 3} {res} 41.691663 {space 3} {res} .10693885 {space 3} {res} .00282381  
{txt}        55{c |} {space 3} {res}  37.98789 {space 3} {res} .10689768 {space 3} {res} .00282292  
{txt}        56{c |} {space 3} {res} 34.613151 {space 3} {res} .10686449 {space 3} {res} .00282224  
{txt}        57{c |} {space 3} {res} 31.538214 {space 3} {res} .10683744 {space 3} {res} .00282178  
{txt}        58{c |} {space 3} {res} 28.736446 {space 3} {res} .10681523 {space 3} {res} .00282138  
{txt}        59{c |} {space 3} {res} 26.183579 {space 3} {res} .10679702 {space 3} {res} .00282102  
{txt}        60{c |} {space 3} {res} 23.857502 {space 3} {res}  .1067821 {space 3} {res}  .0028207  
{txt}        61{c |} {space 3} {res} 21.738068 {space 3} {res} .10676991 {space 3} {res} .00282042  
{txt}        62{c |} {space 3} {res} 19.806918 {space 3} {res}  .1067602 {space 3} {res} .00282016  
{txt}        63{c |} {space 3} {res} 18.047326 {space 3} {res}  .1067524 {space 3} {res} .00281993  
{txt}        64{c |} {space 3} {res} 16.444051 {space 3} {res} .10674608 {space 3} {res} .00281972  
{txt}        65{c |} {space 3} {res} 14.983207 {space 3} {res} .10674098 {space 3} {res} .00281954  
{txt}        66{c |} {space 3} {res}  13.65214 {space 3} {res}  .1067374 {space 3} {res}  .0028193  
{txt}        67{c |} {space 3} {res} 12.439321 {space 3} {res} .10673517 {space 3} {res} .00281903  
{txt}        68{c |} {space 3} {res} 11.334246 {space 3} {res} .10673377 {space 3} {res} .00281892  
{txt}        69{c |} {space 3} {res} 10.327343 {space 3} {res} .10673275 {space 3} {res} .00281886  
{txt}        70{c |} {space 3} {res} 9.4098905 {space 3} {res} .10673215 {space 3} {res}  .0028188  
{txt}        71{c |} {space 3} {res} 8.5739418 {space 3} {res} .10673147 {space 3} {res} .00281872  
{txt}        72{c |} {space 3} {res} 7.8122564 {space 3} {res} .10673057 {space 3} {res} .00281847  
{txt}        73{c |} {space 3} {res} 7.1182371 {space 3} {res} .10672992 {space 3} {res} .00281821  
{txt}        74{c |} {space 3} {res} 6.4858725 {space 3} {res} .10672952 {space 3} {res} .00281797  
{txt}        75{c |} {space 3} {res} 5.9096855 {space 3} {res}  .1067293 {space 3} {res} .00281775  
{txt}        76{c |} {space 3} {res} 5.3846853 {space 3} {res} .10672924 {space 3} {res} .00281756  
{txt}        77{c |} {space 3} {res} 4.9063247 {space 3} {res} .10672919 {space 3} {res} .00281738  
{txt}        78{c |} {space 3} {res} 4.4704603 {space 3} {res}   .106729 {space 3} {res} .00281723  
{txt}        79{c |} {space 3} {res}  4.073317 {space 3} {res} .10672891 {space 3} {res} .00281708  
{txt}        80{c |} {space 3} {res} 3.7114547 {space 3} {res} .10672889 {space 3} {res} .00281696  *
{txt}        81{c |} {space 3} {res} 3.3817393 {space 3} {res} .10672892 {space 3} {res} .00281684  
{txt}        82{c |} {space 3} {res} 3.0813149 {space 3} {res}   .106729 {space 3} {res} .00281673  
{txt}        83{c |} {space 3} {res} 2.8075794 {space 3} {res}  .1067291 {space 3} {res} .00281664  
{txt}        84{c |} {space 3} {res} 2.5581618 {space 3} {res} .10672923 {space 3} {res} .00281655  
{txt}        85{c |} {space 3} {res} 2.3309017 {space 3} {res} .10672936 {space 3} {res} .00281647  
{txt}        86{c |} {space 3} {res} 2.1238308 {space 3} {res} .10672951 {space 3} {res}  .0028164  
{txt}        87{c |} {space 3} {res} 1.9351556 {space 3} {res} .10672966 {space 3} {res} .00281633  
{txt}        88{c |} {space 3} {res} 1.7632417 {space 3} {res} .10672981 {space 3} {res} .00281627  
{txt}        89{c |} {space 3} {res} 1.6066001 {space 3} {res} .10672996 {space 3} {res} .00281621  
{txt}        90{c |} {space 3} {res} 1.4638742 {space 3} {res} .10673011 {space 3} {res} .00281616  
{txt}        91{c |} {space 3} {res} 1.3338277 {space 3} {res} .10673025 {space 3} {res} .00281612  
{txt}        92{c |} {space 3} {res} 1.2153341 {space 3} {res} .10673039 {space 3} {res} .00281608  
{txt}        93{c |} {space 3} {res} 1.1073672 {space 3} {res} .10673052 {space 3} {res} .00281604  
{txt}        94{c |} {space 3} {res} 1.0089917 {space 3} {res} .10673064 {space 3} {res}   .002816  
{txt}        95{c |} {space 3} {res} .91935567 {space 3} {res} .10673076 {space 3} {res} .00281597  
{txt}        96{c |} {space 3} {res} .83768265 {space 3} {res} .10673086 {space 3} {res} .00281594  
{txt}        97{c |} {space 3} {res} .76326523 {space 3} {res} .10673097 {space 3} {res} .00281592  
{txt}        98{c |} {space 3} {res} .69545885 {space 3} {res} .10673106 {space 3} {res} .00281589  
{txt}        99{c |} {space 3} {res}  .6336762 {space 3} {res} .10673115 {space 3} {res} .00281587  
{txt}       100{c |} {space 3} {res} .57738216 {space 3} {res} .10673123 {space 3} {res} .00281585  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
{p 0 8 2}^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.{p_end}
  Run model: {stata cvlasso, lse}
r; t=20.76 12:08:09

{com}. cvlasso, lse postres ols        
{txt}Estimate lasso with lambda=388.818 (lse).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 10}ttl_exp {c |}{col 21}{res}      0.0232380      0.0250723
{txt}{space 11}tenure {c |}{col 21}{res}      0.0135986      0.0405727
{txt}{space 17} {c |}
c.tenure#c.tenure {c |}{col 21}{res}     -0.0002010     -0.0021192
{txt}{space 17} {c |}
{space 9}not_smsa {c |}{col 21}{res}     -0.0568369     -0.0946133
{txt}{space 12}south {c |}{col 21}{res}     -0.0204092     -0.0654368
{txt}{hline 18}{c BT}{hline 32}
r; t=0.30 12:08:09

{com}.                 
. local sel = e(selected)
{txt}r; t=0.00 12:08:09

{com}. di "`sel'"
{res}ttl_exp tenure c.tenure#c.tenure not_smsa south
{txt}r; t=0.00 12:08:09

{com}. 
. predict double uehat  , ue noi  
{txt}Use e(b) from previous lasso2 estimation (lambda=388.8178425864).
(2,253 missing values generated)
Beta used for predict:
{res}{txt}                              c.tenure#                        
       ttl_exp      tenure    c.tenure    not_smsa       south
y1 {res}  .02507233    .0405727  -.00211919  -.09461331  -.06543685
{reset}r; t=0.07 12:08:09

{com}. predict double ehat  , e noi  
{txt}Use e(b) from previous lasso2 estimation (lambda=388.8178425864).
{res}{txt}(2,255 missing values generated)
Beta used for predict:
{res}{txt}                              c.tenure#                        
       ttl_exp      tenure    c.tenure    not_smsa       south
y1 {res}  .02507233    .0405727  -.00211919  -.09461331  -.06543685
{reset}r; t=0.08 12:08:09

{com}. predict double xbhat  , xb noi  
{txt}Use e(b) from previous lasso2 estimation (lambda=388.8178425864).
(441 missing values generated)
Beta used for predict:
{res}{txt}                              c.tenure#                        
       ttl_exp      tenure    c.tenure    not_smsa       south
y1 {res}  .02507233    .0405727  -.00211919  -.09461331  -.06543685
{reset}r; t=0.06 12:08:09

{com}. predict double xbuhat  , xbu noi  
{txt}Use e(b) from previous lasso2 estimation (lambda=388.8178425864).
{res}{txt}(2,255 missing values generated)
Beta used for predict:
{res}{txt}                              c.tenure#                        
       ttl_exp      tenure    c.tenure    not_smsa       south
y1 {res}  .02507233    .0405727  -.00211919  -.09461331  -.06543685
{reset}r; t=0.08 12:08:09

{com}. predict double uhat  , u noi  
{txt}Use e(b) from previous lasso2 estimation (lambda=388.8178425864).
(2,255 missing values generated)
{res}Beta used for predict:
{txt}                              c.tenure#                        
       ttl_exp      tenure    c.tenure    not_smsa       south
y1 {res}  .02507233    .0405727  -.00211919  -.09461331  -.06543685
{reset}r; t=0.08 12:08:09

{com}. 
. xtreg ln_w `sel' if e(sample), fe 
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    26,279
{txt}Group variable: {res}idcode{txt}{col 49}Number of groups{col 67}={col 69}{res}     4,686

{txt}R-squared:{col 49}Obs per group:
     Within  = {res}0.1693{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     Between = {res}0.3659{col 63}{txt}avg{col 67}={col 69}{res}       5.6
{txt}     Overall = {res}0.2652{col 63}{txt}max{col 67}={col 69}{res}        14

{txt}{col 49}F({res}5{txt}, {res}21588{txt}){col 67}={col 70}{res}   880.13
{txt}corr(u_i, Xb) = {res}0.2383{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     ln_wage{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}ttl_exp {c |}{col 14}{res}{space 2} .0250723{col 26}{space 2} .0006989{col 37}{space 1}   35.87{col 46}{space 3}0.000{col 54}{space 4} .0237025{col 67}{space 3} .0264422
{txt}{space 6}tenure {c |}{col 14}{res}{space 2} .0405727{col 26}{space 2}  .001679{col 37}{space 1}   24.17{col 46}{space 3}0.000{col 54}{space 4} .0372818{col 67}{space 3} .0438636
{txt}{space 12} {c |}
{space 4}c.tenure#{c |}
{space 4}c.tenure {c |}{col 14}{res}{space 2}-.0021192{col 26}{space 2} .0001053{col 37}{space 1}  -20.13{col 46}{space 3}0.000{col 54}{space 4}-.0023255{col 67}{space 3}-.0019129
{txt}{space 12} {c |}
{space 4}not_smsa {c |}{col 14}{res}{space 2}-.0946133{col 26}{space 2} .0099502{col 37}{space 1}   -9.51{col 46}{space 3}0.000{col 54}{space 4}-.1141165{col 67}{space 3}-.0751101
{txt}{space 7}south {c |}{col 14}{res}{space 2}-.0654368{col 26}{space 2} .0115076{col 37}{space 1}   -5.69{col 46}{space 3}0.000{col 54}{space 4}-.0879926{col 67}{space 3}-.0428811
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.496173{col 26}{space 2} .0066506{col 37}{space 1}  224.97{col 46}{space 3}0.000{col 54}{space 4} 1.483137{col 67}{space 3} 1.509209
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .36130003
     {txt}sigma_e {c |} {res} .29371543
         {txt}rho {c |} {res} .60209327{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}4685{txt}, {res}21588{txt}) = {res}6.23{col 62}{txt}Prob > F = {res}0.0000
{txt}r; t=3.60 12:08:13

{com}. mat bxtreg = e(b)
{txt}r; t=0.00 12:08:13

{com}. 
. predict double uehat_xtreg   , ue  
{txt}(2,253 missing values generated)
r; t=0.02 12:08:13

{com}. predict double ehat_xtreg   , e 
{txt}(2,255 missing values generated)
r; t=0.08 12:08:13

{com}. predict double xbhat_xtreg  , xb
{txt}(441 missing values generated)
r; t=0.01 12:08:13

{com}. predict double xbuhat_xtreg  , xbu
{txt}(2,255 missing values generated)
r; t=0.07 12:08:13

{com}. predict double uhat_xtreg  , u
{txt}(2,255 missing values generated)
r; t=0.07 12:08:13

{com}. 
. assert abs(ehat_xtreg-ehat)<10e-8 | (missing(ehat_xtreg) | missing(ehat))
{txt}r; t=0.00 12:08:13

{com}. assert abs(uehat_xtreg-uehat)<10e-8 | (missing(uehat_xtreg) | missing(uehat)) 
{txt}r; t=0.00 12:08:13

{com}. assert abs(xbhat_xtreg-xbhat)<10e-8 | (missing(xbhat_xtreg) | missing(xbhat))
{txt}r; t=0.00 12:08:13

{com}. assert abs(xbuhat_xtreg-xbuhat)<10e-8 | (missing(xbuhat_xtreg) | missing(xbuhat))
{txt}r; t=0.00 12:08:13

{com}. assert abs(uhat_xtreg-uhat)<10e-8 | (missing(uhat_xtreg) | missing(uhat))
{txt}r; t=0.00 12:08:13

{com}. 
. 
. ********************************************************************************
. *** finish                                                                   ***
. ********************************************************************************
. 
. cap log close
{smcl}
{com}{sf}{ul off}